{"title":"Geolocalização e Logística – Hipsters #53","releaseDate":"18/07/2017","tags":["Podcast","programação"],"people":["Paulo Silveira","Mauricio Linhares","Roberto","Fred Hohagen"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1007%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D1007&t_u=https%3A%2F%2Fhipsters.tech%2Fgeolocalizacao-e-logistica-hipsters-53%2F&t_e=Geolocaliza%C3%A7%C3%A3o%20e%20Log%C3%ADstica%20%E2%80%93%20Hipsters%20%2353&t_d=Geolocaliza%C3%A7%C3%A3o%20e%20Log%C3%ADstica%20-%20Hipsters%20%2353%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Geolocaliza%C3%A7%C3%A3o%20e%20Log%C3%ADstica%20%E2%80%93%20Hipsters%20%2353&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Renato Dinhani","comment":"Excelente episódio.Uma dúvida que eu fiquei é como o software lida com a atualização das informações de trechos, e com possíveis informações desatualizadas, porque num grafo com milhões de arestas, acho que uma informação ou outra pode acabar não condizendo com a realidade."},{"author":"Roberto Marin","comment":"Olá Renato Dinhani, com certeza, informações desatualizadas são sim um problema.Atualmente usamos a base de dados da TomTom, que tem atualização semestral, então, claramente haverá trechos que a otimização levará em consideração para criar uma rota, mas que de fato pode não ser um caminho válido ou possível. O impacto é bem pequeno, afinal dos 120 milhões de arestas, apenas um número muito pequeno sofre alteração, portanto o impacto na otimização é mínimo.Imagine o seguinte cenário, 100% da base atualizada e correta, certo? Imagine que um grande acidente em uma via – exemplo caminhão pegando fogo na Av. Bandeirantes, debaixo da ponte da Av. Santo Amaro – irá obrigar caminhos distintos que a otimização não estaria sabendo, correto? Isso tudo entra na navegação, e não na otimização. Sendo assim, o processo de otimização tenta otimizar somente as variáveis conhecidas e não leva em conta transtornos do dia a dia. O que estamos fazendo para melhorar isso é por exemplo utilizar transito histórico das vias, etc.Além disso, para solucionar o problema num curto prazo, nosso sistema permite que a empresa gerencie as arestas manualmente, então a empresa pode criar o que chamamos de Zonas de Restrição. Em uma Zona de Restrição, você pode proibir que as arestas, ou apenas uma aresta, sejam levadas em consideração. Você pode também criar novas vias. Imagine uma zona super rural, onde não existem ruas oficiais nos mapas Google ou TomTom, nosso sistema permite que você crie trechos novos que interligam fazendas – de leite ou não :D – ou vilas e cidades.De qualquer forma, sim, a falta de atualização pode gerar alguns problemas, mas que no dia-a-dia e malícia de um caminhoneiro são problemas não tão grandes. :)Abraços!"},{"author":"Black Power Dog","comment":"Uai migrou de Delphi pra Java, regrediu ..."},{"author":"Anderson Joyle","comment":"Fiquei imaginando como seria a arte de vitrine desse episodio (estilo nerdcast):- Um caminhao de queijo escoltado por policiais franceses.- Um frances atras de um bolo de aniversario, segurando uma baguete, mal-humorado.- Um senhor idoso. Le-se \"Posicao: Ze roterizador\" em seu cracha.- Um frances com cara de espanto ao ouvir a frase \"Quando chegarem aqui, colocar-te-ei em uma sala e o pau vai comer\".- Baguetes dispostas randomicamente no background.Favor providenciar esta arte de vitrine.Parabens pelos episodios. Um melhor que o outro."},{"author":"Paulo Silveira","comment":"boa Anderson! Esse episodio esteve comico mesmo!"},{"author":"²He","comment":"Me lembrou meu TCC, um problema aparentemente bem diferente mas com a solução muito semelhante.Dadas as localizações em 3D dos pontos em uma area industrial e parametrizada as especificações de um tipo de rede industrial (numero de pontos por segmento, distancias maximas, potencia dos instrumentos, etc), criava a melhor distribuição dos das caixas de junção no campo e depois calculava a melhor rota pra conectar todas as caixas.Nunca tinha pensado em problemas de roteamento de mapa com a complexidade apresentada mas achei fantastico! Ótimo programa!"},{"author":"Roberto Marin","comment":"²He bem interessante o seu TCC! É incrível como quando paramos para analisar, muitas coisas que estão ao nosso redor são problemas de logística, e esse seu problema é justamente isso, criar a melhor distribuição de acordo com as caixas de junção.Abraços!"},{"author":"Mauricio R. Duarte","comment":"Trabalho em uma empresa que faz loteamentos em terrenos, portanto, busca constante em possíveis áreas. MapLink ajudaria nesse caso ? Se não, alguma solução semelhante ?Parabéns, sou aluno Alura e acompanho vcs todas semana ! Excelente"},{"author":"Roberto Marin","comment":"Olá Mauricio R. Duarte, o Maplink tem sim uma solução chamada Landmark que pode ajudar você com essa situação.Abraços!"},{"author":"Gabs Ferreira","comment":"\"é tipo que nem os Flintstones faziam\"HAHAHAHAHAHA"},{"author":"rgarbin","comment":"Me lembrou a palestra do Márcio Cabral (Scipopulis) e Julian Monteiro (Scipopulis) no Agile Trends, tema foi: Analisando em tempo real uma das maiores redes de transporte do mundo"},{"author":"Lucas Palma Stabile","comment":"Interessante falarem um pouco das tecnologias por trás dessas APIs e outras soluções, principalmente a da empresa francesa com um grande software em Java e outros casos citados de legados. Gostaria de saber mais sobre como as grandes empresas gerenciam esses tipos de projetos enormes de software e legados, daria um bom episódio! Já trabalhei em projetos que parecia que não dávamos conta e em legados e foi complicado."},{"author":"Roberto Marin","comment":"Olá Lucas Palma Stabile,Neste software francês, usamos uma tecnologia proprietária de mapas, mas para isso usamos mapas em uma base da TomTom que nós licenciamos para gerar este modelo que é utilizado e enriquecido com diversos dados extras, como pontos de interesse, transito histórico, e outras informações.Já nas APIs usamos bastante Spring bem simples com REST ou SOAP (alguns ERPs só integram via SOAP :P), no motor que faz a roteirização usamos algoritmos escritos em C++, e a aplicação em si usa muito SWT (aquele framework dos eclipse) para criar as telas. SWT é importante porque muitas vezes o software roda on premisse, imagina um centro de distribuição gigante, 100 caminhões esperando para sair, mas sem internet? Pois é, por isso on premisse acaba sendo uma saída, afinal mesmo em caso de falta de energia (gerador local), internet, ou outro recurso, o centro de distribuição continuará funcionando! :)Abraços!"},{"author":"Lucas Palma Stabile","comment":"Obrigado pela resposta!Não conheço muito de java (só vi na faculdade) e nem as ferramentas que você citou, mas é interessante sabe das ferramentas e tecnologias que vocês utilizam em casos como este."},{"author":"Maurício Linhares","comment":"Seria muito bom mesmo!"},{"author":"Luiz Costa","comment":"Bom dia, e com as explicações foi possível entender a diferença que sempre via nos elevadores entre MapLink e CET. Parabéns Hipster!"},{"author":"Roberto Marin","comment":"Legal Luiz Costa, exatamente, eu também pensava isso antes de trabalhar no Maplink, uai, mas antes era só 200km, agora temos 700km? :D :D :D"},{"author":"Sebastião Relson Reis da Luz","comment":"Me lembrou os bons e velhos de ESRI Map Objects :DComo sempre ótimo episódio"},{"author":"Fernando Quadro","comment":"Map Objects e o Alov Map (applet) tenho calafrios só de lembrar dessa época! rsrsrs!"}]}