{"title":"Scrum: do zero ao Sprint – Hipsters #54","releaseDate":"25/07/2017","tags":["agilidade","business","Podcast"],"people":["Paulo Silveira","Mauricio Linhares","Ceci Fernandes","Alexandre Magno","Lucas Takeshi"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1015%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D1015&t_u=https%3A%2F%2Fhipsters.tech%2Fscrum-do-zero-ao-sprint-hipsters-54%2F&t_e=Scrum%3A%20do%20zero%20ao%20Sprint%20%E2%80%93%20Hipsters%20%2354&t_d=Scrum%3A%20do%20zero%20ao%20Sprint%20-%20Hipsters%20%2354%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Scrum%3A%20do%20zero%20ao%20Sprint%20%E2%80%93%20Hipsters%20%2354&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Jonas Chaves","comment":"Gostei bastante do episódio. Ótimo panorama pra iniciantes e um bons casos para quem já implementa a metodologia.Seria possível vocês disponibilizarem a referência do livro (ebook?) de Fluxo Contínuo mencionado pela Cecília?"},{"author":"Fernanda Jablonski","comment":"Vocês já tem um planejamento de fazer um podcast sobre estimativas de software no ágil? Como usar Fibonacci por exemplo."},{"author":"Julio Saito","comment":"Um dos melhores episódios até agora, só com fera no assunto :)"},{"author":"Fernando Souza","comment":"Manda a referencia do livro de fluxo continuo."},{"author":"Ana Eliza B. Freitas","comment":"Episódio mto bom, com convidados que agregaram mto!!!Recomendando e já está na minha lista de material de estudo para futuros episódios.Saber na prática é bem diferente da teoria, mas o bacana é ter os dois conhecimentos alinhados para agregar ao time, e tbm ter conhecimento de outras metodologias para agregar!!!"},{"author":"Victor Muramoto","comment":"Episódio muito bom! Gostaria de saber como posso sugerir um assunto para um episódio? =D"},{"author":"Marcelo Poggi","comment":"Senhores, Parabéns pelo primeiro ano! E que venham Décadas. Forte Abraço a todos."},{"author":"Ângelo Duarte","comment":"Primeiramente gostaria de parabenizar pelo conteúdo do Hipsters.tech. Tento sempre acompanhar.Sou novo com o scrum e fiquei com duas dúvidas, se vocês puderem ajudar.1 - Digamos que temos uma histórica com esforço estimado de 13 pontos. Essa história foi iniciada na sprint, mas por qualquer motivo ela não foi concluída. Na próxima sprint essa história entra com a mesma pontuação ou é o esforço é reavaliado considerando o que já foi feito?2 - Ceci comentou que no desenvolvimento dos cálculos fiscais do erp da Caelum, o especialista sentou com o desenvolvedor para explicar e tirar as dúvidas. Como é que essas regras e funções dos sistemas que são essenciais e bem complexas são (e se são) documentadas?Valeu!!"},{"author":"Flávio","comment":"Olá Ângelo,Posso falar sobre a primeira pergunta: depende. Já tive casos em que a história ficou pronta, \"faltando a documentação\" apenas. Nesse caso, recalculamos de acordo com o esforço de escreve-la. Mas já tive outros casos em que \"faltou apenas testar\". Nesse caso, eu como Scrum Master, chamei atenção para o fato que ao testar, poderia ser necessário re-escrever boa parte do código. Dado a funcionalidade e o contexto do projeto em questão, essa história ficou até com uma pontuação mais alta, pois a parte de teste foi realmente trabalhosa.Em suma, eu voltaria para a história, veria o que eu aprendi até aquele momento e re-avaliaria sua pontuação. Aí pode ir para cima ou para baixo.Abraços!"},{"author":"Joao Paulo Haddad","comment":"Achei bastante interessante o podcast. Tem alguma previsão de falar sobre o Python?"},{"author":"Jorge Improissi","comment":"Excelente podcast!Gostei das definições de ScrumMasters \"O bom, o mal e o feio\", só acho que na maioria das vezes o próprio mercado não deixa o cara ser exclusivamente SM.Vida longa ao Hipsters! ;)"},{"author":"Leandro Takeda","comment":"Enviado pra minha esposa que trabalha na área de learning e recentemente se interessou por Agile, Scrum.... vlw Hipsters.tech, show!"},{"author":"Eduardo","comment":"Muito bom o podcast, meus parabéns! Eu só senti falta do link do artigo aberto do Celso Martins que a Ceci Fernandes mencionou ao final do podcast."},{"author":"Fabrício Silva","comment":"Se alguém tiver também gostaria do link pro livro do Celso Martins."},{"author":"celsoMartins","comment":"Olá Eduardo e Fabrício Silva segue o link: http://blog.taller.net.br/e..."},{"author":"Eduardo","comment":"Valeu!"},{"author":"Fabrício Silva","comment":"Valeu celsoMartins !"},{"author":"Thyago","comment":"Ótimo tema, bem agora que vou ter aulas sobre Scrum! Parece até que vocês adivinham :D"},{"author":"reegomes","comment":"Meus parabéns a toda equipe pelo excelente trabalho, até me arrepiou na hora da homenagem ao LP."},{"author":"Gilberto Caetano de Andrade","comment":"Falhou silenciosamente em uma autarquia - literalmente abafado/combatido pelo cliente e/ou colegas de profissão.Em outra, tirei o jargão: mas quase infartei ao impedir a má compreensão de colegas (Faltou de minha parte lidar melhor com as pessoas)"},{"author":"Cleiton Dantas","comment":"Meus parabéns a toda equipe pelo excelente trabalho, acompanho todos dês do inicio do hipster.tech"},{"author":"Luiz Carlos Pedroso Gomes","comment":"e SCRUM com APF, rola?"},{"author":"Inaldo Brandão","comment":"Muito bom, parabéns aos Hipsters pelo aniversário, acompanho todos desde o início, muito show  a homenagem ao Linkin Park."},{"author":"Lucas Oliveira","comment":"Trabalhei em um projeto que usávamos Scrum, particularmente gostei bastante e hoje não trabalho com metodologias ágeis e sinto muita falta, era bem divertido :)Achei legal a participação do Alexandre Magno, se não estou enganado foi ele que traduziu o bootstrap...Gostei do episódio, parabéns galera!"},{"author":"Fernando Boaglio","comment":"Muito bom podcast. Nossa, faz quase 10 anos que deu esse boom do SCRUM e eu escrevi um artigo sobre SCRUM Solo e lembro de ter conversado com o GC sobre ele no FISL... ele pesava o dobro do que pesa hoje kkk  http://www.boaglio.com/inde..."},{"author":"João Antônio","comment":"Estava atrás de bons materiais para escrever minha monografia que trata um pouco de Scrum e ...tandan, veja só o assunto de hoje do hipsters, bom demais, parabéns a todos."},{"author":"Willyan Guimarães Caetano","comment":"O livro \"Scrum: a arte de fazer o dobro do trabalho na metade do tempo\", escrito por um dos co-criadores, Jeff Sutherland, é uma ótima referência para entender várias das atividades e papeis comentados durante a conversa do podcast. Além da história por trás da concepção das ideias do Scrum, o livro aborda vários estudos que foram base para muitas das práticas adotadas no dia a dia para uma equipe ágil."},{"author":"Lucas Palma Stabile","comment":"Onde trabalhei tentamos implementar o Scrum, mas acabou não dando muito certo, não sei se porque o time tinha basicamente gente com pouca experiência, se não tínhamos um Scrum master ou o PO experientes ou faltou empenho e dedicação na metodologia mesmo. Usávamos o TFS da Microsoft que já gerenciava o código para também gerenciar os backlogs, mas muitas vezes o backlog não era muito técnico e gostaria de saber as opiniões de vocês. Quase todos os backlogs que cadastrávamos, o desenvolvedor tinha que parar para ler, entender o que estava sendo proposto, e às vezes não estava bem claro e procurávamos com outras pessoas detalhes que esqueceram de incluir, e aí arquitetar como iríamos implementar o Backlog, mesmo que nas reuniões discutíamos algumas coisas sobre alguns Backlogs, mas quase sempre era assim. Não achava produtivo sempre ficar parando de backlog em backlog para definir tecnicamente como implementar, como ficará as classes, que frammeworks utilizar e ao mesmo tempo acabar deixando essas definições nas mãos de um desenvolvedor, ainda mais alguém pouco experiente nisso. No Scrum, é definido a arquitetura e frameworks nos Backlogs? Isso era algo de onde trabalhei, que o gerenciamento de projetos não era muito sólido mesmo?"},{"author":"Gustavo Fão Valvassori","comment":"\"Ceci Fernandes, agile coach e desenvolvedora na\" é tão difícil que não entro nem no texto :joy:"},{"author":"Paulo Silveira","comment":"ahhaah. deixei de escrever pra nao errar o TH e esqueci!"},{"author":"Gabs Ferreira","comment":"Opa, faltou o link Gustavo! Valeu por avisar, arrumamos aqui :)"},{"author":"Anderson Joyle","comment":"Parabens pelo episodio.A referencia do Link Park (ao final) foi uma homenagem intencional?"},{"author":"Paulo Silveira","comment":"certamente! dos editores :)"},{"author":"Cow Vakoski","comment":"Bacana, gostei  desse podcast! vou voltar e ouvir os anteriores, parabéns"}]}