{"title":"Startups, Processos e Mercado Global – Hipsters #55","releaseDate":"01/08/2017","tags":["business","Podcast","startup"],"people":["Paulo Silveira","Mauricio Linhares","Alessio Alionço","Marcio Trindade","Rafael Rosa"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1030%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D1030&t_u=https%3A%2F%2Fhipsters.tech%2Fstartups-processos-e-mercado-global-hipsters-55%2F&t_e=Startups%2C%20Processos%20e%20Mercado%20Global%20%E2%80%93%20Hipsters%20%2355&t_d=Startups%2C%20Processos%20e%20Mercado%20Global%20-%20Hipsters%20%2355%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Startups%2C%20Processos%20e%20Mercado%20Global%20%E2%80%93%20Hipsters%20%2355&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Marcus Vinícius Pereira e Sous","comment":"Gostaria de saber mais ou menos uma referência de como sair do cargo de Analista de Requisitos Trainee (Meu cargo atual) para passar a ter habilidades e aptidões nas áreas de UX e Scrum. - Como disse tem muitas empresas que os líderes são pessoas voltadas ao perfil de UX com perfis de líderes dentro das corporações.Mas pelo fato de ser ainda 'Novo no mercado' me vejo muito pobre em questão de aptidões...."},{"author":"Thiano Pereira Lima","comment":"Estou tentando migrar nossos boards e fluxo que ja usamos no trello para o pipefy, porem estou tentado dificuldades com o visual do card e a dificuldade de enviar o cards entre os pipes, que ate onde eu vi não é possivel, tenho que automatizar um clone de cards entre pipes é isso mesmo?"},{"author":"Thiago Varjão","comment":"Que massa a participação do Rafael. Sou um dos órfãos do Grok, e por falar neles, acho que Rafael e o Brando rendem um programa muito bom, hein!!!Abraços e parabéns pelo trabalho."},{"author":"Marcel Rodrigo","comment":"EP sensasional!A ferramenta é realmente muito legal, mas a maneira como a Pipefy está atacando é demais!"},{"author":"Raphael Costa","comment":"Dá uma olhada na nossa versão do Pipefy para developers https://www.pipefy.com/deve..."},{"author":"Cavaleiro de lugar nenhum","comment":"Galera, gostaria de saber se esse podcast tem alguns programas mais didáticos, uma colega de turma não é muito habituada com o nosso mundo e gostaria que ela não desistisse do curso :3 Estou procurando os casts, mas quem já escutou todos e puder ajudar"},{"author":"Vinícius","comment":"Que tal o https://mundopodcast.com.br... ?"},{"author":"Jaime Neto","comment":"Qual a ferramenta de internacionalização citada no episódio?"},{"author":"Raphael Costa","comment":"PhraseApp"},{"author":"Tiago Abner","comment":"Não conhecia o Pipefy e passei a usar para escalar minha operação. Obrigado a todos pelo excelente podcast, continuem gerando conteúdo de qualidade."},{"author":"Raphael Costa","comment":"Dá uma olhada na nossa versão para developers https://www.pipefy.com/deve..."},{"author":"Daniel Cavalcante","comment":"Será que poderiam disponibilizar alguns links citados no podcast? Exemplo: Qual tecnologia a Pipefy usa para APIs."},{"author":"Raphael Costa","comment":"Usamos GraphQL. Link da nossa documentação: http://docs.pipefy.apiary.io"},{"author":"Rodrigo Dias","comment":"Qual serviço vocês usam para traduzir para outras linguas?"},{"author":"Raphael Costa","comment":"PhraseApp"},{"author":"Rafael","comment":"Os Links úteis ainda estão do Hipster 54"}]}