{"title":"Data Science e Política na Operação Serenata de Amor – Hipsters #62","releaseDate":"19/09/2017","tags":["Podcast","programação"],"people":["Paulo Silveira","Mauricio Linhares","Irio Musskopf","Eduardo Cuducos"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1040%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D1040&t_u=https%3A%2F%2Fhipsters.tech%2Fdata-science-e-politica-na-operacao-serenata-de-amor-hipsters-62%2F&t_e=Data%20Science%20e%20Pol%C3%ADtica%20na%20Opera%C3%A7%C3%A3o%20Serenata%20de%20Amor%20%E2%80%93%20Hipsters%20%2362&t_d=Data%20Science%20e%20Pol%C3%ADtica%20na%20Opera%C3%A7%C3%A3o%20Serenata%20de%20Amor%20-%20Hipsters%20%2362%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Data%20Science%20e%20Pol%C3%ADtica%20na%20Opera%C3%A7%C3%A3o%20Serenata%20de%20Amor%20%E2%80%93%20Hipsters%20%2362&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Ana Paula Radaelli","comment":"Belo episódio, importantíssimo! Inclui um capítulo sobre a Operação na Série Eleições 2018 - https://bit.ly/2E0m7U9! Valeu, Hipsters!"},{"author":"Dreyfi Ferreira","comment":"Acho que principalmente isso deve ser denunciado ao povo. Deveria haver uma página pública, mostrando em tempo real os gastos suspeitos."},{"author":"David Lucas","comment":"Show, vou passar a divulgar"},{"author":"CRISLANIO","comment":"Outro projeto de dados abertos voltado para as bases de servidores e pagamentos do Governo Federal. https://crislanio.wordpress..."},{"author":"Yukio","comment":"Parabéns pelo episódio! Um dos melhores com certeza, baita iniciativa"},{"author":"Marcelo Ribeiro","comment":"Episódio excelente e o projeto também.Só achei que muito curto o episódio, creio que poderia ter durado um pouco mais.A \"melhor\" linguagem para trabalhar com Data Science (em geral) é Python mesmo? Ou tem outras melhores?"},{"author":"Yukio","comment":"Acho que essa leitura vale a pena: https://www.analyticsvidhya..."},{"author":"Marcelo Ribeiro","comment":"Vlw pela dica de leitura."},{"author":"Marcos","comment":"Um projeto análogo é a OPS (Operação Politica Supervisionada) do Lucio Big. Não tem tanta tecnologia, mas é efetivo e vale ser citado pelo tema.https://ops.net.br/A OPS também é colaborativa, já trabalha com dossiês há um bom tempo e já recuperou alguns milhões do dinheiro da CEAP gasto indevidamente."},{"author":"steimntz","comment":"O projeto tem que mudar de nome pois o objetivo principal não será mais capaz de ser realizado :(http://www.diariodepernambu..."},{"author":"Maurício Linhares","comment":"Mas que triste :("},{"author":"Paulo Silveira","comment":"pensei nisso tambem! casaram as datas :)"},{"author":"Silas Vasconcelos","comment":"Parabéns galera, Pods top!"},{"author":"Talita sousa","comment":"Conteúdo perfeito como sempre.Introdução muito ruim eu sempre coloco para rodar e vou tomar café para não ouvir a introdução"},{"author":"Antonio Neto","comment":"Aqui na paraíba(que é onde moro) tem um evento que tem o apoio do ministerio publico que é para incetivar esses  tipo de projetos, como o serenata, contra a corrupção que é o hackfest,(http://hackfest.com.br/ )"},{"author":"Rubinho_sjr","comment":"Muito interessante, principalmente por estar iniciando meus estudos em analise de dados.Acabei de ver a API e a documentação aqui e vou dar uma olhada mais a fundo (não que eu vá entender algo)Eduardo Cuducos  e todos os envolvidos parabéns pela excelente iniciativa."},{"author":"Rubinho_sjr","comment":"SUAHSUHA Ai ouvindo o cast completo a gente vê que não precisava ter feiro a pergunta porque os caras deram umas dicas fenomenais exatamente pra quem ta começando =]"},{"author":"Ednaldo Dilorenzo","comment":"Muito boa discussão. Acho que temos que usar nosso conhecimento para melhorar o país. Pois para cobrar impostos temos tecnologia de ponta, mas para fiscalizar não temos, e se depender de iniciativa dos políticos, nunca teremos.Achei muito interessante também os caminhos que ainda podem ser explorados."},{"author":"²He","comment":"Pedi faz um tempo, tava na lista, e saiu! \\o/Programa muito bom, já trabalhei com IA e estatisticas no TFG e estou aprendendo python, não lembrava que a Op. Serenata de Amor era em Python, vou explorar mais e tentar contribuir com algo.Quanto ao problema de as denuncias terem que ser feitas por um CPF e que a Rose pode errar em alguma análise. Pq não trabalhar com voluntários como \"Mechanilar Turk\"? Cadastrar os voluntários, talvez filtrar alguns ou distribuir mesmo pra qualquer um que se cadastre e entregar as denuncias \"montadas\" pra validação de alguém e essa pessoa fisica faria a denuncia e indicaria isso de volta pro sistema, talvez com um número de processo ou algo assim.Caso essa informação não volte (processo aberto ou falso positivo) ou se a pessoa não abrir o processo (não sei se tem como checar), disparar a mesma denuncia pra outra pessoa.Ou usar varias pessoas pra checarem os dados, como um \"captcha\".Sei la, to empolgado =XAtt."},{"author":"Eduardo Cuducos","comment":"Já tentamos algo como “mechanical turk”. O problema foi que para a denúncias serem qualificadas as pessoas precisam de um conhecimento específico da legislação… por isso não deu certo ; )"},{"author":"²He","comment":"PS: Tem algum caminho simples pra reportar um erro no sistema do Jarbas?Fiz uma busca, os dados são de uma nota fiscal mas o \"pdf\" é de outra nota, em outro valor, outro nome, completamente diferente."},{"author":"Eduardo Cuducos","comment":"Talvez esse erro não seja do Jarbas, mas da Câmara. No site deles as informações batem? De qualquer forma a melhor maneira de reportar coisas do Jarbas é pelo GitHub dele https://github.com/datascie..."},{"author":"Sebastião Relson Reis da Luz","comment":"Confesso que rolou uma frustração de leve a moderada de o Serenata não ter ligação com o Negociata de Amor https://www.negociatadeamor..."},{"author":"Vitor Panuci","comment":"Confesso que quando li o título do podcast eu pensei \"Ué, Gregório no Hipsters, não entendi\""},{"author":"DanCoutoS","comment":"Acho que o Irio e o Eduardo não podem mais andar de avião no brasil."},{"author":"Eduardo Cuducos","comment":"Irio."},{"author":"DanCoutoS","comment":"Corrigido o/"},{"author":"Vitor Panuci","comment":"Muito interessante este projeto, existe alguma API para que possamos obter os dados \"mastigados\" pela Rose?"},{"author":"Eduardo Cuducos","comment":"Claro! API JSON em https://jarbas.serenatadeam... (documentação em https://github.com/datascie..., visualização para humanos em https://jarbas.serenatadeam..."},{"author":"Henrique Droog","comment":"Bom dia Hipsters, o podcast de hoje estava muito bom. Acho realmente importante ver estas iniciativas usando tecnologia na tentativa de ajudar a parar a corrupcao ja no seu comeco."},{"author":"Luiz Costa","comment":"Bom dia Hispters, ótimo podcast e esses gastos com o dinheiro público menor que seja como vocês disseram, deve ser coibido. Dúvida, mostrar os gastos do político no próximo ano, que é um ano de eleição é algo juridicamente legal? Abs e parabéns!!"},{"author":"Eduardo Cuducos","comment":"Oi Luiz. Não sei se entendi tua pergunta… na verdade para o próximo ano o que existe é planejamento de orçamento, e discutir isso é plenamente legal https://medium.com/data-sci... Já os gastos com verba indenizatória só são conhecidos após o reembolso ser efetuado (ou seja, só há dados do passado)… faz sentido?"}]}