{"title":"Ionic e o Desenvolvimento Mobile – Hipsters #56","releaseDate":"08/08/2017","tags":["front-end","mobile","Podcast","programação"],"people":["Paulo Silveira","Sergio Lopes","Loiane Groner"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1045%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D1045&t_u=https%3A%2F%2Fhipsters.tech%2Fionic-e-o-desenvolvimento-mobile-hipsters-56%2F&t_e=Ionic%20e%20o%20Desenvolvimento%20Mobile%20%E2%80%93%20Hipsters%20%2356&t_d=Ionic%20e%20o%20Desenvolvimento%20Mobile%20-%20Hipsters%20%2356%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Ionic%20e%20o%20Desenvolvimento%20Mobile%20%E2%80%93%20Hipsters%20%2356&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"ojosejefferson","comment":"Não conhecia o site,muito bom gostei do podcast !"},{"author":"Carlos Carvalho","comment":"Muito bacana esse assunto, acompanho o trabalho da Loiane desde a época que ela começou a fazer tutoriais de ExtJs. Parabéns galera."},{"author":"DuShin","comment":"Eu acho que com o React Native, o desenvolvimento com Ionic perde muitas de suas vantagens. A curva de aprendizado de React comparado com a de Angular2+ não é tão diferente, e eu acho que os ganhos de performance com o RN são bem consideráveis. E por performance eu digo transformações e fluxos de telas.Instagram e AirBnb são apps bem fluidos e que foram feitos com RN."},{"author":"Sergio Clemente Da Silva Filho","comment":"Felizmente híbrido não é sinônimo de ionic.Odeio essa frescura do ionic ficar só no angular..."},{"author":"Douglas dos Santos","comment":"Muitas pessoas criticam o desenvolvimento híbrido, mas eu nunca vejo argumentos muito concretos. Na maioria das vezes falam \"é ruim\" e acabou..."},{"author":"Maurício Linhares","comment":"Antigamente era bem ruim mesmo, usei apps com phonegap anos atrás e a lentidão era visível, o pessoal entendia muito pouco de como fazer, mas hoje tá muito melhor mesmo."},{"author":"Junior Osho","comment":"Loiane além de ser a prof de angular 2 e uma Paulo Silveira de Simpática. .."},{"author":"Paulo Silveira","comment":"opa! elogio taken :P"},{"author":"Joel Piccoli da Rosa","comment":"seria excelente poder usar o ionic com vueJS! Com certeza eu usaria mais o Ionic se pudesse escolher outro framework além do Angular."},{"author":"Leonardo Galetti de Mello","comment":"Isso não existe kk Mas existe maneiras de utilizar o Cordova com VueJS. Assim logo em seguida basta pegar um framework mobile de css, no caso poderia usar o Onsen UI é muito bom e fácil de usar e pronto! =D"},{"author":"Joel Piccoli da Rosa","comment":"Sim, eu sei que isso não existe, por isso, quando necessário, eu uso o OnsenUI mesmo com o VueJS. Mas é inegável que o Ionic é mais completo que o Onsen, se fosse possível usar ele com o VueJS eu com certeza usaria..."},{"author":"Kevin Breaker","comment":"Joel, e o Quasar ? Ja viu? se sim, oque acha dele ? Eu me interesso bastante pelo VueJS, e vi sobre o Quasar, mas pela correria nem cheguei a tocar :/."},{"author":"Joel Piccoli da Rosa","comment":"o Quasar eu realmente só dei uma lida na documentação dele, eu gostei, mas ainda não tive a chance de dar uma mexida nele e criar algo pra ver como ele é, seria interessante fazer esse teste..."},{"author":"Luiz Fernando Tomazela","comment":"Ótimo podcast de ótimos podcasts! Parabéns aos melhores no assunto.Cadê vocês no SoundCloud?? hehe"},{"author":"Adriana Marques","comment":"Loiane é super!!! Sou fã de carteirinha. As aulas da Loiane tem me ensinado Angular."},{"author":"Diogo Machado","comment":"Ótimo podcast, acompanho esses 3 a bastante tempo.Em relação a briga do nativo x híbrido eu acho que:1) Você tem que ser bom naquilo que se dispõe a fazer, se você estudar muito desenvolvimento nativo Android, você vai ser bom e entregar um bom produto, com híbrido é a mesma coisa;2) Os clientes que já atendi e estou atendendo nunca me perguntaram se eu ia desenvolver híbrido ou nativo, eles estão mais preocupados com o produto final, se vai atender eles, se terá uma interface agradável e se é rápido, o resto das preocupações são puramente minhas (de deixar rápido, de qual framework usar, etc)3) Mercado mobile em si está bem aquecido, eu tenho visto bastante oportunidade para quem tem conhecimento tanto em nativo para Android/iOS mas também para Cordova/ionic/Angular, e ai voltando, acho que quem é bom, pega o trabalho, entrega um bom produto."},{"author":"Sergio Clemente Da Silva Filho","comment":"O Ponto 2 é muito importante.Exato, o cliente quer algo se qualidade e que atenda suas necessidades.Se é híbrido, nativo etc ele não se importa."},{"author":"ojosejefferson","comment":"isso é apenas briga de desenvolvedor. hahahha"},{"author":"DuShin","comment":"Não ouvi ainda, mas faltou o Neto Marin nesse podcast pras tretas."},{"author":"Paulo Silveira","comment":"O neto marin quando grava podcast é um doce! no twitter ele detona mesmo :)"},{"author":"Sergio Clemente Da Silva Filho","comment":"Só não acho que faz muito sentido nesse flameware que existe entre híbrido e nativo. Geralmente os desenvolvedores nativos se sentem um pouco com o ego ferido, afinal, o desenvolvimento híbrido faz o que é necessário com uma linguagem mais acessível, com menos frescura e o back end fica a gosto do freguês.É possível criar APIs com PHP, Python, Java etc.Utilizo o Intel XDK para desenvolver, minhas APIs sempre em PHP e sem precisar relembrar das aulas de Java da faculdade.Gosto do XDK, pois, ele não te deixa preso a um framework. Então é bem ao gosto do freguês mesmo.OPS ! Inclusive, onde trabalho estamos começando a utilizar a solução do Intel XDK para desenvolvimento híbrido. Já criamos três aplicativos, um inclusive, utilizando API do youtube. É bem interessante."},{"author":"Fanime Fartoon","comment":"Tem como adicionar a opção pra escutar em 1.5x?"},{"author":"Wellington Alfredo Perez","comment":"Digita no console(F12):document.querySelector('audio').playbackRate = 1.5"},{"author":"Fanime Fartoon","comment":"Valeu msm :v"},{"author":"Philipe","comment":"Muito obrigado. Sempre senti falta dessa opção. Mandei logo no 2x"},{"author":"Carlos Carvalho","comment":"eu experimentei aqui, dei ataque de riso. Melhor deixar normal mesmo. A edição do podcast é show."},{"author":"Paulo Silveira","comment":"tá me ouvindo falar que nem pato donald entao :)"},{"author":"Fanime Fartoon","comment":"Paulo Silveira  não seria possível já deixar essa opção nas páginas?Confesso que o Alura me viciou em escutar tudo a 1.5, agora até qdo estou no youtube escutando Legião/Raul eu coloco acelerado hahaha"},{"author":"Lucas Palma Stabile","comment":"Caso o Player de vídeo não suporte essa opção de aceleração, descobri um plugin legal para o Chrome, Video Speed Controller, ele acelera (mais do que o máximo de 2 ou 2.5 x do YouTube) e permite pular ou voltar alguns segundos."},{"author":"Wellington Alfredo Perez","comment":"haha xD"},{"author":"thales alonso","comment":"Ótimo episódio a Loiane manja muito.... Acho que essa guerra de híbrido contra nativo já acabou, agora vêm PWA !!!"},{"author":"Augusto Santos","comment":"Gostei do podcast, só faltou citar apps famosos desenvolvidos com ionic e empresas que vestem a camisa e procuram programadores que trabalham com o Framework.Acompanho a Loiane, faço os cursos disponíveis no seu site e também tenho seu livro sobre algoritmos e estrutura de dados em js e recomendo a todos."},{"author":"Antonio Santiago","comment":"Parabéns pelo excelente podcast."},{"author":"Luiz Fernando Alves","comment":"Muito bom. Façam um sobre react-native, por favor"},{"author":"Marcelo Ogeda","comment":"Primeiramente, gostaria de parabenizá-los pelo excelente podcast. Em seguida, eu gostaria de saber se vocês costumam fazer testes automatizados funcionais? E se sim, quais ferramentas utilizam para o mesmo. Obrigado."},{"author":"Almir Rodrigues","comment":"Ionic já está bem consolidado no mercado e já utilizamos ionic2 em produção para apps complexos!!"},{"author":"Valdir Viana","comment":"Ionic <3"},{"author":"Sebastião Relson Reis da Luz","comment":"<3"},{"author":"Luiz Costa","comment":"Bom dia Hipsters, nessa situação onde Ionic resolve grande parte do trabalho de criar uma app em várias linguages, melhor não aprofundar em uma linguagem (Swift/Android) e sim ter um conhecimento bom nessas linguagens e aprofundar-se nesse conversores de aplicação/JS/React?"}]}