{"title":"Tecnologias na Wine.com.br – Hipsters #63","releaseDate":"26/09/2017","tags":["infra","infraestrutura","Podcast","programação","startup"],"people":["Paulo Silveira","Mauricio Linhares","Paulo Jeveaux"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1067%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D1067&t_u=https%3A%2F%2Fhipsters.tech%2Ftecnologias-na-wine-com-br-hipsters-63%2F&t_e=Tecnologias%20na%20Wine.com.br%20%E2%80%93%20Hipsters%20%2363&t_d=Tecnologias%20na%20Wine.com.br%20-%20Hipsters%20%2363%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Tecnologias%20na%20Wine.com.br%20%E2%80%93%20Hipsters%20%2363&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"educoutinho","comment":"Muito bacana esse episódio, parabéns! Muito bom saber os detalhes de uma operação tão grande."},{"author":"FELIPE FERREIRA","comment":"Tem algum app q tem esse podcast?"},{"author":"Orlando Filho","comment":"Em cima da página tem as instruções....."},{"author":"Maurício Linhares","comment":"Pocketcasts tem, se estiver no iOS a app de Podcasts tem também!"},{"author":"Fabio Moura","comment":"Esses caras devem fazer milagre para lucrar vendendo um produto que tem margem apertada e com essa operação tão complexa. Sou fã de negócios mais enxutos."},{"author":"Paulo Silveira","comment":"é. nao só eles, muitos ecommerces passam dificuldades com as margens pequenas. dizem que produtos de crianca, como fraldas, tambem é um mercado bem complicado. impressionante conseguirem levar a empresa pra esse patamar."},{"author":"Fabio Moura","comment":"Pois é, mas acho que bebida alcoólica é pior devido aos altíssimos impostos cobrados sobre ela. Como disse, esses caras realmente devem fazer milagre ou estão trocando figurinhas..."},{"author":"Yukio","comment":"Muito legal! Sou cliente deles e nem tinha ideia da história por trás. Mais um episódio maneiro, estão de parabéns"},{"author":"Djonathan Krause","comment":"Muito legal o episódio! Trabalho na Otimis, empresa que faz as customizações do WMS HighJump que a Wine utiliza. Poderiam ter falado um pouco mais sobre a operação WMS, tem bastante assunto bem interessante :D"},{"author":"Ednaldo Dilorenzo","comment":"Muito bom episódio, fiquei imaginando a complexidade do código que eles trabalham. Principalmente por que a plataforma existe desde 2008, e de lá pra cá muitas evoluções já aconteceram. Acho que é um ponto muito importante no desenvolvimento de software a decisão de se evoluir as tecnologias utilizadas ou não."},{"author":"Lucas Palma Stabile","comment":"Link para a Wine.com.br está só marcado como Wine.com, acho que esse é outro site, não?"},{"author":"Gabs Ferreira","comment":"Valeu Lucas, corrigido!"},{"author":"Lucas Palma Stabile","comment":"No texto do episódio, \"Neste episódo, o abstêmio host Paulo Silveira e Mauricio Balboa Linhares conversam com Paulo Jeveaux, gerente de tecnologia da Wine.com.br.\", o link ainda manda para wine.com"},{"author":"Gabs Ferreira","comment":"Wordpress chatinho! Corrigido Lucas :)"},{"author":"Douglas Matoso","comment":"Ctrl-C Ctrl-V da descrição do #58?"},{"author":"Thiago Mendes","comment":"Provavelmente fazem o copy-paste para pegar a estrutura do texto. Erros acontecem rsrs"},{"author":"Gabs Ferreira","comment":"É que o Paulo tomou uns vinhão na hora de postar esse episódio gente :P"},{"author":"Carneiro","comment":"Ossos do ofício."},{"author":"Carneiro","comment":"😂😂😂😂😂😂"},{"author":"Sebastião Relson Reis da Luz","comment":"Fui brifado pra fazer uma versão do app pra uma startup indiana, mas acabei declinando por estar trabalhando fulltime :("}]}