{"title":"Carreiras em Tecnologia (sem contar Programador e Designer!) – Hipsters #61","releaseDate":"12/09/2017","tags":["carreira","Podcast"],"people":["Paulo Silveira","Sergio Lopes","Lucas Burza","Jacqueline Asano","Fernanda Sindeaux","Gabriel Ferreira"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1141%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1141&t_u=https%3A%2F%2Fhipsters.tech%2Fcarreiras-em-tecnologia-sem-contar-programador-e-designer-hipsters-61%2F&t_e=Carreiras%20em%20Tecnologia%20(sem%20contar%20Programador%20e%20Designer!)%20%E2%80%93%20Hipsters%20%2361&t_d=Carreiras%20em%20Tecnologia%20(sem%20contar%20Programador%20e%20Designer!)%20-%20Hipsters%20%2361%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Carreiras%20em%20Tecnologia%20(sem%20contar%20Programador%20e%20Designer!)%20%E2%80%93%20Hipsters%20%2361&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Stephanytt","comment":"To cursando SI e meu.... eu amo social media e digital marketing! Desencanei de que preciso ser foda em programação... tem outas áreas, uai. Muito bom o podcast"},{"author":"Renato Web","comment":"Muito bom e esclarecedor.Sou Desenvolvedor e trabalho à cerca de 12 anos. Tenho formação superior em Desenvolvimento Web.Estou vivendo um dilema.Estou um tanto saciado com a parte técnica e depois de algumas pesquisas e conversas pensei em procurar um novo desafio na carreira.Acho interessante a questão de ser um gerente de projetos, trabalhar com metodologias ágeis ou o desenvolvimento do produto.Enfim isso é o que eu penso e ainda se encontra em teoria.Alguém pode me dar alguma luz de uma possível transição gradativa?"},{"author":"Talita sousa","comment":"Show show você são d+.ps  ( A introdução do podcast é muito ruim )"},{"author":"Karina Morais","comment":"Parabéns pelo tema Jacqueline Yumi Asano pessoal aqui na empresa também gostou muito. Espero que venha mais nesse modelo :)"},{"author":"VINICIUS S SOUZA","comment":"Parabéns pelo episódio! Sugestão para um dos próximos: Vagas no exterior. Como se preparar? Como aplicar? Qual o caminho das pedras? E a experiência de quem já trabalha lá fora. Os pontos positivos e negativos. Vida fora do escritório, etc.. :D Valeeu"},{"author":"Tiago Lima","comment":"Aquele momento em que vc percebe que a sua carreira (Suporte/Infra) tá morrendo mesmo... :("},{"author":"Fernando Boaglio","comment":"está longe de morrer... a diferença é que com as ferramentas de monitoração e devops o pessoal da infra administra muito mais máquinas do que antigamente. E a área de infra sempre foi menor mesmo que a área de dev, e com uma responsabilidade / pressão maior para manter o ambiente funcionando."},{"author":"Jorge Makenzzi","comment":"Não está morrendo, mas tá bem pequena em comparação com Dev."},{"author":"Paulo Silveira","comment":"hahaha! nao ta nao. anda vai haver um novo podcast com outras profissoes!"},{"author":"Tiago Lima","comment":"Já coloca na pauta como migrar de outras áreas pra desenvolvimento... essa esta sendo minha grande dificuldade hoje em dia e acho q de uma galera q tá pensando no futuro.Vlw pela resposta :p"},{"author":"Fernando Boaglio","comment":"Dá para fazer mais podcasts como esse, tem a área de infraestrutura que tem diversas subdivisões (rede, sistema operacional, banco de dados), onde o pessoal é focado não em criar sistemas mas em manter o ambiente funcionando, programação ali é quase inexistente. Existem também os especialistas em algumas ferramentas de análise de dados, conversão ou migração de arquivos, também pouca ou quase nenhuma programação, talvez um pouco de SQL. Tem especialistas em ferramentas de relatórios, em processos, auditoria, arquitetura, a lista é enorme."},{"author":"Bruno Borges","comment":"Trabalho com programação e esse podcast foi pouco relevante pra mim mas foi excelente!! Sempre procuro mostrar para amigos e familiares altamente competentes que tem muito espaço para suas skills em tecnologia, agora tudo que eu vou fazer é encaminhar esse link =)"},{"author":"Ednaldo Dilorenzo","comment":"Esse foi difícil de escutar até o fim...."},{"author":"Jacqueline Yumi Asano","comment":"Nossa que pena Ednaldo Dilorenzo  :( Gravamos com tanta paixão..."},{"author":"Ednaldo Dilorenzo","comment":"Paulo Silveira É isso aí que o paulo falou mesmo, não curto muito essa parte."},{"author":"Jacqueline Yumi Asano","comment":"haha Sim! Só fiquei triste porque foi meu primeiro, mas sim é impossível agradar todas as pessoas. Mesma coisa com produto também. :*"},{"author":"Paulo Silveira","comment":"é normal, cada ouvinte tem uma preferencia especifica!"},{"author":"Paulo Silveira","comment":"Esse comentário foi apagado."},{"author":"Paulo Silveira","comment":"Opa! O de programador saiu aqui :)https://jovemnerd.com.br/ne..."},{"author":"Fernando Liell","comment":"Gostei muito deste episódio, deu pra perceber a transformação que esta acontecendo no mercado digital.  Pelo que deu a entender Gerente de Produto vai ser a nova modinha? hahah Valeu pelo ótimo conteúdo!"},{"author":"Jacqueline Yumi Asano","comment":"haha Fernando Liell onde houver Produto há grandes chances de ter um Gerente de Produto por trás. Apesar de ser novo aplicarmos em tecnologia o termo foi criado lá em 1931 para designar um Gerente de Produto (não digital). Aqui tem um link bem massa sobre a história dessa carreira :) https://www.mindtheproduct...."},{"author":"Talita sousa","comment":"Parabéns. Vocês são referencia de qualidade. Opinião geral  (Vocês merecem uma abertura de podcast mais bonita a atual é muito mais muito ruim) bom é apenas uma opinião"},{"author":"Lucas","comment":"Já faz um tempo que acompanho o podcast, mesmo não sendo algumas vezes um assunto que me desperta interesse, vocês tem um dialogo muito bom! parabéns :)Minhas sugestões para próximos episódios: IoT, tecnologias do futuro, mulheres na programação, tecnologias que não deram certo, o futuro do front end, biotecnologias."},{"author":"Jacqueline Yumi Asano","comment":"*_* Mulheres na Programação +1"},{"author":"Gabs Ferreira","comment":"Esse comentário foi apagado."},{"author":"Gabs Ferreira","comment":"Ué, por que? Hahah 🙃"},{"author":"Gabs Ferreira","comment":"Esse comentário foi apagado."},{"author":"Gabs Ferreira","comment":"Pô, valeu Walter ❤️"},{"author":"Olavo de Carvalho","comment":"Muito bom o podcast. Vou agregar mais alguns cargos que vejo que aumentaram as vagas:Analista CRM: Esse cargo aumentou em muito a procura de profissionais, até porque com essa crise muitas empresas nem sabiam quem era seus clientes chaves.Analista de negócios: esse eu acho essencial , normalmente alguém da empresa acumula esse cargo. Vejo grande diferença quando ele está fazendo a ponte com comercial e o TI.Analista de BI (complementa cientista de dados): Esse aqui deu um boom com a profissão cientista de dados, até porque depois de manipular você têm que mostrar de uma maneira que não seja tão dificil de entender.E eu vi tbm uma demanda grande de psicologo pra UX e até na criação de chatbot.vendedor tbm"},{"author":"Thiago Reis","comment":"Episódio sensacional! Abriu meus horizontes quanto à minha carreira, e quanto às oportunidades que podem surgir no mundo da Tecnologia. Tem tantas áreas em que a gente pode atuar além de Desenvolvimento e/ou Design... coisas que nunca tinha parado pra pensar.Obrigado pelo excelente trabalho que vocês têm realizado. Estou recomendando esse episódio e o podcast como um todo para meus conhecidos da área.Hipsters ponto Abraços!"},{"author":"Jacqueline Yumi Asano","comment":"Caramba que coisa linda de ler <3 Tem muita oportunidade em tecnologia e para as mais diferentes skills. Obrigada pelo feedback Thiago :)"},{"author":"Paulo Silveira","comment":"valeu thiago! era esse o proposito do episodio"}]}