{"title":"Pull Requests e Code Review – Hipsters #64","releaseDate":"03/10/2017","tags":["agilidade","devops","infraestrutura","Podcast"],"people":["Paulo Silveira","Lucas Mazza","George Guimarães","Sergio Lopes"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1245%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1245&t_u=https%3A%2F%2Fhipsters.tech%2Fpull-requests-e-code-review-hipsters-64%2F&t_e=Pull%20Requests%20e%20Code%20Review%20%E2%80%93%20Hipsters%20%2364&t_d=Pull%20Requests%20e%20Code%20Review%20-%20Hipsters%20%2364%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Pull%20Requests%20e%20Code%20Review%20%E2%80%93%20Hipsters%20%2364&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Eduardo Augusto","comment":"Gostaria de dizer que ep de podcast como esses me fazem cada vez mais ter a vontade de ser professor de programação! Valeu gente, vocês são demais"},{"author":"Rodrigo Gattermann","comment":"Gostei muito da idéia de utilizar gif's animados para descrever funcionalidades de cada PR. Em pesquisas que fiz, não encontrei nenhum extesão chrome/firefox que me agradasse, então encontrei o Peek. Interface simples e que já faz o save em .gif (https://github.com/peek/peek)."},{"author":"Ednaldo Dilorenzo","comment":"Eu acho revisão de código uma excelente prática, principalmente quando programadores mais experientes revisam código de programadores menos experientes. Porém, cuidado deve ser sempre tomado pra que o time não seja sobrecarregado, principalmente os programadores mais experientes. Já trabalhei em uma empresa onde o programador mais experiente só inspecionava código."},{"author":"André Rezende","comment":"Onde eu encontro o guideline comentado no Podcast para realizar comentários em \"merge request\"?"},{"author":"Marcelo Bohn","comment":"Ontem fiz code review do código dos meus alunos, estou usando Github com os alunos do curso técnico e passei a fazer comentários para revisar e devolver aos alunos, ainda não usamos Branchs e PRs, mas fica a dica para usar em aula."},{"author":"Vinicius Amorim de Lima","comment":"Aleluia um professor sensato! Falta se aprofundar mais no versionamento de codigo, mas já é um progresso e tanto!"},{"author":"Marcelo Bohn","comment":"Sim, objetivo é mudar as coisas. Git e testes unitários tudo no Github."},{"author":"Marco Blos","comment":"Ebert para Gitlab. Queremos. :)"},{"author":"George Guimarães","comment":"Estamos pensando nisso! =D"},{"author":"Guilherme","comment":"Hipsters no Spotify please!"},{"author":"Gabriel Darezzo","comment":"Por favor....Utilizem .editorconfighttp://editorconfig.org/E se possível o Lint da sua linguagem."},{"author":"Junior Farias","comment":"Nós desenvolvedores da beeTech fizemos recentemente um Guia de Pull Request Campeão, deem uma conferida lá.https://github.com/BeeTech-...\n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n"},{"author":"André Luís","comment":"Ficou muito bacana!"},{"author":"Romário Lima","comment":"Feito com todo amor, carinho, ousadia e alegria <3"},{"author":"Marcelo Melo","comment":"Parece que o guia tá campeão mesmo hein! Vou ler com calma daqui a pouco!!Obrigado pela dica!!"},{"author":"Lucas Palma Stabile","comment":"Olha só, esse tema veio bem quando estou vendo o curso de Git hehe. Essa prática de pull requests parece bem interessante de se adotar mesmo, ainda mais pelo valor de dividir o conhecimento pela equipe. Por onde já trabalhei, só revisamos os códigos na hora da manutenção mesmo e aí é tarde demais. Recentemente acabei vendo um if ternário para incluir um \"0\" à esquerda apenas se a string possuía um único caractere. Ficaria muito mais fácil utilizar a função PadLeft que inclui o caractere que você deseja à esquerda até ficar do tamanho estipulado, uma revisão de pull request teria ajudado a identificar nesse caso."},{"author":"Filipe Rehder","comment":"Oi nao achei o link do Guidelines do CodeReview..."},{"author":"George Guimarães","comment":"Oi Filipe, fica aqui: http://guidelines.plataform..."},{"author":"Filipe Rehder","comment":"Obrigado!"},{"author":"Vandemberg Silva Lima","comment":"Que susto eu levei no minuto 11:20, ouvindo a voz do cara de boa do nada o barulho do robo! ADHUHSD! Nao sei pq me assustei, mas dei um mini pulo da cadeira."}]}