{"title":"Crianças, jovens e programação – Hipsters #65","releaseDate":"10/10/2017","tags":["Podcast","programação"],"people":["Paulo Silveira","Code Club Brasil","Felipe Fernandes","Guilherme Silveira","Átila Iamarino"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1262%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1262&t_u=https%3A%2F%2Fhipsters.tech%2Fcriancas-jovens-e-programacao-hipsters-65%2F&t_e=Crian%C3%A7as%2C%20jovens%20e%20programa%C3%A7%C3%A3o%20%E2%80%93%20Hipsters%20%2365&t_d=Crian%C3%A7as%2C%20jovens%20e%20programa%C3%A7%C3%A3o%20-%20Hipsters%20%2365%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Crian%C3%A7as%2C%20jovens%20e%20programa%C3%A7%C3%A3o%20%E2%80%93%20Hipsters%20%2365&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Davis Peixoto","comment":"Que episódio legal !!!Concordo com o @Paulo Silveira:disqus de que geralmente esquecemos o quanto precisamos aprender lá atrás e tratamos várias coisas como simples, fáceis, básicas demais e totalmente corriqueiras.Parabéns pelo conteúdo!"},{"author":"Artur Cesar De Melo","comment":"Perfeito esse POD. Estou recentemente discutindo com um amigo meu a respeito do quanto nós programadores hoje sofremos quando trabalhamos em _software house_ lidando com clientes, em plena era da informação, que não sabe o que quer. Eu entendo que, como analistas, temos que saber e usar bem a linguagem ubíqua, mas ainda lidamos com clientes que querem um sistema que automatize o trabalho deles, mas que não sabem o que querem, como querem e se isso realmente é válido. Paralelo a isso, temos uma geração nova entrando no mercado ignorando o momento tecnológico em que vivemos hoje.Parabéns, Hipstertech!"},{"author":"Fernando Boaglio","comment":"Muito bom episódio. O CP400 , TK90 e MSX  (todos de 8bits) marcaram gerações e criaram profissionais de TI como eu. Foi uma época que o BASIC era de certa forma bem popular, além de revistas vendidas nas bancas alguns jornais colocavam trechos de código para explicar alguma coisa. Aqui uma dica de um Podcast que fala bem dessa época, nesse episódio sobre o CP400 http://www.retrocomputaria...."},{"author":"Jaime Neto","comment":"Paulo, cuidado com a expressão “vai de encontro à minha opinião”, ela significa justamente o contrário do que você quis dizer, ou seja, significa “é contrária à minha opinião”. O correto seria “vai ao encontro da minha opinião”, aí sim quer dizer que “concorda com minha opinião”. #fkdk"},{"author":"William Faria","comment":"Ótimo podcast! Trabalho com programação a algum tempo e tenho uma filha de 6 anos.Faz tempo que venho pensando em como abordar a programação no contexto infantil, e ouvindo este podcast me ajudou bastante.Vou utilizar minha filha como minha aluna piloto, pois tenho em mente em fazer isso para crianças de escolas publicas e tendo acesso ao seu primeiro computador com um raspberrypi.Parabéns pelo podcast!"},{"author":"jallisson jallis oliveira band","comment":"ótimo podcast, a criançada é o futuro da nação."},{"author":"Luiz Felipe F M Costa","comment":"Indo mais pra dev, ao invés de somente lógica de programação, eu geralmente utilizo ambientes prontos pra ensinar as pessoas, já que configurar um stack demanda muito tempo e paciência. Atualmente a melhor opção que eu encontrei é o site https://repl.it/ onde vc pode aprender qualquer linguagem direto no navegador. Além disso, eles tbm possuem uma área pra criar ambientes de ensino. Qualquer um pode criar aulas dentro da plataforma, informando o output esperado para cada estágio."},{"author":"Felipe Resende","comment":"Muito da hora os questionamentos sobre ensino. Me identifiquei muito com o episódio pq ja dei aula para crianças em um projeto chamado Róbotica Formando Cidadãos e no final, depois de várias matérias, os alunos tinham que programar com um arduino e fazer um robô seguidor de linha. Foi um experiência sensacional. Essa é página do projeto : https://www.facebook.com/ro... e eles foi conduzido pelo laboratório LABIRAS dentro do IFPI. Meu primeiro contato com código foi com o RPG Maker por volta dos meus 12 ou 13 anos, onde é possivel pseudo programar seu jogo atravres de funções em bloco, tudo era visual. Mas depois de um tempo mexendo, achei que era muito limitado e vi que dava de mexer no código fonte do sistema. Ai vi que havia uma comunidade inteira mexendo nisso. Eu não sabia programar, mas sabia alterar os parametros das coisas que eu queria. Anos depois fiz um curso de web design, basicamente html e css e vi pessoas programando em java e disse que jamais mexeria naquilo. Mas em um curso de eletrônica vi programação em C e como eu adorei sistemas microprocessados, resolvi me aprofundar nisso. Hoje eu curso Análise e Desenvolvimento de Sistemas no IFPI e sei desenvolver tanto jogos como como sistemas web."},{"author":"Paulo Silveira","comment":"historia bacana Felipe! parabens pelo projeto."},{"author":"Vinícius Ingracio","comment":"Olá pessoal, como sempre um baita tema! Concordo que não deveria ser obrigatório, e acredito que vocês, profissionais renomados e com grande experiência no assunto poderiam criar projetos gratuitos, para as escolas públicas, levando até as crianças esse tema. Um grande abraço!"},{"author":"Welton Vaz de Souza","comment":"Excelente episódio, ensinei um pouco de scratch para o meu filho, mas ano que vem quando ele tiver mais maduro com relação a matemática, vou começar Python!"},{"author":"Vagner Freitas","comment":"Galera, esse episódio foi muito legal. Eu aprendi a programar sozinho num TK85 lendo o manual do Basic. O TK85 nem era meu, era de um colega de escola que tinha grana mas não era bom aluno. Como eu era bom aluno ele me chamava para ir na casa dele para \"mexermos\" juntos no micrinho.Coincidentemente, faz poucos meses que comecei a ensinar meu filho de 10 anos a programar. Ainda estamos na fase do Scratch, mas como ele leva jeito para a coisa e está muito entusiasmado, na próxima etapa vamos para o Python.Estou seguindo um plano de aulas disponibilizado pela Programae ( http://programae.github.io/... ) que é uma iniciativa da Fundação Lemman.Abraços."},{"author":"Paulo Silveira","comment":"eu comecei com logo mas fui rapidamente pro basic, tambem com o manual. era um CP400."},{"author":"Marcelo Ribeiro","comment":"Excelente episódio.Concordo que não seria tão vantajoso ter programação como uma matéria obrigatória, mas acho que os alunos deveriam ter algum contato com programação desde cedo (nem que seja apenas a parte da lógica), porque isso vai fazer eles aprenderem a raciocinar. Creio que programação poderia ser adicionada como uma das matérias opcionais no ensino médio.Aprendi a programar na faculdade e foi justamente com o Visualg, inclusive meu professor foi o criador do Visualg, Cláudio Morgado.Também acho que os professores deveriam utilizar mais a tecnologia para ensinar."},{"author":"Alex Ferreira","comment":"Ótimo programa. A professora Emilia que dá aula na Etec, que foi citada, é uma que dá (ou deu aula algum tempo atrás) na Etec da Zona Leste? Se sim, eu também tive aula com ela. :)"},{"author":"Paulo Silveira","comment":"é ela! :)"},{"author":"Alex Ferreira","comment":"haha, que legal. Mundo pequeno, é a 2° conexão que vejo através do podcast, a primeira foi o Prof. Flávio Coutinho que me deu aula na USP."},{"author":"Rodrigo Cichetto","comment":"Excelente podcast. Na minha cidade Araraquara/SP, tem um projeto chamado Biz Games (http://www.bizgames.com.br/) que leva a lógica de programação por meio de jogos educacionais para crianças de escolas do ensino fundamental e médio, em parceria com a prefeitura. Acho a lógica um quesito muito importante a ser ensinado, pois para nós programadores nos ajuda muito em todas as tarefas que desempenhamos."},{"author":"Joice Pavek Figueiró","comment":"Adorei o podcast. Sou programadora, mãe de 3 de 7 a 12 anos, e estou começando a ensinar programação pra eles. Vou usar as dicas de vocês.E parabéns pelo site da Alura Start. Ótima iniciativa."},{"author":"Luciana Bezerra","comment":"Este é o jogo sobre Plano Cartesiano em Scratch mencionado no Podcast: https://scratch.mit.edu/pro....No meu canal no site do Scratch, vocês encontram mais 2 programas interessantes: \"Entendendo ângulos e direções\" e \"Estudando Números em Inglês\".Divirtam-se!!!"},{"author":"Joice Pavek Figueiró","comment":"Legal, Luciana. Vou mostrar pros meus filhos."},{"author":"Anderson Joyle","comment":"Meu filho de 5 anos esta dando os primeiros passos em Cobol. De 0 a 10, que tipo de pai eu sou? Justifique."},{"author":"Fernando Boaglio","comment":"É como aprender a dirigir em um Fusca... depois dele , você dirige qualquer carro =)"},{"author":"Welton Vaz de Souza","comment":"Malvado"},{"author":"Vagner Freitas","comment":"Huahua, meu filho tem 10 e estou ensinando C/C++. Brincadeira, estou iniciando pelo Scratch e depois vou para o Python."},{"author":"Joice Pavek Figueiró","comment":"Cobol? Tu quer afastar o guri da programação?   :-) brincadeira...Eu tb sou do tempo do cobol....."},{"author":"Fabrício Cabral","comment":"Prezados,o link no post do Code.org está errado.No mais, parabéns pelo excelente podcast."},{"author":"Cleber Teixeira","comment":"👏👏👏"}]}