{"title":"React: o framework onipresente – Hipsters #66","releaseDate":"17/10/2017","tags":["front-end","Podcast","programação"],"people":["Paulo Silveira","Christiano Milfont","Alberto Souza","Maurício Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1281%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1281&t_u=https%3A%2F%2Fhipsters.tech%2Freact-o-framework-onipresente-hipsters-66%2F&t_e=React%3A%20o%20framework%20onipresente%20%E2%80%93%20Hipsters%20%2366&t_d=React%3A%20o%20framework%20onipresente%20-%20Hipsters%20%2366%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=React%3A%20o%20framework%20onipresente%20%E2%80%93%20Hipsters%20%2366&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Thiago Cunha","comment":"Ué? Tem um tema específico para React, e não tem para Angular? :("},{"author":"Jorge Ramos","comment":"no título e descrição está como framework, mas react não seria uma lib?"},{"author":"Raul Theotonio","comment":"HAHAHAHA. nem de perto. Com certeza é um framework."},{"author":"Jorge Ramos","comment":"qual a graça???dá uma olhada no site amigão. verá isso aqui: \n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n\n"},{"author":"Adriel Oliveira","comment":"acho que seria um ótimo momento para alguém explicar a diferença de lib pra frame."},{"author":"Renato Souza","comment":"Muito bom mesmo! Só faltou falar sobre as actions, porque um ponto para entender melhor o React são elas que disparam para chamar os reducers. É assim que a mágica acontece no disparo de qual reducer chamar e qual deles irá alterar o estado da maneira desejada. Abraço!"},{"author":"Raylan Soares","comment":"Muito bom mesmo! E assim como alguns comentaram aqui, também gostaria muito de um podcast falando do Vue!"},{"author":"Daniel Amaral","comment":"Ótimo podcast!Me parece que o react resolve uma parte do problema que é resolvido pelo angular (organização mvc, integração simplificada com backend, atualização bidirecional entre modelo e view).Estou enganado?"},{"author":"Andre Nunes","comment":"Fantastico,"},{"author":"Maico Moreira da Silva","comment":"Ainda não parei pra estudar React, então o podcast cumpriu o objetivo pra mim. Agora fiquei com uma dúvida cruel: falado que o react permite uma componetização que antes só era possível em aplicações desktop; como ser fosse uma toobox; e que isso ainda não tinha sido conseguido por framework nenhum.  Pergunta- se: e o dotNet Aspx, não é isso que o react faz? Só pra consolidar meu aprendizado e  comparar com alguma coisa  que já usei. Uma das diferenças seria que react funciona sobre o   nodejs(independente de sistema operacional)  e Aspx no Microsoft win.somente?"},{"author":"cmilfont","comment":"Maico, Aspx assim como JSF e tecnologias com outras engines de template são renderizadas no servidor (existem até no lado cliente) transformando um pseudo-html com marcações no local que injetarão resultado de código.React em vez disso usa um mecanismo mais inteligente, transforma a notação XML do HTML em cidadão de primeira classe na linguagem, ou seja, existe um plugin que se utiliza no node (pesquisa sobre babel.js) que transforma o HTML em javascript."},{"author":"Mateus Queiroz Correia","comment":"Tem um erro de digitação. De    : \"Alura Live sobre Ract com o Milfont\"Para : \"Alura Live sobre React com o Milfont\""},{"author":"Ednilson Campos","comment":"Pesquise por hipsters tech react no google,logo em seguida tente abrir o primeiro linkesse: https://hipsters.tech/tag/r..."},{"author":"Felipe Müller","comment":"Com todo o respeito. O pior podcast até o momento. A pessoa falar que demora uma semana pra fazer um crud na web, enquanto em delphi é rápido? Faça-me o favor. Ridículo. Misturar php com o html? Faz pelo menos 15 anos que essa prática não é mais utilizada. Infelizmente o conteúdo deste podcast foi realizado por pessoas que tem sua essência na programação desktop, e não na web. O conceito de desenvolvimento web é outro. As coisas começam a ficar ruim quando este tipo de pessoa tenta trazer o modo de trabalho desktop para web. Isto não funciona. Um dos motivos do porquê os desenvolvedores web acham Java para web tão ruim. Interferência direta ou construção do html pela linguagem de programação é o pior erro que se comete para web."},{"author":"cmilfont","comment":"Felipe, eu mencionei um argumento que é válido para quem está construindo um produto, não importa o que eu ou você ache se está errado ou certo.Como diz o capitalista Deng Xiaoping: \"não importa se o gato é branco ou preto desde que caça o rato\".Ou você discorda que criar um produto, principalmente CRUD no desktop com tecnologias como Delphi não é extremamente rápido?Temos clientes que precisam migrar um sistema Desktop pra Cloud e esbarram justamente nesse problema, não tem maturidade suficiente pra ter uma mentalidade Web e precisam de ajuda.\"Misturar php com o html? Faz pelo menos 15 anos que essa prática não é mais utilizada.\" Baseado em quê você diz isso? No seu dia a dia?Desculpe-me mas não é a realidade do mercado, temos dezenas de clientes diariamente solicitando nosso trabalho pra evoluir uma plataforma justamente dessa forma.\"Interferência direta ou construção do html pela linguagem de programação é o pior erro que se comete para web\" -> sabe o que é pior de tudo? Já pensei igual a você e quando React surgiu eu me vi dizendo: \"Isso não vai dar certo, já nasceu errado, é a maior idiotice que já fizeram\"O convido a dar uma chance como fiz, uma manhã é o suficiente, se você mudar de opinião eu gostaria de saber."},{"author":"caio","comment":"\"Misturar php com o html? Faz pelo menos 15 anos que essa prática não é mais utilizada.\" Baseado em quê você diz isso? No seu dia a dia?Felipe, fazem 15 anos que já existem formas de não fazer essa mistura porém você como desenvolvedor tem que escolher o que é melhor em termos de performance e tempo até para atender o tipo de produto ou serviço que está buscando. Para qualquer desenvolvedor, isso não é obrigatório, só é uma boa prática."},{"author":"Lucas Macedo","comment":"Quero ver o de VUE !!"},{"author":"Carlos Clelio","comment":"Quero ver o de VUE !! ²"},{"author":"Filipe Rodrigues","comment":"também gostaria de um podcast de vue.js  para usar de argumentos aqui na empresa que trabalho =D"},{"author":"Vinicius Souza","comment":"Um de Vue seria excelente, ainda mais com o gás que teve nesse ultimo ano"},{"author":"Adriano Marques","comment":"Excelente episódio!Os cursos de React do Alberto Souza são sensacionais!Paulo, sugestão de podcast: \"Tecnologias no Trello\""},{"author":"Diego Franca","comment":"VueJs seria interessante um podcast"},{"author":"Giorgio","comment":"Paulo e um episodio sobre Golang"},{"author":"digenaldo","comment":"Podcast sobre Domain Driven Design"},{"author":"João Vítor Dias","comment":"VueJS é só amor. Deveria ter um podcast só sobre ele também :D"},{"author":"Johan Guse","comment":"Explica pq o Vue é mais facil que iniciar que o React?! Ou faz um sobre Vue tb....Obrigado"},{"author":"Wesley Egberto","comment":"BoaFaltou só compartilhar o link que o Linhares comentou da comparação do React e do Win32"},{"author":"Bruno Leonardo Gonçalves","comment":"Acredito que o Linhares se referiu a este artigo:https://bitquabit.com/post/...Ainda tem esta thread no HackerNews falando da treta toda:https://news.ycombinator.co...E para piorar ainda tem o projeto ReactOS, que nada tem a ver com o Facebook React, que pretende fornecer um sistema operacional compatível com o Windows a nível binário:https://reactos.orgOMFG!"},{"author":"Wesley Egberto","comment":"Boaaa!Muito bom esse post!Valeu!"},{"author":"Lincoln Martins","comment":"Faz um episódio sobre Python e Django, Paulo. Tá faltando falar sobre isso"},{"author":"Paulo Silveira","comment":"estamos devendo. mas virá :)."},{"author":"Black Power Dog","comment":"Mais uma vez o mito DELPHI sendo mencionado no Hipsters. Haters gonna hate, mas o desenvolvimento de software nunca mais foi tão fácil e rápido como era nessa fabulosa ferramenta :D"},{"author":"Frederico Cruz","comment":"O Delphi da embarcadeiro hoje é multiplataforma... compila um mesmo projeto para IOS e Android."},{"author":"Black Power Dog","comment":"Funciona mesmo ? Porque sempre que tentaram fazer isso abandonaram depois (Kylix, Delphi .NET). Delphi é bom em Win32."},{"author":"Marcelo Bohn","comment":"A realidade por mais impressionante que possa ser é que para alguns clientes um exe 32 bits compilado no Delphi ainda é a melhor solução. Assim como optar por React para uma solução web pode não ser sempre a melhor escolha, uma solução web ainda não é a necessidade real de muitos clientes. Então projetos Delphi sobrevivem aos tempos."},{"author":"Rafael Veronezi","comment":"“xamarin NÃO compila”.... hein?Tá louco Mauricio Linhares? Se você se propõe a ser o “treteiro” pelo menos fale com conhecimento..."},{"author":"Maurício Linhares","comment":"Xamarin não compila pra JavaScript, ele executa diretamente no runtime do Objective-C assim como uma aplicação nativa do ambiente."},{"author":"Albérico Dias Barreto Filho","comment":"dando carteirada xD, é muita informação pra guardar neh cara"},{"author":"Rafael Veronezi","comment":"Exatamente, xamarin não tem nada a ver com JavaScript, mas não foi disso que você falou no programa, dizendo até com um certo desdenho. O Xamarin é sim compilado pra código nativo via AOT no iOS e já traz esse recurso de forma experimental no Android, que compila o IL do .NET antecipadamente, gerando binários nativos. Sugiro estudar um pouco mais a arquitetura da plataforma."},{"author":"Arthur Jardim","comment":"\"Aqui tem virgula\" 0:37:17"},{"author":"Paulo Silveira","comment":"ja nao tem mais :). acontece nas melhores familias."},{"author":"Anderson Zanichelli","comment":"Por volta dos 8 minutos...O que? HTML no meio do código?Aquilo não é HTML, é um syntactic sugar para JSX!"},{"author":"Tiago Wippel","comment":"Excelente episódio, parabéns. React realmente é confuso de início, e explicar em 45 minutos apenas por áudio é uma tarefa quase impossível."},{"author":"Bruno Almeida","comment":"Achei que a missão de tentar explicar o que é React falhou. O cast ficou confuso."},{"author":"Welton Vaz de Souza","comment":"Eu odeio java, mas deu para entender tudo! Apesar de algumas caneladas"},{"author":"Paulo Silveira","comment":"acho que deveriamos ter focado no mais basico no inicio mesmo"},{"author":"Danilo Vieira","comment":"Outro ponto polêmico do React é sua licença. O Facebook criou uma licença no formato  BSD+Patents, onde está especificado que caso você processe o Facebook por infringir qualquer patente sua, imediatamente você perde o direito de concessão do uso do React. O que significa que você pode ser processado pelo uso do React."},{"author":"Ednilson Campos","comment":"Foi feito um \"rollback\" segue o linkhttps://medium.freecodecamp..."},{"author":"Douglas Junior","comment":"É puro drama. \n\n\nReproduzir\n\n\n Ocultar\n\n\n\n\n"},{"author":"Tiago Wippel","comment":"Danilo, isso já foi modificado. Na nova versão 16 do React, ele foi re-licenciado para MIT.veja https://github.com/facebook..."},{"author":"Alessandro Herculano","comment":"Senti falta do cara das treta"},{"author":"Romulo Assis","comment":"Ótimo episódio. Apesar de verboso e complicado de aprender, acho o React um ótimo framework.Como sugestão, vocês poderiam falar sobre VueJs. Sua simplicidade e pequena curva de aprendizado, na minha opinião o fazem superior até que o React."},{"author":"Bruno Gonçalves","comment":"Muito bom o episódio! Confesso que inicialmente achei bem confuso, apesar de entender minimamente de React, quase recomecei/desisti... enfim, talvez também seja por causa do horário, minha atenção não é das melhores após a uma e pouco da madruga hahaha! De qualquer forma, obrigado e parabéns pelo excelente formato de podcast!"},{"author":"Maurício Linhares","comment":"React é um negócio bem enrolado mesmo de explicar sem código :D"}]}