{"title":"A linguagem Go – Hipsters #67","releaseDate":"24/10/2017","tags":["Podcast","programação"],"people":["Paulo Silveira","Caio Filipini","Fabio Kung","Carlisia Pinto"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1298%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1298&t_u=https%3A%2F%2Fhipsters.tech%2Flinguagem-go-hipsters-67%2F&t_e=A%20linguagem%20Go%20%E2%80%93%20Hipsters%20%2367&t_d=A%20linguagem%20Go%20-%20Hipsters%20%2367%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=A%20linguagem%20Go%20%E2%80%93%20Hipsters%20%2367&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Junior Farias","comment":"Para ajudar quem está começando aí https://medium.com/@jrfaria..."},{"author":"Nuno","comment":"Pessoal, mais um podcast muito bacana!!!Para quem está iniciando no mundo da programação vale a pena iniciar com GO?E para quem deseja escutar alguns outros podcast que falaram sobre o assunto:http://castalio.info/episod...http://castalio.info/episod...http://www.grokpodcast.com/..."},{"author":"Geilton Xavier","comment":"Para quem tem interesse na linguagem Go, criei uma lista contendo cursos, livros, blogs, palestras, etc.https://github.com/geiltonx..."},{"author":"Lucas Borges","comment":"Quer saber mesmo, vou fazer os meus projetos em Go. Apaixonei mesmo. kkkk"},{"author":"Fabricio Soares","comment":"Podiam falar da linguagem Rust."},{"author":"Ednilson Campos","comment":"Os números não mentemhttps://imasters.com.br/lin..."},{"author":"Edward Martins","comment":"Quem quiser fazer web com Go, fica a dica, utilize o framework mercurius, github.com/novatrixtech/mer..., easy peasy..."},{"author":"Nyo","comment":"opa..gostei bastante tbm,venho do Rails e tava justamente procurando coisas novas e legais pra aprender."},{"author":"Sebastião Relson Reis da Luz","comment":"Avelino tem uns cases bacana no Samba com go"},{"author":"Giorgio","comment":"Boas. GO uma linguagem é simples é completa. voce pode fazer sites sistemas comerciais e ocupar servidores com pouca memoria. A produtividade excelente.Para trabalhar com layouts e jquery, rotas tem a framework https://beego.me/docs/quick... por exemploCOm banco de dados mysql e postgresql, mysql tem https://github.com/jinzhu/gorm.Tem drivers para trabalhar com Oracle. REDIS e MONGODB tem drivers fantasticos e rapidos.RABBITMQ para filas.Atualmente estou desenvolvendo projetos com GO(APIS - BACK)  e FRONT Angular. Fica sensacional.Tem libs para tudo , como oauth2, e nativo para se trabalhar com JSON e XML.E as libs nativas do GO vem com muitos recursos, quase não se usa frameworks com ela.Tem essa palestra onde na globo.com eles tiraram Java e colocaram GO:https://www.infoq.com/br/pr...GO é simples e fantastico. Vale muito a pena conhecer."},{"author":"Paulo Silveira","comment":"o louco Giorgio! post completissimo. e voce ainda tem o mesmo nome que o giorgio moroder!"},{"author":"Giorgio","comment":"Valeu Paulo. Muitos bom os Podcasts.E gosto muito dos cursos da Alura. Começei aprender Angular2 com os cursos do Flavio.[]s"},{"author":"richellyitalo","comment":"Carai mano, cê manja. Valeu!"},{"author":"Eduardo Paixão","comment":"Há 4 anos atrás ouvi falar do Go no Grok Podcast e só agora fui entender melhor hahah' Dei um tapa no Tour do site e achei a linguagem muito fácil.Fiquei imaginando se é possível criar umas paradas nativas no Ubuntu.. Vlw!Flw!"},{"author":"Carlisia Pinto","comment":"Que bom ver os comentários positivos, pra mim foi um prazer fazer essa gravação! Uma pena que não mencionei um package que minimiza a questão de descobrir errors, o https://github.com/pkg/errors, dado que ele embrulha um erro junto com o outro e vai propagando acima do stack."},{"author":"Elton Minetto","comment":"Eu gosto bastante de usar o Sentry para coletar dados de erros, principalmente em produção. E tem suporte a Go: https://sentry.io/for/go/"},{"author":"Wellyandrey Costa","comment":"Eu sou maratonista de Podcast, e não pode faltar hipsters.tech! Esse episódio está incrível."},{"author":"Elton Minetto","comment":"Meus dois centavos:Em Novembro vai rolar a segunda GopherconBR: https://2017.gopherconbr.org/E para quem quer ficar a par das novidades eu indico a newsletter http://asemanago.com.br (cara de pau minha, pq eu sou o organizador hehe)"},{"author":"Cezinha","comment":"+1 na newsletter  http://asemanago.com.br"},{"author":"DuShin","comment":"Faltou o maior evangelista de Go no Brasil neste podcast, Jefferson Prestes."},{"author":"Felipe Oliveira","comment":"Go é minha linguagem preferida trabalho em uma empresa onde 90% da base de código é Go o resto é python... e usamos Go pra fazer o  login. Tem bastante coisa open source em github.com/nuveo e github.com/prest  pra quem estiver curioso"},{"author":"Lauren Ferreira","comment":"Eu estava esperando esse podcast há MESES! Essa é de longe minha linguagem favorita. É extremamente simples e divertida.Sensacional! Parabéns pelo podcast!"},{"author":"Cleiton","comment":"Eu estava querendo mesmo saber um pouco mais de Go e como é que funciona essa linguagemMeus parabéns galera Alura. Só gente de peso !"},{"author":"Fábio Pontes","comment":"Podcast muito bom!A palavra software está sofwtare na descrição do Podcast"},{"author":"Yuri Morales","comment":"Sensacional o episódio, uma verdadeira aula de cada participante.Acredito que o nome de um dos co-criadores da linguagem que a Carlisia mencionou no início do episódio é também o Ken Thompson.Graças ao episódio, fiquei ainda mais instigado em aprender mais sobre Golang.Parabéns pelo excelente trabalho do podcast.Abraços"},{"author":"Daniel Filho","comment":"esse tal de go parece tao facil, que da vontade de sair fazendo TODO LIST app já pra todo canto :Pbaita episódio :)"},{"author":"Eduardo Henrique","comment":"Aee finalmente saiu"},{"author":"Bruno Douglas","comment":"Parabéns pelo belo trabalho, disseminando conhecimento a todos.Ótimo podcast  !!Muito bom parabéns."},{"author":"Fábio Teixeira","comment":"Não conhecia essa linguagem. Vou procurar saber mais. Em tempo, o link para a Digital Ocean, na descrição do postCast, está errado. Imagino que não tenha o \".br\". Parabéns mais uma vez à equipe da Hipsters!"},{"author":"Rodrigo Corsi","comment":"Pra mim Go é uma das linguagens de melhor custo benefício. Baixo custo no aprendizado, desenvolvimento com benefício da performance. Parabéns pelo podcast."},{"author":"gusnd","comment":"Depois que me recomendaram o podcast de vocês, eu praticamente devorei desde o primeiro, e apesar de estar entrando no mundo da programação, chegou um ponto que conseguia participar das conversas de programadores graças aos episódios, muito educativo! Em breve pretendo fazer curso na Caelum!"},{"author":"Paulo Silveira","comment":"muito legal ler esse depoimento :)"},{"author":"iraecio","comment":"Ótimo podcast, bom saber que outras linguagens estão ai pra resolver problemas que outras linguagens não estão tentando resolver ou  a comunidade não deixa. Muito bom. Parabéns."}]}