{"title":"O que faz um CTO? – Hipsters #68","releaseDate":"31/10/2017","tags":["carreira","Podcast","programação"],"people":["Paulo Silveira","Lucas Souza","David Robert","Wagner Narde","Marcelo Toledo","Maurício Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1326%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1326&t_u=https%3A%2F%2Fhipsters.tech%2Fo-que-faz-um-cto-hipsters-68%2F&t_e=O%20que%20faz%20um%20CTO%3F%20%E2%80%93%20Hipsters%20%2368&t_d=O%20que%20faz%20um%20CTO%3F%20-%20Hipsters%20%2368%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=O%20que%20faz%20um%20CTO%3F%20%E2%80%93%20Hipsters%20%2368&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Caio","comment":"Estou passando uma situação difícil na empresa que estou atuando, o Gerente de TI atua nos sistemas da empresa da forma como falaram que é o trabalho de um CIO, não existe um CTO, o desenvolvimento é terceirizado para fábricas e os PO's são internos.Resultado, não existe liderança no desenvolvimento dos produtos que geram receita de verdade, o gerente está focado em sustentação e o cliente de negócio extremamente insatisfeito.O que fazer?Obrigado pelo conteúdo, o papo me ajudou a pensar na minha carreira.Abs"},{"author":"Fellipe Borges","comment":"Obrigado pelo episódio.Há uns 3 meses eu fiz essa mesma pesquisa (\"O que faz um CTO\") e foi difícil achar resultados de qualidade, mesmo em inglês.Valeu, sucesso."},{"author":"Yui","comment":"Excelente podcast, mas  eu gostaria dos links dos livros que foram mencionados, será que tem como incluir aqui?"},{"author":"Carlos Evandro","comment":"Olha, eu me lembro do \"Leading Snowflakes\" -> http://leadingsnowflakes.com/ do \"Management 3.0\" -> https://www.amazon.com.br/M... \"Turn The Ship Around\" -> https://www.amazon.com.br/T...e doAs 21 irrefutáveis leis da liderança -> https://www.amazon.com.br/A..."},{"author":"Lucas Palma Stabile","comment":"Ótimo episódio, deu pra entender melhor dessa função, que aliás devo ter ouvido pela primeira vez por aqui. Nesse episódio falam sobre passivos tecnológicos, mas o que seriam exatamente? Aquelas rotinas que devemos fazer no deploy que esquecemos? Ou tem relação com código de uma parte do sistema que pode dar problema? E o que seria 24 por 7, também citado no programa?"},{"author":"Wagner Narde","comment":"Passivo tecnológico é a mesma coisa que “dívida” técnica. É quando você tem alguma implementação que sabe que não é a melhor, mas escolhe deixar de lado pra resolver depois.24 por 7 significa 24 horas por dia, 7 dias por semana."},{"author":"Lucas Palma Stabile","comment":"A sim, entendi a parte do passivo tecnológico. O pior é que quem mais vê essa parte são os técnicos e as vezes é difícil falar com a gerência ou acima deles sobre a importância disso.A parte do episódio que falaram sobre 24 por 7 que acabei não entendendo o contexto, que quando a pessoa chegou na empresa penavam para fazer um deploy e ele comentou que estavam aprendendo \"24 por 7\" aí não tinha entendido nesse contexto, seria alta disponibilidade dos serviços?"},{"author":"Jefferson Gouveia","comment":"Excelente episódio, saindo um pouco das tecnologias em si e indo pra questão de organização que ao meu singelo ver, é onde reside o maior desafio das equipes."},{"author":"Thiago Grespi","comment":"Esse comentário foi apagado."},{"author":"Thiago Grespi","comment":"Banco de dados?"},{"author":"flpms","comment":"Fiquei curioso para saber o blog citado pelo Marcelo Toledo."},{"author":"Lucas Gomes de Oliveira","comment":"Muito bom o podcast pra ficar sempre atualizado dos termos...queria dar uma sugestão de um tema pra um proximo podcast... vocês poderiam falar de \"Docker\""},{"author":"Marlon Baptista de Quadros","comment":"Apoiadíssimo!!!"},{"author":"Jonathas Trevisan","comment":"Pessoal, qual o livro que vocês recomendaram? Não deu para entender o nome :("},{"author":"Rômulo Martins","comment":"Eu acho que é esse aqui...http://leadingsnowflakes.com/"},{"author":"disqus_hvlXOoYmoO","comment":"Esse mesmo Jonathas Trevisan"},{"author":"Mário Augusto Requejo Júnior","comment":"Faltou o link do blog de um dos participantes."}]}