{"title":"Startups, investimentos e corretoras – Hipsters #70","releaseDate":"14/11/2017","tags":["Podcast","startup"],"people":["Paulo Silveira","Tito Gusmão","André Gusmão","Maurício “Balboa” Linhares","Rodrigo Dantas"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1355%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1355&t_u=https%3A%2F%2Fhipsters.tech%2Fstartups-investimentos-e-corretoras-hipsters-70%2F&t_e=Startups%2C%20investimentos%20e%20corretoras%20%E2%80%93%20Hipsters%20%2370&t_d=Startups%2C%20investimentos%20e%20corretoras%20-%20Hipsters%20%2370%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Startups%2C%20investimentos%20e%20corretoras%20%E2%80%93%20Hipsters%20%2370&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Erick Alves Vulgo Foguinho","comment":"Fiquei muito interessado porém vi muitas reclamações da warren com relação a venda de produtos e os mesmos não foram entregues, problemas para efetuar cancelamento (o que possui maior parte de reclamações), isso levantou uma duvida se faço ou não investimentos com eles lembrando que estou entrando agora nessa área porque sou programador a alguns anos."},{"author":"Kelvin Dules","comment":"Legal o ep. Fui trollado pela notificação do web.whatsapp em 04:51, pô."},{"author":"Thiago Santos","comment":"Eu também kkkkk"},{"author":"Bruno Dias","comment":"A ideia é bacana. Entrei na plataforma. Mas não é pra mim, prefiro aplicar mesmo em ações. Pelo que vi não é pra esse tipo de investidor. =/"},{"author":"Wagner Fernandes","comment":"Alguma atualização no player? Aqui ficou um pouco bugado e alguns controles não apareceram."},{"author":"Paulo Silveira","comment":"opa! conflito de plugins. parece que resolveu"},{"author":"Wagner Fernandes","comment":"Show! aqui foi."},{"author":"Maxranderson Araújo","comment":"Parabéns! Os podcasts estão excelentes! Gostaria de saber quando farão um podcast sobre as novas linguagens que utilizam a JVM, como Scala e Kotlin."},{"author":"Rafael Felipe","comment":"Vejam, não achei o episódio ruim, cumpriu seu objetivo (me deixar curioso sobre o Warren). Mas foi muita propaganda, pouca tecnologia e pouco startupismo.Cuidado pra isso não ficar frequente, só uma crítica de um admirador."},{"author":"Paulo Silveira","comment":"oi pessoal. a gente tem deixado a cada 5 episodios um espaco pras startups falarem. ai nao tem muito como nao ter um tom de propaganda :). mas a gente vai pegar mais o lado tecnico do que do business a partir desse episodio"},{"author":"Renato Bezerra","comment":"Também percebi isso."},{"author":"Hitalo Filipe","comment":"Pessoal, os controles não aparecem. Falta o arquivo \"controls.svg\""},{"author":"Paulo Silveira","comment":"veja se agora foi!"},{"author":"Caio Vinicius Malheiros Duarte","comment":"Boa tarde galera!Episódio sensacional!Só faltou o link do outro podcast.Pesquisando na internet eu encontrei, para quem também ficou interessado segue o link:https://www.likeaboss.com.br/Abraço"},{"author":"Wellington Menezes","comment":"Boa tarde senhores,Qual seria o link do podcaste sugerido no final da intervista."},{"author":"Caio Vinicius Malheiros Duarte","comment":"Boa tarde brother beleza?Segue o link: https://www.likeaboss.com.br/=)"},{"author":"Michael Sláinte","comment":"Eu queria fazer uma pergunta. Eu não moro no Brasil. Queria saber se e possível investir em euros no site de vcs?Se sim,  como funciona a questão de cambio. Gostaria de parabenizar o Hipsters, sou ouvinte a um ano e sou bem feliz com o podcast.Obg."},{"author":"Lucas Lopes","comment":"Ia abrir uma conta mas não tem o aplicativo pra Android"},{"author":"gabrielbaronbastos","comment":"Fala Lucas, nosso app tá em beta! Pelo site oiwarren.com você faz o cadastro normalmente e depois baixa o app pra acompanhar seus rendimentos :)"},{"author":"Gustavo","comment":"Só gostaria de adicionar que esperava falar um pouco mais sobre alguns fundos bem quants mesmo, tipo Renaissance Technologies e Two Sigma.E se fosse um pouco mais longe, sobre a Numer.ai também.De qualquer maneira, foi bem legal o episódio e vale a pena conferir."},{"author":"Lorran","comment":"De fato esse cara falou besteira pra caramba, mas ta certo ele tem que vender o peixe dele.Dizer que nos EUAs não tem nenhuma corretora boa pra gente, ta de sacanagem.Olha a DriveWealth arrebentando nos Euas e a Degiro na Europa. Ele não disse se dava pra comprar ação pela plataforma, pelo que eu entendi era só fundo mesmo.No resto Parabéns Paulo.Vlw Abraços"},{"author":"Thiago Miro","comment":"Thiago aqui, vulgo editor do Hipsters. =)Eu venho há MUITOS meses procurando uma forma de começar a fazer investimentos mas a minha barreira sempre foi não saber o que fazer, tudo nessa área é muito confuso pra quem não manja de economia. Até a plataforma Easy não me pareceu fácil.Ainda enquanto estava editando esse episódio já me surpreendi com o Warren, fui lá criei minha conta e de fato a coisa é bem simples. Continuo sem ter muita ideia de como funciona a economia, mas no app consegui entender bem onde meu dinheiro tá sendo colocado e o que tá acontecendo com ele nesse processo. Já fiquei satisfeito com isso.Não criei objetivos de viagens ou compras, eu só procurava apenas lugar pra guardar que não fosse poupança comum."},{"author":"Maurício Linhares","comment":"Inception no Hipsters!"},{"author":"Caio Incau","comment":"Existem sim fundos que vencem a bovespa com constância, principalmente Multimercados, o podcast foi muito bom, mas dizer que vale mais a pena comprar índice...isso é desmerecer o trabalho de ótimos gestores.Mesmo em um ano como esse onde batemos recordes no iBovespa, vários fundos grandes superaram ela.Basta puxar o histórico dos últimos 3 anos.http://comparadordefundos.c..."},{"author":"Paulo Silveira","comment":"oi Caio. Só pra lembrar: não sou eu que falei pra comprar indices de fundo  low cost. Quem falou foi o Warren Buffet:https://www.cnbc.com/2017/0...Assim como a historia de que 80% dos gestores perdem pros indices todos os anos, nao sou eu tambem, é estatistica coletada. Existem sim fundos que vencem com frequencia a bovespa e outros indices, mas o que esses estudos provam é que ao que parece, ao longo prazo todos eles perdem, tanto que o Buffet fez a aposta e o unico corajoso que topou encarar... perdeu:https://www.cnbc.com/2017/0...A chance é de 1/5:https://www.investopedia.co...E a pergunta é: somos capazes de acertar na mosca e escolher os 20% dos fundos que sao melhores que os indices? Ou melhor deixar o dinheiro no indice e vencer 80% dos multimercardos?De novo, nao sao ideias minhas, e nem do Tito, sao coisas que aparecem por ai. Investimento é algo muito pessoal e cada um deve decidir por si só estudado, bem no tom que fala o Leandro Avila"},{"author":"Renato Dinhani","comment":"Para suportar o ponto que fundos multimercados batem a bolsa, fiz essa análise em uma ferramenta que criei para análise de fundos, considerando apenas fundos que ainda estão abertos nas principais corretoras.O eixo Y indica se um fundo superou ou perdeu para o Ibovespa: https://www.investopedia.co...O eixo X é uma  medida de consistência de ganhos dos fundos: https://www.investopedia.co...Como pode ver, a maioria dos fundos superaram o índice da bolsa brasileira.Acredito que não dá para aplicar a aposta do Buffet no Brasil devido ao tamanho das bolsas. O próprio índice S&P500 tem mais empresas que a bolsa brasileira inteira.Por fim, apenas por curiosidade, a CVM publica dados de rentabilidade de todos os fundos aqui:http://dados.cvm.gov.br/dat...\n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n"},{"author":"Caio Incau","comment":"Então, mas o Buffet apostou no S&P 500, um índice que vem na crescente desde 2002, tendo uma pontual de 50% na crise de 2008/2009 e que vem subindo desde lá, já o nosso índice Bovespa vem balançando ao logo do mesmo período.Um exemplo básico é: Se o cara comprasse a ETF, BOVA11, atrelada ao Bovespa em 2013, e sacasse antes de 2017, ele teria desvalorizado o próprio dinheiro, sem contar a inflação.Acho injusta a comparação do índice americano com o nosso.No mais, parabéns pelo podcast e principalmente ao pessoal da Warren por democratizar a diversificação de investimentos, usei a Vérios(concorrente direta deles) por um bom tempo e fui bem feliz com os robozinhos."},{"author":"Flavio Silva","comment":"Muito bom o Podcast, principalmente porque é um assunto que gosto muito e tenho estudado nesses últimos anos.Hoje não tem mais desculpa para começar a investir, existe muito conteúdo gratuito no Youtube de vários influenciadores digitais, tem a conta da Nubank que investe o seu dinheiro atrelado a Selic e agora a Warren facilitando ainda mais para quem está começando ou não está afim de aprender a sopa de letrinhas.Concordo que finanças deveria ser ensinado nas escolas, infelizmente o brasileiro não tem a cultura de guardar dinheiro, mas acredito que isso vai mudar aos poucos, baby steps."},{"author":"Cleiton Dantas","comment":"Meus parabéns Paulo e toda galera hipster pelo excelente podcast sempre com conteúdo da melhor qualidade e é bom saber que a empreitada tá crescendo e dando frutos agora temos mais um podcast com selo hispter de qualidade."}]}