{"title":"Designers e Programadores – Hipsters #71","releaseDate":"21/11/2017","tags":["design & ux","Podcast"],"people":["Paulo Silveira","Thiago Vilaça","Vitor Guerra","Carla de Bona","Yuri Padrilha"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1371%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1371&t_u=https%3A%2F%2Fhipsters.tech%2Fdesigners-e-programadores-hipsters-71%2F&t_e=Designers%20e%20Programadores%20%E2%80%93%20Hipsters%20%2371&t_d=Designers%20e%20Programadores%20-%20Hipsters%20%2371%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Designers%20e%20Programadores%20%E2%80%93%20Hipsters%20%2371&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Nilton Filho","comment":"Ótimo podcast. Fiz questão de apresentar alguns episódios para meu chefe no trampo."},{"author":"Rodrigo Dias","comment":"Qual é o serviço de GitHUb pra designs ?"},{"author":"Natan Souza","comment":"Nesse tópico que rolou na Alura a Leticia Mayumi respondeu essa dúvida! :) https://cursos.alura.com.br..."},{"author":"thiagokotter","comment":"Sobre o \"pixel perfect\", achei interessante o comentário de um participante que agora não lembro o nome (ouvi o podcast fazendo outras coisas ao mesmo tempo). Ele disse algo parecido com o seguinte: \"eu como desenvolvedor preciso ter uma certa empatia pelo designer que fez aquele layout, pois ele perdeu seu tempo planejando cada cor e contraste, cada espessura de linha, cada margem...\".Eu como designer gráficoe sinto isso na pele muitas vezes. A gente perde tempo escolhendo a melhor paleta de cores e espaçamentos e tamanhos de fonte, a gente testa 15 vezes várias alternativas até chegar em algo que acreditamos ser o ideal (não são uma nem duas vezes, são quinze mesmo!) e daí recebemos um resultado que é extremamente fora das expectativas e dos detalhes friamente calculados.Claro que a gente releva quando pode, a gente pensa \"não tá do jeito que eu queria, mas tá quase...\". E acaba servindo pro MVP. Mas que é frustrante, isso é! Frustrante pois não se trata de mero \"capricho\", se trata de tentativas e erros, de 3 ou 4 horas de trabalho. E tá tudo lá, especificado no PS ou no AI (eu prefiro Illustrator, by the way).Mas também já tive EXELENTES experiências com programadores que me deram uma aula de UX, aplicando de maneira extremamente prática e funcional ideias de UX que só estavam no papel, sem esboço, sem protótipo, sem nada!Realmente precisamos ser \"amigos\" acima de tudo. Designers e programadores, UNI-VOS!"},{"author":"Kaue Lima","comment":"Ótimo podcast! Eu, como designer, acompanho o hipsters vez ou outra quando aparece algo que me interessa e esse programa resumiu bem a interação entre designers e devs. Eu gostaria de adicionar apenas uma ferramenta a mais que é a que usamos aqui na minha equipe. Como temos uma equipe com sistemas operacionais diferentes acaba que a solução do sketch não funciona muito bem para nós.Com isso achamos o UXPin que (apesar de alguns bugs aqui e acolá) supre muito bem todas as necessidades de nossa equipe. Desde criação de protótipos rápidos para validar um mapa de telas até o protótipo Hi-Fi com interações todas definidas e o mais importante de tudo, permitindo interação de vários designers no mesmo protótipo.Últimamente tenho ficado bem animado com as novidades do Adobe XD e agora com as features de handoff entregues em sua versão 2.0 já estamos fazendo alguns testes com a ferramenta. Pra mim, o Adobe XD deve ser a ferramenta que escolheremos no futuro faltando apenas micro interações (subir modal, deslizar drawer, etc) e a famigerada colaboração real time para virar a ferramenta de escolha da minha equipe!"},{"author":"Jarbas Viana","comment":"Gostei desse Hipster, será que tem como fazer um de Java sobre o mercado no brasil e no mundo."},{"author":"Leandro","comment":"Conteúdo Toplet ps =  \"29b307e415a1962553d8d84576635381\"console.log(ps)"},{"author":"Vitor Guerra","comment":"<3"},{"author":"Cleison Lima","comment":"alguém pode me mandar o nome das ferramentas mencionadas neste podcast? as que substituem o photoshop"},{"author":"Vitor Guerra","comment":"Oi Cleison Lima , tudo bem?Tentei segmentar mais ou menos, mas existe muitas sobreposições na prática. Por exemplo, dá pra prototipar no Adobe XD ou gerenciar bibliotecas de design com o Figma:Desenhohttps://www.sketchapp.com/https://www.figma.com/http://www.adobe.com/br/pro...http://www.adobe.com/br/pro...[Bônus] https://www.invisionapp.com...Handoffhttps://www.invisionapp.com/https://zeplin.io/Prototipaçãohttps://www.invisionapp.com/https://marvelapp.com/Gestão do designhttps://www.goabstract.com/[Bônus] https://www.invisionapp.com..."},{"author":"Cleison Lima","comment":"valew, obrigado !"},{"author":"David Costa","comment":"FIGMA!!! <3"},{"author":"Vitor Guerra","comment":"<3 <3 <3"},{"author":"Clayton Passos","comment":"gitkraken é um client git visualmente interessante, deem uma avaliada :Dhttps://www.gitkraken.com/"},{"author":"Vitor Guerra","comment":"Clayton Passos Cheguei a testar, mas não versionava arquivos de design como Dketch e Photoshop por não serem binários. O Abstract resolveu isso muito bem pro meu time :)"},{"author":"Francisco Thiago","comment":"Além do design ser muito agradável :)"},{"author":"Vitor Guerra","comment":"Francisco Thiago Dá uma olhada no Abstract! Se vc é designer vai se apaixonar também =D"},{"author":"Tiago Lima","comment":"E o jaba da Black Friday???"},{"author":"Paulo Silveira","comment":"hehehe. ta no ar la na alura agora :)."},{"author":"Lucas Palma Stabile","comment":"Aqui vai meu relato de onde trabalho, empresa pequena umas 15 pessoas, temos só 1 designer e atualmente está montando umas telas para aprovação de um novo projeto. Acho que um dos embates aqui não é necessariamente entre programadores e o designer, mas entre o designer e o dono da empresa, que acaba ditando muito do layout do site como cores, fontes, espaçamento e muito mais. Fico me perguntando se isso é comum em empresas com pouquíssimos funcionários (no meu outro trabalho acabava acontecendo a mesma coisa), do dono ter aquele sentimento que o site, a solução é dele e é ele que deve ditar como ficará, em vez de deixar essa parte para os designers. Existe alguma maneira para aliviar isso pro designer, de convencer a chefia ou é acatar o que é pedido, mesmo se a experiência dele diz o contrário?"},{"author":"Kamilla Bittencourt","comment":"O problema é o tempo que o teste pode levar, e geralmente essas empresas pequenas querem as coisas à jato, ai o argumento q fica dependendo do teste não pode existir, e isso só vira um ciclo. A melhor coisa a se fazer é pegar a mochila, coloca nas costas e sair andando, procurar outra beira pra trabalhar."},{"author":"Vitor Guerra","comment":"Pelo que já vivi, o melhor modo de mudar isso é com dados e testes que comprovem suas hipóteses como designer, mas, sinceramente, não entendo essa postura de um líder... se você não cofia no trabalho do seu time ao ponto de mudar tudo que um designer faz, nem sei porque ele tem um time em primeiro lugar. Se você não confia em sua equipe pq contratou aquela pessoa? o.O"},{"author":"Lucas Palma Stabile","comment":"Eu também não entendo. Eu acho que vai muito da pessoa ser a dona da empresa e tudo precisa sair de acordo dele. Sobre isso de testes é uma boa, lembrei do episódio dos testes A/B e parece que isso poderia ajudar mesmo, para comprovar com dados."},{"author":"Matheus Castiglioni","comment":"Aqui também acontece a mesma coisa Lucas, eu sou responsável pelo front de todos nossos projetos ou sites e todo design que eu faço o patrão fala alguma coisa."},{"author":"Beto","comment":"Podcast bem legal parabéns! Não conhecia a ferramenta para controle de fonte voltada a design vou testar. Sugestões: teria como colocar os links das ferramentas comentadas e  incluir a funcionalidade de play/pause na div que contém a imagem do podcast, toda hora eu fico clicando tentando pausar e dar play ali rsrsr. Abraço!"},{"author":"Vitor Guerra","comment":"Oi Beto, tudo bem?Tentei segmentar mais ou menos, mas existe muitas sobreposições na prática. Por exemplo, dá pra prototipar no Adobe XD ou gerenciar bibliotecas de design com o Figma:Desenhohttps://www.sketchapp.com/https://www.figma.com/http://www.adobe.com/br/pro...http://www.adobe.com/br/pro...[Bônus] https://www.invisionapp.com...Handoffhttps://www.invisionapp.com/https://zeplin.io/Prototipaçãohttps://www.invisionapp.com/https://marvelapp.com/Gestão do designhttps://www.goabstract.com/[Bônus] https://www.invisionapp.com..."},{"author":"Beto","comment":"Sensacional, muito obrigado Vitor e parabéns novamente pelo cast. Abraço!"},{"author":"Davidson Silva","comment":"Mais um ótimo podcast. Senti falta de vocês falarem do Gravit Designer...Se não conhecem, segue o link ...https://www.designer.io/Parabéns pelo trabalho."},{"author":"Vitor Guerra","comment":"Davidson Silva Legal cara! Você usa? Nunca experimentei..."},{"author":"Davidson Silva","comment":"Uso sim, tbm o sketch e o xd...Vale a pena experimentar.....Abraço."},{"author":"Vitor Guerra","comment":"Irei!"},{"author":"Mateus Moog","comment":"Sobre designer usar ou não Github: aqui na Pagar.me estamos fazendo nossa nova dashboard totalmente open source no Github, inclusive o design :).Se quiserem, deêm uma olhada no repositório: https://github.com/pagarme/..."},{"author":"Vitor Guerra","comment":"Mateus Moog Muito foda!"},{"author":"Paulo Silveira","comment":"isso sim é iniciativa diferente!"},{"author":"Takara","comment":"Gostaria de uma talk falando sobre VueJS ou um \"usar ou não usar JQuery?\". Seria interessante :) Valeu! Sempre acompanho vocês."},{"author":"Fabio Moura","comment":"Escutei o Paulo roncando..."},{"author":"Paulo Silveira","comment":"engano seu :)"},{"author":"Fabio Moura","comment":"Então foi eu... Da um spoiler ai pra gente e diz quem é o boss que  vai estar no like a boss de amanhã? rsrs"},{"author":"Bruno Gonçalves","comment":"Legal o assunto! Mas, pouco acalorado o bate papo, faltou aí o Maurício “Balboa” Linhares para dar uma apimentada heheheAh, e a figura do backender nesse contexto?"},{"author":"Leandro Novaes","comment":"Dev Backend já está longe do Front quanto mais do Design hehehehe!!!"},{"author":"Clayton Passos","comment":"Graças ao Angular 2+ tenho dado uma chance ao Front novamente, e saindo um pouco do Java :D Mas claro, que para HTML+CSS preciso de ajuda, por enquanto ;)"},{"author":"Paulo Silveira","comment":"esses sim nao se misturam ahhaha"}]}