{"title":"Por trás do WordPress – Hipsters #72","releaseDate":"28/11/2017","tags":["business","Podcast","programação"],"people":["Paulo Silveira","Guga Alves","Mario Souto","Sérgio Lopes"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1391%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1391&t_u=https%3A%2F%2Fhipsters.tech%2Fhipsters-72-por-tras-do-wordpress%2F&t_e=Por%20tr%C3%A1s%20do%20WordPress%20%E2%80%93%20Hipsters%20%2372&t_d=Por%20tr%C3%A1s%20do%20Wordpress%20-%20Hipsters%20%2372%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Por%20tr%C3%A1s%20do%20WordPress%20%E2%80%93%20Hipsters%20%2372&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Anderson Matias da Silva","comment":"Trabalhar em casa é um sonho, ou melhor ainda, ser nômade digital. Por isso que estudo Front-end, e comecei a estudar Wordpress agora. Há muita procura por freelancers que saibam trabalhar com Wordpress."},{"author":"Bruno Maximo","comment":"Nunca vi um podcast tão comprado como este! Wordpress já apresentou inúmeras falhas de segurança e nada disso foi abordado."},{"author":"Guga Alves","comment":"Todo sistema já apresentou falhas amigo, não existe nada 100% perfeito no mundo ;)"},{"author":"Bruno Maximo","comment":"Meu ponto não foi sobre perfeição! Se era um papo sobre a ferramenta deveria ter abordado pós e contras da mesma... E ainda tem o fato de que Wordpress mal ser orientado a objeto e não segue o padrão mvc."},{"author":"Guga Alves","comment":"Bruno, não existe essa máxima de que apenas sistemas padrão MVC são bons e os demais são ruins, isso não é requisito obrigatório para determinar se um sistema é bom ou não. Você pode muito bem fazer seus temas e plugins sendo MVC se você quiser, tem toda liberdade para isso.E se era um papo sobre ferramenta, deveria ser sobre o que o grupo em questão quiser conversar sobre, não? Não tem nada definido de que todo podcast de tecnologia tenha que seguir requisitos definidos por alguma lei ou norma, cada um trata o seu conteúdo da forma que desejar. WordPress pode não ser para tudo, mas os 2 pontos que você citou não se mostram tão absurdos quando a gente olha que 29% dos sites do mundo o usam mesmo assim, se isso fosse tão preponderante muita gente não o utilizaria. Mas se é tão primordial para ti, você pode user CodeIgniter, Laravel, e vários outros frameworks que sejam assim e não o CMS que abordamos neste episódio.Tem várias formas de fazer algo bom, não se limite apenas a olhar um checklist e se não tiver um ou outro ponto não ser bom, não é assim que o mundo funciona na prática. Você tem todo o direito de não utilizar, mas deveria tomar mais cuidado e ter mais respeito antes de dizer que algo é comprado só pq não citou os pontos que você gostaria de ouvir."},{"author":"Lucas Senna","comment":"Olá, queria saber onde posso tirar uma certificação boa de Wordpress?"},{"author":"Guga Alves","comment":"Cara, certificação nessa área open source não vai te ajudar em muita coisa não, você tem é que saber mostrar que sabe mas o pedaço de papel em si não vai provar nada não. Se você quer mesmo aprender eu te diria pra aprender bem PHP e ler os handbooks que estão no codex, na documentação do WordPress, se você pesquisar por \"handbook WordPress\" no Google você encontrará os handbooks de desenvolvimento de temas e plugins."},{"author":"Guilherme Matheus","comment":"Muito bom o PodCast, desenvolvo em Wordpress me considero como um WPDEV intermediário, ele é incrível você reduz muito o processo de criação do site."},{"author":"Felipe Santos","comment":"Muito bom o Podcast de hoje. Excelente participação do Guga. Que venha mais vezes. Já entrei no site da Automatic. Guga, vi alguns positions lá. O que mais é requisitado na Automatic para entrar na equipe ?"},{"author":"Guga Alves","comment":"Bom inglês e o que está escrito em cada vaga mesmo. Galera aqui busca habilidades, não currículum ou qualquer coisa burocrática do tipo (que nem sempre prova habilidade ou conhecimento). Se você acredita ter mesmo os skills que a vaga descreve, se inscreve lá!"},{"author":"Erick Nunes","comment":"Muito bom ! Alguém tem uma dica de como ativar a api Rest do wordpress ?"},{"author":"Guga Alves","comment":"Já é ativa por padrão. Tenta colocar /wp-json depois do endereço do site que você vai ver que já dá retorno por padrão, só não mostra se for desativada mesmo. Mais detalhes em https://developer.wordpress..."},{"author":"Aloisio","comment":"O Guga Alves tem a voz do  Marcos Veras da  EnglishLive !!! kkk Achei que era ele qdo ovi..."},{"author":"Guga Alves","comment":"Espero que isso seja bom! hahahahaha"},{"author":"Leonardo Souza","comment":"O episódio de hoje foi bacana d+. Parabéns ae galera !"},{"author":"Fausto Blanco","comment":"como sempre vocês trazendo algo importante, uma duvida, quando teremos a interface do .com no .org?"},{"author":"Guga Alves","comment":"A interface do .com é um aplicativo feito com node e react, é feito à parte mesmo e não para substituir o wp-admin diretamente. Você pode baixar o app em https://apps.wordpress.com/  e gerenciar sites feitos com o software do WordPress.org que tenham o plugin Jetpack instalado :)"},{"author":"Renan Lara","comment":"Muito bom, parabéns! Falaram um pouco de WooCommerce, seria legal ver o Claudio Sanches dar uma palhinha sobre o assunto."},{"author":"Fernando Henriques","comment":"O WooCOmmerce já botou algum dinheiro no bolso facilitando minha vida em alguns projetos. Seria ótimo realmente um episódio sobre ele no futuro."},{"author":"Ítalo Araújo Siqueira","comment":"Um \"offtopic\":  a trilha sonora estava ótima!"},{"author":"Fabio Moura","comment":"Uma pergunta de iniciante, pq o código do WP não é orientado a objetos?"},{"author":"Guga Alves","comment":"Não sei te responder, mas pergunte a você mesmo se um sistema voltado para qualquer pessoa o entender deve utilizar toda estrutura no alto nível que alguns gostariam. Porque logo o que não é é o mais popular do mundo?Pensando de forma pessoal eu também gostaria, mas me pergunto se muitos que o utilizam continuariam o utilizando ou se o adotariam se fosse algo como muitos devs querem, mas se esquecem que muitos dos que o utilizam estão apenas em estágio inicial de aprendizado no PHP e poderiam nem continuar se as exigências fossem altas desde o começo."},{"author":"David Costa","comment":"\"Porque logo o que não é é o mais popular do mundo?\" Acho que isso é desculpa, para mim o código é muito arcaico. Esse é um dos motivos de não usar mais o wordpress porque para mim não me atende mais, mas entendo que para outras pessoas e devs serve muito bem."},{"author":"Guga Alves","comment":"Eu não falei que é desculpa mas é um ponto a se pensar, é uma pergunta de advogado do diabo mesmo. Analise o mercado dele, quem usa, etc, que isso trará a resposta ;)"},{"author":"David Costa","comment":"Me pergunto isso todos os dias, Mas imagino que o projeto é muito antigo, e agora está muito difícil mudar. Nesta altura do campeonato."},{"author":"vilourenco","comment":"Não sei te informar o motivo, mas no desenvolvimento de plugins, por exemplo, MUITOS são em OO."},{"author":"David Costa","comment":"Já Trabalhei e trabalho com o Wordpress desde 2015, e uma coisa que mais gostaria que o wordpress adotasse é uma metodologia MVC, com mais possibilidades de desenvolvimento, com essa dificuldade ficamos muito na mão de outros plugins de terceiros mal escritos."},{"author":"Guga Alves","comment":"Não vejo porque todo sistema tem que ser exatamente MVC, se fosse seguir este parâmetro não existiria nenhum que não é e isso não é pre-requisito pra ser bom ou não. Sobre ficar na mão de outros plugins mal escritos, você pode escrever melhor outros plugins e os disponibilizar, plugins são algo opcional e fica a cargo de quem os escolhe decidir usar ou não, e não da equipe que cria o sistema."},{"author":"David Costa","comment":"Só acho que agente tem que tentar segui o rumo do rio."},{"author":"Guga Alves","comment":"Nem todo rio segue o mesmo curso, é por isso que se encontram em algum ponto mas irrigam territórios diferentes que ficam para lados diferentes. Tem espaço para tudo, tem rios para todos os lados e cada um pode escolher pra que lado quer remar sem achar que o outro lado é pior, menos bom, etc. Cada um na sua, respeitando o lado que os outros queiram remar. E sim, tem toda questão de retrocompatibilidade citada pelo Paulo, que é algo muito importante e sempre é muito bem pensado pra continuar mantendo todos com ele."},{"author":"Paulo Silveira","comment":"Acho que se tudo fosse criado do zero, certamente usariam as melhores práticas, frameworks mais novos, etc. Mas o wordpress é uma plataforma gigante e no ar ha muito tempo, com muitos plugins e temas pra tentar manter compatibilidade. É um desafio. na minha opiniao eles fazem um trabalho muito bom balanceando esses pontos."},{"author":"David Costa","comment":"Concordo. Realmente entendo esse ponto. é muito complicado mudar o que está rodando a tanto tempo. Como disse a cima, para mim não me atende as minha necessidades, mas apesar de reconhecer seu valor na comunidade PHP e ajudar muita gente."},{"author":"Fernando Henriques","comment":"David, talvez o ponto seja inverso. Considere outro cenário: não é o Wordpress, que basicamente é um CMS, apesar de fazer mais do que isso, que deve adotar o modelo MVC e sim você, utilizando outro framework que implementa esta arquitetura em alguns projetos.Se a sua demanda se encaixa melhor no modelo MVC, para quê usar um CMS? O ecossistema do PHP é riquíssimo em frameworks MVC. Caso queira fazer um teste, eu lhe recomendaria um destes três: CodeIgniter (mais fácil), Laravel (mais popular) ou Phalcon (mais rápido).Soluções distintas para problemas distintos."},{"author":"David Costa","comment":"\"E a sua demanda se encaixa melhor no modelo MVC\". Sim, Sempre a aquele momento que vc vê que aquele sistema não lhe atende mais. E foi isso que aconteceu comigo."},{"author":"Fernando Henriques","comment":"Entendi. Bom, se por um caso estiver usando algum dos três que citei acima e precisar de ajuda, é só falar. Abs!"}]}