{"title":"Kanban e o fluxo de trabalho – Hipsters #74","releaseDate":"12/12/2017","tags":["agilidade","business","Podcast"],"people":["Paulo Silveira","Rodrigo Yoshima","Alessio Alionço","Maurício Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1416%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1416&t_u=https%3A%2F%2Fhipsters.tech%2Fkanban-e-o-fluxo-de-trabalho-hipsters-74%2F&t_e=Kanban%20e%20o%20fluxo%20de%20trabalho%20%E2%80%93%20Hipsters%20%2374&t_d=Kanban%20e%20o%20fluxo%20de%20trabalho%20-%20Hipsters%20%2374%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Kanban%20e%20o%20fluxo%20de%20trabalho%20%E2%80%93%20Hipsters%20%2374&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"fpalomaro","comment":"Muito bom o podcast! Bem interessante a discussão e cada vez vejo que minha formação de engenharia de produção está mais na moda rs Estas adaptações de Lean e Kanban que começaram no desenvolvimento de software e que estão se tornando mais “genéricas” e aplicáveis para outras indústrias ou mesmo pra todo trabalho administrativo são bastante úteis para ajudar a reorganizar como trabalhamos. Muito do que acontece em escritórios simplesmente ignora teorias antigas e novas que aprendemos em nossas graduações e que poderiam tornar o trabalho mais fácil e eficiente.Outro ponto, no podcast é feito o contraponto da ferramenta kanban aceitar toda e qualquer metodologia ou framework e ajudar a entregar de forma gradual melhorias contínuas enquanto outras metodologias são vistas com posturas tudo ou nada. Eu acredito que a falha aqui não está nas metodologias, mas sim nas pessoas fazendo as implementações com esta postura. O próprio Scrum já tem diversos aspectos da metodologia kanban incorporada ao framework, inclusive a ideia de implantação parcial e incremental. Até mesmo em gestão waterfall, os controles podem ser postos parcialmente, sem precisar jogar fora tudo que já se tem estruturado."},{"author":"Frederico Aranha","comment":"Ótimo podcast! Parabéns!"},{"author":"Marcos Jesus Santos","comment":"Alguma indicação de livros?"},{"author":"Ruizzera","comment":"Muito bom o conteúdo do podcast. Lembranç do kanban lá das aulas na faculdade qnd estamos os processos de produção de fábricas. Já tirei algumas ideias p pequenas mudanças no meu trabalho diário."},{"author":"Israel Dantas","comment":"Complementando, segue um podcast com o criador do Kanban, David Anderson. O sotaque é um pouco sofrível (escocês...), mas com um pouco de esforço dá pra entender :)https://podcast.agileuprisi..."},{"author":"Cleverson Lira","comment":"Eu viajo demais perguntando se o Kanban poderia ser implementado para governar um país?"},{"author":"Jon Cardoso","comment":"Kanban é necessário(ou scrum)! O \"não se aplica\" é exceção!"},{"author":"Adriano","comment":"Hipsters já estão de férias? Não encontrei podcast novo hoje :("},{"author":"Adriano","comment":"Só atrasou um pouco rs"},{"author":"Ivan Carvalho","comment":"Excelente artigo sobre STATIK, mencionado e bastante comentado no podcast: https://www.linkedin.com/pu..."},{"author":"Matheus Dantas","comment":"Eu gostei do podcast mas não gostei das comparações com o Scrum. Achei que a comparação ficou muito pobre e parcial. Parece que o scrum só serve para controlar as atividades, mas não foi citado as questões das entregas contínuas e todos os \"prós\" de cada metodologia."},{"author":"Ednaldo Dilorenzo","comment":"Não conhecia o Kanban, mas pelas características e do objetivo de melhorar o processo de uma empresa, achei muito similar ao uso de BPMS (Business Process Model System) que tem por objetivo mapear o processo atual da empresa pra identificar onde são os gargalos da mesma e como melhorá-los. Isso através de um software ao invés de um quadro."},{"author":"Rodrigo Yoshima","comment":"Com a diferença que BPMS é muito focado em sistemas simples e pouca variabilidade. O Kanban não institucionaliza. A ideia dele é a emergência/evolução."},{"author":"Rodrigo Xavier Felippe","comment":"Yoshima, nesse caso eu poderia aplicar o Kanban em uma area da empresa até adquirir a cultura necessária/estável para institucionalizar em uma automação com uso de BPMN? Digo isso pois muitas empresas hoje automatizam seus processos de negócios TO-BE, porém o AS-IS ainda está muito imaturo."},{"author":"Rodrigo Yoshima","comment":"Não necessariamente. A abordagem evolucionária do Kanban ignora o TO-BE, se afastando de ideologia ou utopia. Mudança evolucionária é completamente contra o status quo. Só consigo tirar pessoas da ideologia através de treinamento. Minha experiência. Se seu trabalho é no Mediocristão BPMN funciona. Nem sempre é adequado ao trabalho do conhecimento, onde o processo pode mudar todo dia."},{"author":"Rodrigo Xavier Felippe","comment":"Obrigado pelos esclarecimentos.PS: Por um mundo mais \"Extremistão\"."},{"author":"Frederico Machado","comment":"Não consegui ouvir até o final o “cara” tem mais vício de linguagem que o Dinho Ouro Preto. Acabei me distraindo com isso."},{"author":"Rodrigo Yoshima","comment":"Verdade. Foi meu primeiro podcast neste formato. Vou melhorar. Valeu o feedback!"},{"author":"Anderson Guimarães","comment":"Façam um sobre DevOps :-|"},{"author":"Francisco Prestes","comment":"Como sempre muito bom como todos os produtos da Caelum, Alura e Casa do Código."},{"author":"Paulo Silveira","comment":"eita, valeu Francisco! O Yoshima ta mandando muito bem e se aprofundou muito no tema, ai o podcast sempre rende"},{"author":"Fabrício Cabral","comment":"#YoshimaNaAlura ;)"},{"author":"Guilherme","comment":"OFF TOPIC: Alguém sabe o nome da música do início do episódio?"},{"author":"Bruno Gonçalves","comment":"A guitarra lembra Black Drawing Chalks!"},{"author":"Paulo Silveira","comment":"foi criado pelo Pedro lopes do musicdot.com.br especialmente pro podcast. já o rock é uma trilha que o pessoal da radiofobia comprou, justo pra ser usado assim"},{"author":"Fabrício Cabral","comment":"Muito bom esse podcast com o Rodrigo Yoshima! Já estava na hora de um com este grande mestre!No entanto, gostaria de esclarecer um ponto: Kanban é um mundo e tem assunto para uns 2 ou 3 podcasts (se não mais), bem como Big Data e Data Science (que foi abordado no também excelente podcast com a Fabiane Nardon). Entretanto, o podcast de Kaban tem por volta de 54 minutos e o de Big Data e Data Science por volta de 34 minutos (e espero que venham outros abordando o mesmo assunto). Assim, pergunto: há algum critério com relação ao tempo do podcast? Paulo Silveira será que você poderia esclarecer esse aspecto?"},{"author":"Paulo Silveira","comment":"Fabricio, eu gostaria sempre de mais tempo. O ideal era 45 minutos pra cada um. Mas se eu percebo que esta se aprofundando muito, prefiro nao continuar. Pode parecer estranho, mas é pra que o podcast fique sempre palatavel para o publico que nao conhece aquele assunto. Sei que pode nao ser o melhor pra quem ja conhece."},{"author":"Fabrício Cabral","comment":"Paulo Silveira É que os podcasts são tão bons que todos nós acabamos queremos sempre mais tempo! :) Também concordo com o assunto de Data Science é mais complicado e denso, mas acredito (sugestão) que poderia ter o tempo preenchido com mais cases, pois estes não faltam e todos nós sabemos que a Fabiane conhece centenas! Ainda assim, se você me permite uma sugestão, se você ver que o assunto rende muita conversa, por que não grava um \"grande\" e o divide em duas partes? No mais, parabéns a todos os entrevistados e o pessoal do Hipsters que vêm fazendo um excelente trabalho!P.S. Vou lançar a hashtag #YoshimaNaAlura, hein? :)"},{"author":"Ítalo  Mendonça","comment":"O Yoshima é mestre! Parabéns pela programa, pessoal!Um podcast complementar ao episódio de hoje é este sobre o Fluxo Unificado:https://blog.taller.net.br/...Ah, sempre bom lembrar ao pessoal o link para a comunidade ágil lá do Slack:https://agilidade.typeform....O canal #kanban é um dos mais ricos em conteúdo! :)Abraço!"},{"author":"Bruno Alessandro","comment":"cara para de falar \"cara\", por favor cara não da cara vc fala cara ate junto com outrCara palava cara ò.Õ"},{"author":"Rodrigo Yoshima","comment":"Cara, relaxa cara..."},{"author":"Lucas Repolês","comment":"cara ^ 1024 :)"},{"author":"Rodrigo Yoshima","comment":"Antes cara do que mano."},{"author":"Lucas Repolês","comment":"É verdade :D Mas foi só uma crítica construtiva ;) O podcast foi ótimo!"},{"author":"Rodrigo Yoshima","comment":"Eu valorizei muito os feedbacks aqui. Realmente preciso melhorar muito o jeito que eu falo. Pegue uma palestra minha antes de 2010 e você vai ver eu falar \"Tá\" 200 vezes (eu contei). Tirei esse vício, agora é \"cara\". O jogo continua!"},{"author":"Ednaldo Dilorenzo","comment":"Eu comecei a contar quantas vezes ele falou cara, mas desisti... :P"},{"author":"Lucas Repolês","comment":"Desculpe, mas eu não resisti em fazer essa piadinha :P Mas o programa foi excelente, como sempre!"},{"author":"Paulo Silveira","comment":"caras, deixem nosso paulistanes em paz :P"},{"author":"everton","comment":"Por favor nunca parem com esse Podcast!!! Espere a semana todo ansioso pelo próximo episódio haha"},{"author":"Mathias Horn","comment":"kkkkkkkkkkk, caraca cara!"}]}