{"title":"Containers e Docker – Hipsters #75","releaseDate":"19/12/2017","tags":["devops","infraestrutura","Podcast","programação"],"people":["Paulo Silveira","Roberto Hashioka","Fabio Kung","Maurício “Balboa” Linhares"],"disqusUrl":null,"comments":[{"author":"Bruno Borges","comment":" \n\t\t            \tCurti muito o episódio, agora me digam, que trilha da hora é essa de transição no minuto 30:22 à 30:26 kkkkk, profunda e muito reflexiva, é autoral ou de algum sound track específico?\n\t\t            "},{"author":"infoslack","comment":" \n\t\t            \tEpisódio muito legal!\n\t\t            "},{"author":"Fabio Moura","comment":" \n\t\t            \tDane-se o UX, coloquem um target=”_blank” nesses links por favor…\n\t\t            "},{"author":"Vitor Panuci","comment":" \n\t\t            \tA onda é deixar que o user decida o que fazer com o link, se estiver usando um mouse é so clicar com o mouse3 que tu vai para o link em nova aba =D\n\t\t            "},{"author":"Sergio Filho","comment":" \n\t\t            \tMuito Bacana .\n\t\t            "},{"author":"Rafael Quintino","comment":" \n\t\t            \tPaulo SIlveira, respondendo sua pergunta, Containers são melhores que uma simples virtualização pq permite a gestão de configuração e mudança do ambiente de forma textual em qualquer Sistema de Controle de Versão. Vc mesmo disse que se guardava uma imagem (binário), mas lembre-se que não é fácil desobrir o que aconteceu naquela imagem com relação as instalações e configurações.\n\t\t            "},{"author":"Daniel Marques","comment":" \n\t\t            \tSempre que eu estou com dúvida em um assunto novo que aparece pra mim, na mesma semana tem o podcast sobre o assunto kkkkkkkkkk.\nVLW Rapaziada do Hipsters.\n\t\t            "},{"author":"Marcio Carvalho","comment":" \n\t\t            \tPor favor, um episódio sobre Kubernetes\n\t\t            "},{"author":"Eder Soares","comment":" \n\t\t            \t+1\n\t\t            "},{"author":"Maurício Linhares","comment":" \n\t\t            \tVai sair \n\t\t            "},{"author":"Felipe Martins","comment":" \n\t\t            \tAtualmente a Microsoft está investindo forte em containers e os Containers windows todos rodam com Docker. O Azure já está com a estrutura bem preparada para Containers.\n\t\t            "},{"author":"Eder Soares","comment":" \n\t\t            \tMuito bacana! Como sempre conteúdo atual e de grande valor, parabéns galera!\n\t\t            "},{"author":"Eduardo Medeiros Branquinho","comment":" \n\t\t            \tUma forma que eu imagino de usar Docker, não sei se usam pra isso também, é para testes de integração. Quer dizer, quando eu dou um mvn test, quero que o teste rode um script que suba um docker de mysql por exemplo, rode meus testes de integração e depois derrube o container. Não sei se faz muito sentido mas me parece interessante.\n\t\t            "},{"author":"Maurício Linhares","comment":" \n\t\t            \tUsamos muito pra testes de integração!\n\t\t            "},{"author":"Bruno Marins","comment":" \n\t\t            \texiste um comando para o docker que inclusive depois de rodar os testes ele mesmo “mata o serviço”\n\t\t            "},{"author":"Fabricio Soares","comment":" \n\t\t            \tpelo amor de Deus, nunca, jamais PENSEM em acabar com esse podcast!!\n\t\t            "},{"author":"Everton Walker","comment":" \n\t\t            \tBacana demais o conteúdo, já tinha em mente sobre o que era mais esse podcast deu um belo upgrade sobre o que eu pensava e sabia sobre o assunto.\n\t\t            "},{"author":"Bruno Marins","comment":" \n\t\t            \tUso containers mesmo com o CMSs (wordpress, joomla etc), em uma junção de docker e git, o container é para o servidor php e os outros microserviços (redis, memcached e etc). O banco ainda nao me aventurei mas pretendo.  Pros pessoais pretendo usar pro node com mongodb.\n\t\t            "}]}