{"title":"Produtividade – Hipsters #76","releaseDate":"26/12/2017","tags":["business","Podcast"],"people":["Paulo Silveira","Rodrigo Franco","Maurício “Balboa” Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1468%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1468&t_u=https%3A%2F%2Fhipsters.tech%2Fprodutividade-hipsters-76%2F&t_e=Produtividade%20%E2%80%93%20Hipsters%20%2376&t_d=Produtividade%20-%20Hipsters%20%2376%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Produtividade%20%E2%80%93%20Hipsters%20%2376&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Fernando Liell","comment":"Esse assunto é a base do sucesso. Produtividade no Brasil ainda é um mito para muita gente no mercado de trabalho."},{"author":"Daniel Lucena","comment":"Qual app que fecha as paradas no Mac abertas a muito tempo? Excelente episodio."},{"author":"Matteus Barbosa","comment":"(14:55) O chefe sempre vai achar que vc precisa fechar 10 cards"},{"author":"Rafael Schneider","comment":"Bom. Mas galera transição, muito alto , deixa o cara terminar a fala. Nem dá pra ouvir. Mas conteúdo útil, parabéns pela pauta"},{"author":"Pires Lopes da Silva","comment":"Antes de tudo, parabéns! O titulo é produtividade, no entanto, se os princípios citados forem aplicados, a vida se torna mais vida...."},{"author":"Emanuel","comment":"O melhor episódio dentre todos já publicados!"},{"author":"Amandita","comment":"Recomendo o app para Andoid chamado HabitBull ele é otimo para quem quer criar um novo habito e monitorar o progresso"},{"author":"João Lucas dos Santos","comment":"Frase para você evitar redes sociais:\"Não deixe para amanhã o que você pode deixar pra lá.\""},{"author":"Kenji","comment":"Os livros que eles recomendaram no podcast foram: Os 7 hábitos das pessoas altamente eficazes, Peak: Secrets from the new science of expertise, Meditações de Marco Aurélio.Parabéns pelo episódio dicas bem úteis"},{"author":"Paulo Patto","comment":"@caffo compartilha as playlist de foco ai!O livro que o @mauriciojr recomendou e que esqueceram de colocar no show notes é o Blink ou PIC?"},{"author":"Maurício Linhares","comment":"É esse aqui: https://www.goodreads.com/b..."},{"author":"Pablo Lima","comment":"Excelente episódio. Ser produtivo nos dias atuais é tarefa difícil. Temos  sempre que buscar novas idéias para melhorar nossa produtividade."},{"author":"Rodolfo Dias Venancio","comment":"Um dos melhores episódios pra mim até hoje!!!!"},{"author":"Roberta Arcoverde","comment":"Curti muito esse episódio. Identifiquei-me com várias das estratégias adotadas pelos participantes para evitar a procrastinação - grande desafio, em especial, para quem faz home office. Algumas outras dicas que dão certo pra mim são i) usar uma extensão de 'nova aba' no navegador com um TODO list (uso Momentum no Chrome), assim minhas tarefas sempre pulam na minha cara quando bate a tentação, ii) ter 'break times' ao longo do dia, de 5 a 20 minutos, para sair do computador e clarear a mente, iii) durante o trabalho, deixar o celular em modo \"silencioso\". Especificamente pra home office, costumo sempre seguir um ritual antes de começar a trabalhar (fazer café, trocar de roupa, ler notícias) e sempre ligo a luz do escritório enquanto estou trabalhando. :) Parabéns pela discussão e foco em 2018!"},{"author":"Fernando Liell","comment":"Tiraria a Nóticias do ritual antes de trabalhar, pois vão tirar teu foco ou até mesmo tua autoestima dependendo do contexto."},{"author":"Leandro Takeda","comment":"Temos que tomar cuidado também em tentar ser auto produtivos demais e esquecer de viver. :)"},{"author":"Fernando Liell","comment":"Se produzir for resignificado como \"viver\", vamos viver altamente produtivos.   :)"},{"author":"Matheus Gomes","comment":"Dicas excelentes!"},{"author":"Robert Resende","comment":"Ótimo tema para podcast de fim de ano... eu estava na semana anterior justamente pensando e procurando práticas que poderiam me auxiliar a me tornar mais efetivo, produtivo e focado no meu dia a dia. Fala pro Caffo compartilhar as playlist's do spotify aí... eu sigo a brain food, deep focus e o app rainning.fm. Também gostei do artigo do guilherme silveira que aonde ele sugere que seja criado um calendário de estudos pelo menos mensal... Já havia desativado notificações seja via push, vibrações ou led's do meu celular... Bora tentar fazer meu 2018 mais produtivo e focado."},{"author":"André Luís","comment":"Podcast muito bacana, parabéns galera! A questão da interrupção realmente é complicada, é difícil criar um ambiente sem ela."},{"author":"Rodrigo Bartole","comment":"Linhares, esse tempo ininterrupto (extremamente necessário) eu consegui com teletrabalho alguns dias por semana."},{"author":"Marlon Barcarol","comment":"Uma dica pra não se distrair quando uma nova aba é aberta e o Chrome mostra os sites mais visitados, coloquem para abrir `about:blank` :)https://chrome.google.com/w..."},{"author":"Rodolfo Adhenawer","comment":"Muito bom, senti falta da lista de livros que o Paulo comentou assim como o colega Thiago Reis. Achei só os livros que comentaram os nomes no episódio."},{"author":"Maurício Linhares","comment":"Agora tem!"},{"author":"Thiago Reis","comment":"Não entendi o nome do livro que o Linhares falou. Você conseguiu encontrar? Qual o nome do livro?Abraço!"},{"author":"Maurício Linhares","comment":"Foi o Peak: https://www.goodreads.com/b..."},{"author":"Thiago Reis","comment":"Excelente episódio. Obrigado pelos insights sobre ter uma vida mais produtiva. Senti falta dos links dos livros que foram comentados no episódio."},{"author":"Maurício Linhares","comment":"Os links estão lá agora :D"},{"author":"Thiago Reis","comment":"Valeu Linhares!Já adicionando esses livros á minha lista de próximas leituras.Abraço!"},{"author":"André Felipe Ricarti","comment":"Também senti falta, vim direto para ver se achava os links..."},{"author":"Maurício Linhares","comment":"Agora tem os links :D"},{"author":"Emanuel Carvalho","comment":"Meu Deus, que geração de programadores é essa? Ai, eu não tenho aplicativos no smartphone, eu não respondo email, eu tenho secretária... Minha esposa ouviu e deu risada, isso pq ela estava trabalhando, cuidando do bebê e fofocando com as amigas dela no whatsapp."},{"author":"Fernando Liell","comment":"Depende do Nível de trabalho que está falando, para mim isso que citou é Hobbie. xD"},{"author":"Marlon Barcarol","comment":"No quesito de não ter aplicativos, alem de receber muitas notificações existe também o problema de privacidade, certos apps tem acesso muito amplo aos dados do usuário. Muitas vezes são desnecessários, pois podem ser acessados pelo seu browser :)"},{"author":"Paulo Silveira","comment":"é uma questao de foco. eu trabalho, respondo email, cuido das minhas duas bebes e fofoco aqui no hipsters. tudo ao mesmo tempo, mas sei que nao é o melhor caminho. ideal seria poder focar e separar bem essas coisas."}]}