{"title":"Tendências em Tecnologia para 2018 – Hipsters #77","releaseDate":"02/01/2018","tags":["Podcast","programação"],"people":["Paulo Silveira","Vitor Guerra","Roberta Arcoverde","Sérgio Lopes,","Maurício “Balboa” Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1475%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1475&t_u=https%3A%2F%2Fhipsters.tech%2Ftendencias-em-tecnologia-para-2018-hipsters-77%2F&t_e=Tend%C3%AAncias%20em%20Tecnologia%20para%202018%20%E2%80%93%20Hipsters%20%2377&t_d=Tend%C3%AAncias%20em%20Tecnologia%20para%202018%20-%20Hipsters%20%2377%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Tend%C3%AAncias%20em%20Tecnologia%20para%202018%20%E2%80%93%20Hipsters%20%2377&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Fabrício De Freitas Cunha","comment":"Escutando em Janeiro de 2019. Blockchain erraram feio! kkkkk"},{"author":"Gabriel Maia","comment":"Vim aqui pra ver se vocês acertaram! Hahahaha"},{"author":"Zé-Ninguém","comment":"Tema bastante interessante.... porém, será que a parte da inteligência artificial e os investimentos nas conversas com as máquinas não poderia ser uma tentativa inclusiva para com aqueles que leem pouco ou quase nada?Pensando do ponto de vista de dar acesso à Siri ou Google Now com comando de voz, será que essas empresas não estariam mirando numa outra fatia de mercado que ainda não estão expostas às suas marcas e/ou produtos e/ou serviços? (em torno de um ou dois meses, por exemplo, fomos apresentados por uma assistente do Google capaz de ligar a marcar compromissos, sem que a pessoa do outro lado percebesse que conversava com um computador..... não foi o Turing que disse algo da evolução chegar a tal ponto de nós mesmos não sabermos que estaríamos falando com uma máquina?)Imaginem só o quanto o mercado que já está atingindo o platô de crescimento e, consequentemente, tendendo à estagnação, o quanto poderiam crescer com novos usuários/clientes?Da mesma forma, do ponto de vista inclusivo, será que a casa conecta não poderia ser mais útil às pessoas com determinadas doenças/limitações?Seria isso muita viagem?Parabéns pelos temas de vocês....só sinto falta de um falando do PHP moderno e suas práticas e outra sobre o Vuejs. ;o)"},{"author":"Fabio Agostinho Boris","comment":"Lendo o Stack Overflow Developer Survey 2018 (https://insights.stackoverf..., me lembrei deste episódio, e voltei pra ler os comentários :)"},{"author":"Anderson Zanichelli","comment":"Vi um vídeo de um laboratório de vacinas que usa realidade virtual para que as crianças tomem a vacina sem o desespero de ser furado pela agulha!"},{"author":"Thiago Araujo","comment":"É o VR-Vacina. Projeto muito bacana! http://www.ogilvy.com.br/ca..."},{"author":"MuAH","comment":"Eu acho que a principal questão do bitcoin e a descentralização dele e não fazer a compra no seu celular, isso é só uma consequência, quando se fala em descentralização eu quero dizer que não tem o governo interferindo no valor da moeda, você tem muito mais segurança que seu dinheiro não será desvalorizado pelo governo através de impressão de dinheiro, como os governos fazem."},{"author":"Zé-Ninguém","comment":"Tem este aspecto....Mas e o Fundo Garantidor de Crédito, aquele que obriga aos bancos fazerem um depósito no Banco Central e garantir a devolução de até $250.000 por CPF em cada instituição caso o banco venha a quebrar?Moedas Virtuais não têm algo do tipo.... quebrou... quebrou! Por isso, talvez elas devam ser vistas como um \"mercado de especulação e que cada um assuma o risco.De todo o modo, seja como for, essa ideia de não termos governos e instituições do mercado financeiro por trás é algo muito interessante e lindo de ver."},{"author":"Alex","comment":"Pessoal, muito além de colocar a geladeira na Internet, a Industria tem grande interesse em IOT, em especial em diagnostico e manutenção de máquinas/equipamentos, o tema sempre foi complicado devido as perdas com equipamentos parados. No meio se fala bastante também em realidade aumentada para auxiliar na manutenção, inteligencia artificial + BIG Data em aplicações diversas, isso só tende a crescer."},{"author":"Fabricio Damazio","comment":"Pessoal, falando de frameworks, o que acham do .NET Core para 2018?Depois da versão 2.0 esta bem promissor.Open source, multiplataforma, com uma IDE igual o FREE Visual Studio Community 2017 e um editor de texto FREE igual o VSCODE, eu acho que é algo pra ficar de olho."},{"author":"Diego Saouda","comment":"O pessoal da thoughtworks lançam 2 vezes ao ano um techradar, tecnologias que eles estão usando, pretendem usar e que estão deixando de usar. Acho que vale dar uma olhada.https://www.thoughtworks.co..."},{"author":"Rafael da C. Farias","comment":"Verdade, muito bem citado, levando em consideração que é uma empresa que está praticamente no mundo inteiro o radar é algo em escala global."},{"author":"Junior Osho","comment":"Silvio Silva  Sugestão de fazer um pod sobre marketing digital, que ta mudando a maneira de divulgar os produtos a educação... e vai eleger o Bolsonaro a presidente e outras Modinhas !  Machine Learning não foi falado tbm. E sobre esse cursos online...flw"},{"author":"Silvio Silva","comment":"Parabéns pelo podcast!Gostaria apenas de chamar atenção para o movimento da Oracle com o Java.O processo que está em curso é a doação do Java EE para a Eclipse Foundation onde foi criado um novo projeto (Top Level Project) chamado EE4J (Eclipse Enterprise for Java) que está sendo apoiado pela Oracle, Red Hat, IBM, Payara e Tomitribe (entre outros).A filosofia se inverterá com o intuito de ser mais ágil priorizando a escrita de código antes e as especificações depois.As doações também incluem a implementação de referência (Glassfish) e os TCK (Technology Compatibility Kit).O trabalho está avançando e a comunidade está engajada.Mais informações podem ser obtidas no site do projeto e nas listas de discussões:FAQhttps://www.eclipse.org/ee4...Repositóriohttps://github.com/eclipse-...EE4J Status Update:\n\n\nReproduzir\n\n\n Ocultar\n\n\n\n\n"},{"author":"Bruno Anjos","comment":"Pessoal, passando por aqui apenas para agradecê-los e parabenizá-los pela existência do hipsters.tech. Acompanho vocês desde Janeiro de 2017 e de lá pra cá meu trajeto de casa >> trabalho, trabalho >> casa nunca mais foram os mesmos. Rsrs. O conteúdo é de altíssima relevância, tem sido extremamente proveitoso pra mim quanto pra quem está começando. Já indiquei para centenas de pessoas que depois voltaram para agradecer com excelentes feedbacks. Isso aí pessoal! Que mais e mais pessoas estejam igualmente dispostos em compartilhar o conhecimento com o mesmo entusiasmo e competência. Acredito que atitudes assim é que contribuem verdadeiramente para um país melhor.Valeu e um abraço à todos!"},{"author":"jallisson jallis oliveira band","comment":"Muito Bom"},{"author":"Alex Lopes","comment":"O controle de numeros de série de medicamentos contra falsificaço nos EUA está crescendo e o blockchain é uma alternativa que algumas empresas estão adotando para esse controle. E eu acho que tudo que precise controlar o numero de série vai ser uma oportunidade para blockchain."},{"author":"Wesley Soares","comment":"Vitor Guerra, para seu problema com encanamento há uma solucao que se chama walabot, custa só 100 trumps :)"},{"author":"Renato Souza","comment":"http://resolvavocemesmo.com...http://m.gizmodo.uol.com.br...NativeScript pessoal."},{"author":"Paulo","comment":"Senti falta de falarem sobre o NativeScrip, o mesmo pode ser utilizado com Angular, utiliza typescript e gera código nativo para as principais plataformas, e pelo que parece esta em crescimento continuo."},{"author":"Desv","comment":"Pelo amor de Deus, voces gostam mesmo de javascript hein, pior ainda com typescript. Só uso js no browser porque até o momento ainda sou obrigado."},{"author":"Jhonatan Petronilho","comment":"Faltou falar do Vuejs :("},{"author":"Werlesson Oliveira","comment":"Acho que faltou comentar sobre o VueJS, creio que seja o ano do VueJS."},{"author":"educoutinho","comment":"O problema dos chatbots é que eles são uma merda hoje. Ninguém quer gastar um tempão conversando com um chatbot do facebook para comprar um tenis, é melhor mesmo ter um app como o Sérgio Lopes disse.Agora pense no seguinte: Você prefere pedir uma pizza pelo telefone (ou mesmo whatsapp ou usando um app) ou vc prefere pedir para sua namorada pedir uma pizza de peperoni por você?Quando os assistentes pessoais como a Alexa entenderem o contexto (eu sempre peço pizza grande, na pizzaria X, sem refrigerante...) e a Alexa se comunicar bem comigo e se comunicar bem com a pizzaria (provavelmente elas vão precisar ter APIs para isso) vai ser lindo! Mas acho que estamos muito longe disso.Aposta para 2018 é complicado, acho dificíl surgir algo revolucionário e em um ciclo de um ano passar a ser utilizado por muitas pessoas. Se for para apostar, eu aposto que não muda nada esse ano (falando de forma geral).Acho que seria interessante fazer um episódio tentando prever algo para daqui 10 anos ou listar oq está no hype agora (tipo: Rusty, GoLang, Elixir, React, Server less) e tentar prever se isso vai continuar crescendo ou deve começar a regredir e quem pode tomar o lugar dessa tecnologia."},{"author":"Éverton","comment":"Verdade ... concordo contigo!A propósito. Obrigado por manter o blog até hoje :)"},{"author":"Geovane Fedrecheski","comment":"Sobre Realidade Aumentada / Virtual - que tal Mixed Reality? Senti falta de falarem da Magic Leap que lançou o One esses dias :)"},{"author":"Marlos","comment":"Diante de tanta coisa surgindo, de fato, Blockchain merecia apenas um episódio sobre ele. 👍"},{"author":"Maurício Linhares","comment":"Vale mesmo!"},{"author":"Ligiano Azzi","comment":"Confesso que me chamou atenção o que o Sergio Lopes comentou sobre o Angular, mas entendo que não seja uma verdade absoluta, é simplesmente a opinião dele... Da qual eu não concordo..."},{"author":"Sérgio Lopes","comment":"É, me falaram que peguei pesado. Dei uma aliviada (ou não :) esses dias no twitter: \n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\nMas é o que você falou, é opinião de um cara só :-P"},{"author":"Ligiano Azzi","comment":"Opa Sérgio! Thanks for the feedback!!"},{"author":"Desv","comment":"Angular é usado mais pelo hype, não por ser uma solução leve e eficiente."},{"author":"niccolas costa","comment":"Acho q isso é mais falado nas aplicações react."},{"author":"Desv","comment":"Ambas"},{"author":"Giorgio","comment":"Boas. tambem acho. vejo muitos projetos em cima de angular surgindo e com muita gente otima de javascript e poucas ou quase nada em React."},{"author":"Stefanie Lima","comment":"Angular morreu? Oi? Entendo que o Sergio Lopes não curte muito SPAs, mas o Angular esta vivissimo sim e com uma comunidade muito ativa."},{"author":"Giorgio","comment":"Concordo. Acho angular mais futurista que o react(parte web), apesar react native ser muito bom.Queria saber por que o Sergio teve essa posição sobre o angular.E gosto muito das palestas do Sergio. Acho assisti todas. Na parte de performace web. tento espelhar ele o tempo todo. Quem sabe ele passa uma posição dele melhor aqui para sabermos por que ele pensa isso sobre o angular, certo....E sobre Go, concordo com o Linhares, Presente-futuro do desenvolvimento backwend"},{"author":"Desv","comment":"Por mais que você goste e muitos usem por hype, Angular é pesado."},{"author":"niccolas costa","comment":"Cara vc ta falando de angular 1 ou o novo, por que o 1 realmente pode ser considerado pesado mais o novo ganha em varios aspecto de performance em teste feito só dar uma google q vc vai ver isso, perdendo apenas para VueJs."},{"author":"Desv","comment":"O 1 é pesadíssimo, >=2 pesado. Qualquer framework desse tipo pesa."},{"author":"Bruno Viscotti Zernark","comment":"Faltou um descritivo das apostas dos convidados em formato texto aqui no site.Coloquem por favor."},{"author":"Paulo Silveira","comment":"melhor não. fica muito facil de no ano que vem voces cobrarem a gente :P"},{"author":"Giorgio","comment":"Acho a plataforma Angular muito boa e produtiva.E fica tudo concentrado na plataforma, não precisa de outros frameworks como o react, como redux ou flux.Acho o Angular mais completo e menos verboso como a parte dos decorators.O Sergio Lopes não vai mesmo com a cara das SPAs.(Apesar da da maior utilização do REACT é como SPA tbem).Acho o Sergio muito fã do Jquery, mas Jquery já é passado."},{"author":"Sérgio Lopes","comment":"Não sou fã assim de jQuery não. Aliás, faz bastante tempo que não uso. Mas, sim, costumo preferir Web tradicional a SPAs.Do Angular, a opinião era mais sobre mercado. Não é um framework ruim não. Aliás tem vários frameworks bem bons por ai, melhores que React tecnicamente. Mas acho que isso não é suficiente. Escolher tecnologia infelizmente também leva em conta mercado, hype etc.\"Morreu\" ficou pesado mesmo. Quis dizer que acabaram as chances de retomar o trono dos frameworks Web. \n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n"},{"author":"Desv","comment":"jQuery é presente na maioria dos projetos em atividade. É muito mais leve e com longevidade do que essas soluções descartáveis (vide AngularJs).jQuery continua sendo suficiente para sistemas corporativos. Geralmente inventam o problema, do sistema virar \"SPA\" sem ser SPA.React é eficiente para o que ele propõe, sites com páginas contendo várias áreas independentes."},{"author":"Flavio Leite","comment":"jQuery - Old but gold!!!!Concordo 100%, por mais \"anti hipster\" que pareça, jQuery ainda é realidade no mercado e segue suprindo grande parte das necessidades, com menos peso e menos complexidade."},{"author":"Eridani Campos","comment":"Assim não dá Mauricio Linhares!!! Assim não dá...Você acha q 2018 não será o ano das criptomoedas e do blockchain... Mas será o ano do chatbots da NET!!!!HUAUHAHUAUHAssim não dá!!obs.: Comentário sarcástico, sei que ele não disse isso rs"},{"author":"Maurício Linhares","comment":"Mas sério, o chatbot da net é legalzinho. Ou era, faz tempo que não ligo pra ele hahahaha."},{"author":"Lennon Manchester","comment":"Esse ano é do BIRL language (https://birl-language.githu...  hahaha...Parabéns pelo ótimo podcast btw."},{"author":"Vinícius Tiago Tavares","comment":"sensacional!"},{"author":"Lucian Sturião","comment":"Qual tecnologia o Linhares comentou perto do final do episódio? Foi Cube base networks? não entendi muito bem..já vi ele comentar sobre em outros episódios mas n encontrei na descriçãoObrigado!"},{"author":"Caio Filipe de Moraes Rodrigue","comment":"kubernetes: https://kubernetes.io/"},{"author":"Lucian Sturião","comment":"eu entendi kubernetes mas jurava que era alguma coisa em inglês! hahavaleu"},{"author":"Max","comment":"A bateria realmente é um atraso para todos, ficamos reféns no tempo de uso....Sobre o cano eu pensei em fazer assim, tem os instaladores de  TV que passa o leitorna parede para instalar as TV’s, os instaladores passam o leitor na parede e pronto, vai te dar o mapada parede, podendo mapear toda a casa.Vi isso um dia no programa “Pequenas Empresas e Grandes Negócios, da Rede Globo”. Ai você chama e diz que vai instalar a TV, o técnico faz a leitura e assim acha.Nunca fiz, mas se eu precisar um dia vou fazer um  teste."},{"author":"Dennys Azevedo","comment":"Estou trabalhando atualmente com Golang e Graphql tá lindo *_*"},{"author":"Marcos","comment":"Eu adotei o Angular 2 (nem se fala o numero mais) bem no começo. No começo foi estranho, hoje é tão natural trabalhar no framework, que eu não sinto nem vontade de aprender React.Na minha humilde opinião Angular ainda ta na corrida. Não acho que vai voltar pro hype, mas acho q é um framework robusto, confiável e de fácil adoção pro desenvolvedor (pelo menos, pra quem está acostumado com mvc).E como minha aposta eu recomendo relembrar aquele C/C++, pq eu acho que esse vai ser o ano do WebAssembly :)"},{"author":"Vinícius Aires Barros","comment":"Lembrando também sobre do Rust que talvez se torne uma linguagem bastante promissora."},{"author":"Jaumzera","comment":"Tentei encontrar o Hipster no Spotify mas não achei. Cês não vão prá lá?"},{"author":"Paulo Silveira","comment":"nao ta tao simples! mas esta nos planos"},{"author":"Leonardo","comment":"Aproveitem e apareçam no app Deezer também. Por favor!"},{"author":"Yuri Sefrin","comment":"Os filtros do SnapChat são considerados realidade aumentada. O conceito de realidade aumentada é a sobreposição de conteúdo virtual sobre o mundo real.A grande vantagem da realidade aumentada sobre a visualização de fotos e vídeos é a sensação de tamanho e possibilidade de visualização de diversas perspectivas. A Amazon lançou um aplicativo de realidade aumentada que o usuário pode observar qualquer produto, em tamanho real, apenas com o seu celular.Outra vantagem da realidade aumentada é agregar um valor virtual a produtos reais. Produtos (xícaras, camisetas, relógios, óculos, catálogos, outdoors, panfletos) que são reconhecidos pela câmera do celular e  permitem a interação com conteúdos como: modelagens animadas, vídeos, sorteios e jogos.Caso queiram conhecer algumas aplicações de realidade virtual e aumentada desenvolvidas pela AIS - Ambientes Virtuais: http://www.ambientesvirtuai..."},{"author":"Álvaro Júnior","comment":"Tecnologia genérica: PWA, machine learning.Front: briga entre react e angular 2back: python, java"},{"author":"Feiki Dohi","comment":"2018 é o ano do linux!"},{"author":"Desv","comment":"Passaram décadas e nunca pegou, só técnico usa."},{"author":"Roberta Arcoverde","comment":"Aproveitando pra compartilhar o trabalho da nossa equipe de Data Science, com vários posts bem interessantes sobre tendências e tecnologias mais acessadas no Stack Overflow:- Crescimento recente de Python, comparado com outras linguagens: https://stackoverflow.blog/... - Mapeando tecnologias relacionadas (inclusive daqui que tirei várias informações que cito no podcast, como a influência de Machine Learning no conteúdo relacionado a Python): https://stackoverflow.blog/...Por sinal, recomendo muito todos os posts da Julia e do David, dois super data scientists, autores de um dos melhores livros de R da atualidade :)"},{"author":"Samuel T. Ferreira","comment":"Morrendo de rir com a frase \"Amazon abrindo a porta\" e me deixando trancado, kkkkkkkkkkkkkkkkkkkk"},{"author":"Oziel Alves Cavalcante","comment":"Meses depois... Fizeram um vídeo sobre isso:\n\n\nReproduzir\n\n\n Ocultar\n\n\n\n\nProgressive enhancement is the way."},{"author":"Mauricio Lassakoski","comment":"Acredito que o Blockchain continuará crescendo porem sua adoção ainda será \"limitada\" a criptomoedas. A sua adoção em outras áreas acredito que ainda vai levar um pouco mais de tempo.React continuará como líder de mercado, porem discordo que o Angular \"já era\", como foi dito. É uma plataforma muito boa e tenho visto sua adoção crescendo bastante nos últimos meses. Acho que em 2018 continuará crescendo, porem ainda continuará bem atras do React."},{"author":"Rafael Pizão","comment":"Blockchain cabe um episódio hein! :)"},{"author":"Marcos Ellys","comment":"Só ouvi muitas verdades, e concordo totalmente com as afirmações do Maurício, essa onda de IoT vai levar muitos dispositivos a ficarem obsoletas e o usuário final ser prejudicado, um caso que já ocorre e muito é o das Smart Tvs, existem muitas que após o primeiro ou segundo ano os Apps param de funcionar e ela perde a principal atração que no caso é os Apps."},{"author":"Kewyn Akshlley","comment":"E desenvolvimento mobile nativo?"},{"author":"Cleverson Lira","comment":"\"Como está a pituxa\" kkkkkkkkkkkkk."},{"author":"Wallace Souza","comment":"Minhas apostas para 2018:IA  / Machine learninglawtechsReact native(sorry! web ele não vai crescer não)TypescriptAngular 5God of war :DTeletransporte (todo ano ele entra rsrsrs)"},{"author":"Evandro Teixeira","comment":"Eu também não acredito que 2018 seja o ano do IoT. Mas fato que bastante empresa de tecnologia estão cada vez mais investindo nesta área. Principalmente empresa fabricantes de semi-condutores. Que nos últimos anos aconteceram diversas fusões e aquisições exemplo; NXP (antiga divisão de semicondutores da Philips) adquirindo a Freescale (antiga divisão de semi-condutores da Motorola) e em seguida foi adquirida pela Qualcomm, outra aquisição que chamou muita atenção no final do ultimo ano foi aquisição do FreeRTOS pela Amazon, também visando o mercado de IoT.Outra vertente do IoT que vem crescendo é o IIoT ou Industria 4.0, a empresa que vem se destacando nesta área é a GE. Segue o link do nerdcast onde debatido este tema.https://jovemnerd.com.br/?p...https://aws.amazon.com/pt/f...https://sergioprado.org/o-f...https://www.embarcados.com...."},{"author":"Gabriel Darezzo","comment":"Ps:Acabei de ver a 4° Temp. de Black Mirror"},{"author":"Jéssica Nathany","comment":"tem coisas que eu acho que quando aplicada tecnologia, se torna um exagero. Por exemplo, supermercado do futuro, onde vc não pega os produtos, seleciona todos em um tablet e retira tudo no final do caixa. Eu acho isso, na minha opinião desnecessário. Mas enfim.."},{"author":"Gabriel Darezzo","comment":"Tem toda uma questão de logística por trás.Ex: Você já viu algum produto no chão?Então.. isso é gasto.De qualquer forma é um tempo perdido ir fazer compras na minha opinião. (Para alguns produtos)Aposto q esses aplicativos de mercados com (%) de desconto é um 'aprendizado' para a massa utilizar no futuro pelo menos compras recorrentes.Imagina o tanto de gasto que poderia ser evitado se 100%  do super mercado pudesse ser autônoma.Da uma olhadinha em um exemplo:https://welcome.homerefill...."},{"author":"Jéssica Nathany","comment":"Gabriel eu vi esse app achei fantastico, poupa mto tempo mesmo esse acho bacana. Mas digo a parte de vc pegar os produtos, ex eu gosto de cozinhar quando vou ao mercado na sessão de hort gosto de pegar os legumes/frutas e senti-los, alguns outros produtos tbm. Agora usar um app para compras bem bacana, dependendo do caso da pra utilizar o tempo do mercado para outras coisas. =)"},{"author":"Rafael Gimenes Leite","comment":"IOT na casa ainda é tranquilo, mas na industria é muito complicado, por se contar de redes industriais nem todos dispositivos tem internet e outras redes já são usadas como LORA."},{"author":"Fernando Boaglio","comment":"Eu acho que além do Hipsters e Like a boss e parcerias do Jovem Nerd,  teremos novos branchs... \"Na cozinha com Maurício Linhares\" talvez kkk, \"Desiludindo frameworks\" com Sérgio Lopes =)"},{"author":"Mauricio Silvestre","comment":"Se alguém tiver afim de explicar, gostaria de entender uma necessidade realmente real para eu mudar do Angular para o React. Pensando em apps normais, cadastros, etc... eu sinto que o Angular não me atrapalha em nada. Desde já obrigado."},{"author":"Wallace Souza","comment":"Pois é! muito dos que migraram do angular 1.x para o react foi porque o angular 2.X \"quebrou\" toda a forma de pensar de um framework para outro. O problema que eles não falam que o react tem um curva tão alta quanto o angular 2.X (se não pior)"},{"author":"Fernando Henriques","comment":"Isso é verdade. O paradigma reativo é novidade para a maioria do mercado ainda."},{"author":"Desv","comment":"Na verdade não existe a necessidade para a maioria. Maioria não são toy apps como facebook, nem SPA como gmail, etc."},{"author":"Maurício Linhares","comment":"Nenhuma, se tá resolvendo o seu problema tá bom demais já :D"},{"author":"Lauren Ferreira","comment":"Excelente podcast, como sempre!Em relação a frameworks/libraries de Javascript para o front-end, concordo que seja o ano de consolidação do React. No entanto, concordo também com o pessoal que tá apostando no Vue.JS.Tenho lido vários artigos em que diversas empresas migraram do Angular 1 ou 2 direto para o Vue.JS, mesmo considerando o React como opção. Alguns dos motivos foram relacionados à curva de aprendizado, simplicidade e performance.Pode até ser o ano de consolidação do React, mas o Vue.JS tem muito a crescer e amadurecer esse ano.Edit.: Taí um bom tema para um podcast futuro, hein?"},{"author":"rodolfocastanho","comment":"Eu gosto do EmberJS... Só não sei se tem futuro. Tem horas que me dá uma impressão de que vai morrer a qualquer hora!!!"},{"author":"Desv","comment":"Todos esses frameworks da moda aparecem e desaparecem a todo momento. Só tenho segurança em usar jquery, o resto passo longe. Até o Angular teve que ser refeito, com quebra de compatibilidade."},{"author":"Fernando","comment":"Excelente episódio como sempre, gostaria de colocar aqui algumas anotações que fiz enquanto estava na palestra \"Global Trends for Startups\" do Adeo Ressi (CEO do Founder Institute) na CASE 2017. Para ele as grandes tendências (não somente em tecnologia) seriam:1) Blockchain substituindo sistemas centralizados por governos.2) Holocracia - As pessoas não trabalharão mais para você e sim com você (muitas coisas mudarão nas relações de trabalho)3) Freelances serão mais adotados do que o trabalho convencional, para ele as pessoas estão em busca de um propósito e elas irão trabalhar com você pelo tempo necessário para atingir aquele objetivo4) A educação online terá um papel muito mais importante para as pessoas do que a forma de educação tradicional das escolas.5) Social media continuará crescendo e substituindo a mídia tradicional6) Metodologias de validação de negócios e idéias serão mais importantes do que a forma tradicional de confiança em um cargo específico.7) Startups terão um espaço cada vez maior na sociedade, pressionando assim as grandes corporações.E por ultimo, o senso de comunidade vai ser cada vez maior nas pessoas US > YOU.Concordo muito com os pontos que ele apresentou, e acrescentando minha opnião como backend, assim como o Linhares, estou super apostando em Kubernetes e Go."},{"author":"Fernando","comment":"Esse comentário foi apagado."},{"author":"Fernando","comment":"Oi @jrzbraga, obrigado pela sua opnião, sempre muito debater e não aceitar apenas um lado da moeda.Gostaria de ressaltar que esses foram os tópicos que o Adeo passou em sua palestra sobre as tendências que ele tem visto acontecer atualmente ao redor do mundo e não somente previsões aleatórias sobre o futuro. Outro ponto, que talvez seja falha minha não ter deixado claro, é que ele não classificou essas tendencias com um prazo de apenas 365 dias, e sim como algo que vem ocorrendo gradativamente ao longo dos anos.Vamos lá:1) Eu tenho uma visão (talvez utópica) que o governo é um reflexo da sociedade na qual ele esta inserido, então eu acredito sim que podemos mudar a sociedade com atitudes positivas e bons planos a ponto de mudarmos o cenário no qual estamos inseridos. Outro ponto legal de ressaltar é que países como a Finlândia já estão utilizando blockchain em cenários reais (e que não são criptomoedas) - \n\n\nReproduzir\n\n\n Ocultar\n\n\n\n\n2) Eu acredito sim que as pessoas tem capacidade de estabelecer relações de trabalho melhores sem ser essa rigída relação que você comentou.3) Pode comentar cara, gostaria de saber sua opnião4) Pode comentar sua dùvida.5 e 7) Não disse que o cara era visionario, mas acredito que por mais obvio que pareça, são pontos relevantes.Abraços"},{"author":"Fernando Ferreira","comment":"Muito bom começar o ano bem informado. Gostaria de adicionar algo na discussão sobre a adoção de Podcasts no Brasil. Algo que eu vejo que facilita a escuta de Podcasts é que quem utiliza a iPhone já tem uma plataforma nativa para isso (iTunes). E como o iPhone é bem mais acessivel no mercado americano, isso falicita para quem quer ouvir podcasts."}]}