{"title":"Javascript: Ember.js – Hipsters #78","releaseDate":"09/01/2018","tags":["front-end","Podcast","programação"],"people":["Paulo Silveira","Leonardo Andreucci","Anna Flavia Camargo","Renato Zannon","Sérgio Lopes"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1508%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1508&t_u=https%3A%2F%2Fhipsters.tech%2Fjavascript-ember-js-hipsters-78%2F&t_e=Javascript%3A%20Ember.js%20%E2%80%93%20Hipsters%20%2378&t_d=Javascript%3A%20Ember.js%20-%20Hipsters%20%2378%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Javascript%3A%20Ember.js%20%E2%80%93%20Hipsters%20%2378&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Gaspar Barancelli","comment":"Desv você que é o bichão. Me diga ai como que esta o uso do Ember no mercado e do Angular hoje em dia."},{"author":"Tiago Lima","comment":"Galera, muito bom o podcast,Tenho uma dúvida,Ember foi descontinuado?Um abraço."},{"author":"Clairton Rodrigo Heinzen","comment":"Oi Tiago, não foi descontinuado não.Continua progredindo utilizando o conceito de estabilidade sem estagnação, esta na versão 3.X."},{"author":"Tiago Lima","comment":"Showw, é que aqui usamos Ember, eu estava com esta dúvida,...obrigado pelo retorno...um abração."},{"author":"Matheus","comment":"só falta falar sobre o vue.js em .."},{"author":"Tiago Aguiar Moreira","comment":"Já tinha visto o logo do EmberJs por aí, mas nunca me atentei. A primeira vez que soube algo a respeito.Galera, não tem haver com o episódio, mas tem haver com o Hipsters! Alguém pode me explicar o que significa o termo \"Rocket Science\" que o Paulo S. fala de vez em quando? Não sei se escrevi direito, mas é o que entendi rs.Concordo com o Romulo Assis. Seria muito legal um episódio sobre VueJS!"},{"author":"Marcos","comment":"\"Rocket Science\" traduz literalmente pra ciência de foguetes. Geralmente é usado pra demonstrar que algo é muito complexo. E quando alguém fala que uma coisa não é \"rocket science\", significa que é difícil mas nem tanto que não de pra aprender se você encarar de frente."},{"author":"André Luiz Leoni","comment":"Não conhecia o ember, achei bacana o feedback de vocês, mais uma vez, obrigado hipsters, e por favor, NÃO PAREM! kkk"},{"author":"Romulo Assis","comment":"Ainda não vi um EP falando sobre VueJs. Mais que merecido ele ter um espaço de destaque, já que hoje é o grande concorrente do React, apesar desse dominar o mercado.Eu por exemplo, não troco o VueJs por outro framework (não agora), justamente pela sua simplicidade/eficiência."},{"author":"Paulo Silveira","comment":"teremos! é que vamos espaçando. se fossemos ter de todos os de frameowrks JS juntos, ia ficar um ano só neles hehehe"},{"author":"Michel Fernandes","comment":"Uau, vc responde aos comentários! Awesome. :)"},{"author":"Desv","comment":"Back-end processando e entregando a view pronta (Spring/ASP.NET MVC) + jquery para ajax é a opção mais prática e segura mantida na maioria dos casos em sistemas corporativos. Tem muita gente que inventa da aplicação ser 'SPA' sem ser SPA, só pra brincar com as modinhas que aparecem a cada estacão do ano, sem nunca ter segurança de qual escolher para ter longevidade (vide a descontinuidade do código AngularJs 1.x)."},{"author":"richellyitalo","comment":"O melhor framework é aquele que funciona na sua mão!"},{"author":"Marcos","comment":"Meu preferido ainda é o Angular (versão nova). Hoje eu prefiro desenvolver o client inteiro em angular e plugar numa API.Mas, como eu tenho background em .NET, confesso que quando eu preciso fazer algo rápido e menos bonito (ou menos orientado ao front-end) eu uso o angularjs ou até o jQueryzão da massa. Pra esse papel hoje eu consideraria o Vue (=== angular 1.x) como opção.Eu sinto que a comunidade investiu muito em react e hoje nós não temos um ecossistema tão rico pra paginas que não precisam desse poder todo, sem ter que \"matar mosca com tiro de canhão\". Não encontro mais os componentes bonitos e atualizados e simples de usar em paginas especificas, como na época do rei jQuery.Meu dilema hoje é o que eu uso em Landing Pages, ou em sistemas em que o backend renderiza a view, ou em sistemas legado."},{"author":"Éverton","comment":"As vezes penso que o KnockoutJs ainda é uma boa opção, visto os problemas que cada framework apresenta."},{"author":"Desv","comment":"Nao uso esses frameworks, mas realmente KnockoutJs é o menos pior deles, por não inventar muito. Problema que a maioria gosta de coisas complexas e pesadas, como Angular, etc."},{"author":"Éverton","comment":"Pessoal ai do Podcast poderia ao menos falar uma coisinha bem rapidinha dele ... pelo fato de não inventar tanta moda."},{"author":"Desv","comment":"Sim, pelo menos pela importância que teve no inicio de toda essa historia desses frameworks Js. Ainda mais por seguir MVVM, mais produtivo que MVC."},{"author":"Bruno Tomé","comment":"Boa, rola um sobre Vue também em, empresas como Hotmart e o framework Laravel o adotam."},{"author":"Wolmir Garbin","comment":"Achei os convidados um pouco despreparados para falar sobre o Angular, conheço ember.js e acho sua sintaxe de escrita de html ruim comparada a todos os outros frameworks similares do mercado."},{"author":"Gaspar Barancelli","comment":"Realmente Wolmir eu tenho a mesma opnião que você, a sintaxe do Ember comparada aos outros frameworks é bem ruim.Sobre o Angular acho que o Google fez uma \"cagada\" ao escolher o nome do seu novo framework, se tivessem dado qualquer outro nome para o Angular.io não teria todo esse bla bla bla dos desenvolvedores, até ajudaria na busca por conteúdo no proprio Google kkkk O que o pessoal precisa saber é que AngularJS é diferente de Angular.io. AngularJS ainda continua em desenvolvimento, pode ver os commits no github, mas o novo framework é o Angular.io e o mesmo  já está na versão 5.2 e tem um road map para a versão 6 em março de 2018 e a sua versão 7 para  setembro de 2018. Então o povo que tem \"medo\" de utilizar Angular.io no desenvolvimento de um novo software, com desculpa de que o Google vai lançar uma nova versão do framework e que a mesma não será mais compativel, pode ficar tranquilo que isso não vai acontecer."},{"author":"Desv","comment":"Tao ruim e intrusivo quanto Angular. Só muda a maneira de fazer, sendo que você deve ser mais acostumado com Angular."},{"author":"Giorgio","comment":"A nova versão do Angular está muito boa, rápida e evoluindo muito rápido. E super rápido com técnicas de LazyLoading e Angular Universal. Precisa só conhecer a ferramenta para saber disso.E como falam, a melhor framework é aquele que voce conhece bem.Não adianta fazer um hello world, e tirar conclusões sem conhecer a fundo.São os novos tempos, libs para somente se virar nos 30, manipulando DOM como JQUERY já faz parte do passado."},{"author":"Desv","comment":"Nao faz parte do passado, a biblioteca jquery é presente na maioria dos projetos em atividade, que não fingem ser SPA para seguir modinha. O que diminuiu foi que nao é mais necessário usar jquery pra tudo, muito menos frameworks pesados e intrusivos no HTML. Hoje em dia muita coisa pode ser feita tranquilamente em javascript puro sem problemas de compatibilidades entre navegadores e com a mesma produtividade do jquery. DOM é a realidade do browser, quanto mais controle melhor. Exceto quem nao sabe programar e precisa de frameworks que retiram o DOM da mao do programador.\"LazyLoading\" e \"Angular Universal\" nao sao técnicas, sao gorduras adicionais que você optou usar por carregar a ferramenta Angular no client. Esse excesso de engenharia só vai pesar mais no processamento do browser do usuário, por voce nao saber programar em javascript diretamente."},{"author":"Filipe Bragança","comment":"poderia explicar a que se refere \"sintaxe de escrita de html ruim\"? porque escrita de html no ember, via handlebars/glimmer é puramente html mesmo"},{"author":"Wolmir Garbin","comment":"É por conta da sintaxe mesmo, por exemplo em uma ação de click, precisa escrever {{action \"toggleBody\"}}, já no vue.js por exemplo basta adicionar @click=\"toggleBody\", no Angular (click)=\"toggleBody\" e no React onClick={toggleBody}.Enfatizo que é minha opnião pessoal, posso estar errado em comentar e peço desculpas se me expressei mal, mas eu realmente acho a sintaxe ruim comparado aos demais frameworks, não é que não goste de ember."},{"author":"Desv","comment":"O Vue tudo bem, não faz feio, mas tanto Ember quanto Angular sao bem esquisitos na sintaxe, click entre parenteses é bizarro também. Pra mim o mais claro mesmo é onclick=\"funcao()\". Como o colega falou abaixo, é questão de gosto."},{"author":"Filipe Bragança","comment":"Entendi, questão de gosto mesmo então :)"},{"author":"Paulo Silveira","comment":"o preparo deles era mesmo pra falar de embrer :). mas teremos ainda um de angular"},{"author":"Wolmir Garbin","comment":"Tranquilo Paulo, só não gostei que usaram a desculpa de sempre, que o angular mudou totalmente da versão 1 para o 2, isso já não é mais desculpa kkk no mais foi ótimo! Mas ainda assim não gosto da sintaxe do ember kkkk"},{"author":"Desv","comment":"Nao é desculpa, em empresas sérias isso se chama falta de confiança, retrabalho, dinheiro jogado fora."},{"author":"Wolmir Garbin","comment":"Em minha opnião foi um erro do google em ter mantido o mesmo nome para os dois frameworks (Angular Js (https://angularjs.org) e Angular(https://angular.io)) mas acredito que sendo uma pessoa inteligente você entende que são dois frameworks, com ideias e principios diferentes, mas algumas pessoas sem essa informação podem usar isso como desculpa sim."},{"author":"Desv","comment":"Creio que a maioria saiba, pois AngularJs foi tao mal projetado que obrigatoriamente tiveram que escrever outro framework.Mas não foi um erro terem mantido praticamente o mesmo nome (retirando só Js). Aproveitaram a popularidade do nome, por muitos terem ido na onda do AngularJs 1.x. Geralmente entusiastas, não quem lida mais com o Negócio."},{"author":"Gaspar Barancelli","comment":"Percebi que você não conhece nem um pouco da história de como começou o desenvolvimento do AngularJs. Faça um favor para você mesmo e tire alguns minutinhos e faça uma pesquisa no Google sobre os frameworks antes de comentar tanta asneira.Como você mesmo disse você acha que o AngularJs foi tão mal projetado que deve que ser reescrito, assim como o JodaTime que foi a base para a JSR 310, bem como o Hibernate para especificação JSR 338. Tudo evolui meu nobre, veja quantos frameworks js são desenvolvidos e melhorados com o tempo, acredito que seja uma prepotencia de sua parte simplementes dizer que o Angular não presta. Gostaria de deixar bem claro que no meu dia a dia de trabalho eu utilizo as ferramentas conforme necessidade, temos inúmeros projetos aqui na empresa e em várias tecnologias, Jquery, Vue, AngularJs, Angular5, Jsf, React, Ember, cada um atende uma necessidade, agora você falar tanta besteira assim do Angular, sendo que somente o Google tem mais de 1600 projetos utilizando esse framework, acredito que você deve ir trabalhar no Google como um engenheiro ou arquiteto e fazer uma revolução la dentro, migrar todos projetos de Angular par o DesvJs.[]s"},{"author":"Desv","comment":"Nao conseguiram evoluir, tanto que tiveram que criar um novo projeto totalmente diferente. Isso é fato."}]}