{"title":"Telefonia, Asterisk e Voip – Hipsters #79","releaseDate":"16/01/2018","tags":["Podcast"],"people":["Evandro Saroka","Dov Bigio","Tiago Tawil","Thiago Fernandes"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1526%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1526&t_u=https%3A%2F%2Fhipsters.tech%2Ftelefonia-asterisk-e-voip-hipsters-79%2F&t_e=Telefonia%2C%20Asterisk%20e%20Voip%20%E2%80%93%20Hipsters%20%2379&t_d=Telefonia%2C%20Asterisk%20e%20Voip%20-%20Hipsters%20%2379%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Telefonia%2C%20Asterisk%20e%20Voip%20%E2%80%93%20Hipsters%20%2379&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Gedson Junior","comment":"Onde trabalho a ura tem reconhecimento de voz. Depois de alguns atendimentos o sistema associa a voz do cliente com o contato registrado no CRM, para evitar de ter q fazer positivações com frequência. Sabem como funciona esse sistema?"},{"author":"Carlos Junior","comment":"Opa , tudo bem Gedson...  Esse reconhecimento de voz se chama ASR , a AWS oferece isso como serviço que se não me engano  se chama \"LEX\" e parece ser bem tranquilo de implementar. Fora a AWS existe a \"Nuance\" (multinacional pioneira nesse segmento)  que também implementa  , e no Brasil existe também a CPQD ,empresa incubada em Campinas que tem obtido ótimos resultados ...  os preços são um pouco salgados para contratação com ambos e o projeto precisa ser muito vantajoso,  na AWS  a gente consegue explorar um pouco mais sem estourar o cartão de crédito.Nunca trabalhei nesse modelo de associar um som a um cliente, sempre trabalho com reconhecimento de voz para  automatizar atendimento mas imagino que seja na mesma linha...  no final  tudo é bit e byte."},{"author":"Gedson Junior","comment":"Show! Acredito que a tendência agora é cada vez mais ser usado esse tipo de serviço."},{"author":"Márcio","comment":"Galera, programo em PHP usando o XAMPP, mas sempre que termino a programação (rodando liso em minha máquina), faço o upload para o servidor final e... Bugs infinitos. Ai mais alguns dias corrigindo.Existe alguma alternativa (Não muito avançada :) para esse problema?Vi que na hospedagem da Umbler é a feature mais votado e mais antiga, um ambiente de teste exatamente igual ao de produção.Alguém tem alguma dica?"},{"author":"Carlos Junior","comment":"Olá Márcio , eu sugiro fortemente que você pesquise sobre contêiners  (docker)  tem até um podcast aqui no hipsters sobre isso , você baixa um docker Linux a sua escolha já  pronto com Apache ou NGinx que simula um ambiente mais próximo ao  de produção.Essa solução veio para  acabar com o problema de  \" na minha máquina funciona.\"."},{"author":"Márcio","comment":"Muito obrigado, Carlos!Estou pesquisando agora mesmo sobre o assunto.Abraços!"},{"author":"Paulo Eduardo Fagundes Santos","comment":"Tenho uma sugestão Desenvolvimento de Jogos!! Game Designer, Linguagens, Engines, O que é melhor Unity ou Unreal, Dev de Jogos no Brasil.Pode ser???"},{"author":"Tiago Aguiar Moreira","comment":"Indiquei a empresa para um amigo que está procurando uma nova oportunidade, mas ele olhou no Hipsters Jobs e não achou nenhuma vaga para a empresa Teravoz. Acabei de conferir e realmente não tem. Será que já preencheram as vagas que precisavam?"},{"author":"Tiago Aguiar Moreira","comment":"Esse comentário foi apagado."},{"author":"Tiago Aguiar Moreira","comment":"Legal! Muito obrigado pela atenção."},{"author":"Andre Rozenbaum","comment":"Ainda estamos com muitas vagas abertashttps://teravoz.com.br/jobs..."},{"author":"Angelo de Barros Delphini","comment":"Parabéns pelo bate papo, sobre Asterisk Framework. Gostei muito da objetividade das informações. Sou professor de Asterisk Framework desde 2001. O que vejo é que cada vez mais necessitamos de desenvolvedores com ótimo grau de capacitação para atender as demandas das empresas que estão neste campo, que é a Teleinformática. Sou desde 2010, CAO (Chief Academic Officer) da Fundação Asterisk Libre, e temos como finalidade capacitar profissionais para o mercado. Desde 2015 ministro aulas sobre Asterisk Framework no CT Novatec. Mais uma vez parabéns pelo exelente bate papo! Valeu!"},{"author":"Marcelo Brantes","comment":"Podia ter focado mais no Asterisk em si. O podcast acabou sendo muito focado em como a solução da Teravoz funciona, ao invés de focar em todo potencial que o Asterisk tem. A questão da URA, por exemplo, é possível fazer muita coisa bacana com Asterisk (inclusive via interface web, simples e fácil). Ouvindo o podcast não dá pra entender de fato o potencial que o Asterisk tem, como uma solução open source, sem qualquer custo direto, e com dezenas de recursos e funcionalidades."},{"author":"Paulo Silveira","comment":"oi Marelo. Achei que ficaria muito pesado entrar só no asterisk, ja que poucos conhecem URA, PABX e como telefonia funciona. Alias, era o meu caso. Mas merece sim um episodio so sobre os recursos"}]}