{"title":"Gestão com Management 3.0 – Hipsters #80","releaseDate":"23/01/2018","tags":["agilidade","business","Podcast"],"people":["Paulo Silveira","André Faria","Simone Pittner","Maurício “Balboa” Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1548%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1548&t_u=https%3A%2F%2Fhipsters.tech%2Fgestao-com-management-3-0%2F&t_e=Gest%C3%A3o%20com%20Management%203.0%20%E2%80%93%20Hipsters%20%2380&t_d=Gest%C3%A3o%20com%20Management%203.0%20-%20Hipsters%20%2380%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Gest%C3%A3o%20com%20Management%203.0%20%E2%80%93%20Hipsters%20%2380&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Lucas Palma Stabile","comment":"A parte sobre motivadores achei bem interessante, acho que caio na parte que preferiria o \"comando e controle\". Não sei se é devido a onde trabalhei que pouca coisa era definida (pelo menos no quesito técnico, de como seria implementado) mas se houvesse algum planejamento na implementação, acredito que trabalharia mais motivado."},{"author":"Igor Leite","comment":"Boa semana a todos! Muito bom o podcast...O desafio é o seguinte... quais experiências e cases de sucesso obtidos até o momento no setor público com essa filosofia?Alinhar os limites da qualidade e da liberdade em um ambiente de alta necessidade de auditoria e controle como também uma cultura diferenciada que o \"lucro\" é valor agregado para sociedade.Abraços!"},{"author":"Nathan Tomaz","comment":"correção: o \"lucro\" é para bancar politico, sociedade n vê nda"},{"author":"Iury Christmas","comment":"Gostei bastante do episódio, e além disso gostaria de fazer um pedido, será que rolaria um podcast falando sobre FDD? Só se der, não der, a amizade é a mesma rs"},{"author":"Arthur Moro","comment":"Qual o nome do autor do livro que a Simone comenta? :)"},{"author":"Bruno Costa","comment":"Como eu apresento isso para quem é acima de mim hierarquicamente na empresa? A empresa que trabalho é pequena."},{"author":"Paulo Nasciemento","comment":"Eu comecei a conhecer o Management 3.0 através do livro \"Reinventando as Organizações\", que fala sobre a implementação da autogestão. Esse tema é muito interessante e vai ser usado cada vez mais.Parabéns ao Hipsters Ponto Tech pelo episódio! 👏👏👏"},{"author":"Vagner Santos","comment":"O episódio ficou show! Passou por vários aspectos do management  3.0 de forma muito leve e, ao mesmo tempo, ampla."}]}