{"title":"Primeiros passos com Devops – Hipsters #81","releaseDate":"30/01/2018","tags":["devops","infraestrutura","Podcast","programação"],"people":["Paulo Silveira","Danilo Sato","Maurício “Balboa” Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1571%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1571&t_u=https%3A%2F%2Fhipsters.tech%2Fprimeiros-passos-com-devops-hipsters-81%2F&t_e=Primeiros%20passos%20com%20Devops%20%E2%80%93%20Hipsters%20%2381&t_d=Primeiros%20passos%20com%20Devops%20-%20Hipsters%20%2381%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Primeiros%20passos%20com%20Devops%20%E2%80%93%20Hipsters%20%2381&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Anderson Irani","comment":"Show esse tema e também a discussão. Vai me ajudar bastante na empresa. Tem desconto pra ouvintes assiduos do Podcast no livro do Danilo Sato?"},{"author":"Bruno Santana","comment":"Estou iniciando agora o entendimento nesta filosofia, e este podcast me ajudou muito. Parabéns a todos  os participantes e agora estou acompanhado o hipsters.Parabens"},{"author":"Allan Luiz","comment":"Muito boa a discussão me ajudou muito obrigado galera. Só uma coisa tira esse barulho no meio da conversa ou muda, escuto no volume normal mesmo assim é insuportável esse barulho levo sempre um susto!!! vlw"},{"author":"Daniel Araújo","comment":"Excelente! Trabalho mantendo um sistema legado, desktop. Percebi através do podcast que posso utilizar algumas práticas para melhorar as entregas do produto."},{"author":"isweluiz","comment":"Fodaaaas! Ótimo bate-papo."},{"author":"Leandro Silva","comment":"De certa maneira, pensar em colocar código bom em produção logo não é ruim, mas isso representa o final do processo da cultura DevOps. Trabalhar um pouco a comunicação, colaboração e a integração entre as áreas de desenvolvimento e operações de TI levará um resultado mais consistente. Se terminarem com os plantões, salas cheias para planejar a subida de uma release e diminuir ou extinguir os rollbacks infernais, já estaremos no caminho certo, em qualquer empresa."},{"author":"Lucas Gomes de Oliveira","comment":"Baixando aqui... bem ansioso para ouvir, DevOps era um tema que que estava esperando pra ouvir,gostaria de sugerir um tema pra um futuro podcast, O que acham de conversar sobre \"HADOOP\" ?"},{"author":"Toriyama","comment":"Seria melhor se colocassem uma breve explicação do tema aqui na publicação do post. O hoje utilizado \"Mas o que exatamente é Devops? De onde surgiu e para o que serve?\" não diz nada. Se tivessem uma breve explicação com certeza seria mais interessante para quem está só passando pelo site."},{"author":"Paulo Silveira","comment":"é verdade. seria interessante ter nao só uma descricao melhor mas os links mais organizados (nesse episodio em particular os links estão todos ai). mas é um trabalgo ainda maior de publicacao. chegaremos la"},{"author":"Toriyama","comment":"Olá, Paulo. Não que deixar o visitante do site curioso seja ruim, é até bom, mas acho que para o público que não seja da nossa área de TI, não funciona tão bem, não sei.Parabéns pelo trabalho.Se puderem um dia fazerem um Podcast sobre Microsoft SharePoint, será ótimo.Abraços!"},{"author":"Franklin Matos Bourguignon Lim","comment":"Muito maneiro !Eu acharia legal um episodio sobre Vue Js."},{"author":"Anderson Guimarães","comment":"Não sei se já era planejado esse tema, mas parece que atenderam meu pedido de alguns episódios atrás.Muito Obrigado!Excelente episódio."},{"author":"Matheus Palma","comment":"Great ! Devops is awesome !"},{"author":"Klaus Santos","comment":"Apoio um sobre Front End. Fera demais, muito bom os conteúdos."},{"author":"Matheus","comment":"Excelente !! eu fico escutando todo dia no busão vocês são foda ♥ ...o bom que sempre tem coisa nova *-* gostaria de um episodio falando da profissão front-end engineer seria muito massa !!"},{"author":"Bruno Póvoa","comment":"Sugiro um episódio sobre plataformas Low-Code como OutSystems. Já que elas se encaixam perfeitamente em culturas ágeis e DevOps, estão com crescimento acelerado fora do Brasil e iniciando no mercado interno, principalmente com a alta demanda de softwares, com equipes pequenas e alterações frequentes. Conseguem reduzir drasticamente o \"time to market\" das aplicações, inclusive mobile. No Gartner são chamadas de High-Productivity Application Platforma as a Service https://www.outsystems.com/...."},{"author":"Julio Saito","comment":"Muito bom esse episódio, dois dos melhores do mundo no assunto."},{"author":"Augusto Santos","comment":"Excelente tema, pronto pra ouvir na madruga aqui kkk"}]}