{"title":"Programar sem enxergar – Hipsters #82","releaseDate":"06/02/2018","tags":["Podcast"],"people":["Paulo Silveira","Alexandre Costa","Sara Marques","Marlon Sousa"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1586%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1586&t_u=https%3A%2F%2Fhipsters.tech%2Fprogramar-sem-enxergar-hipsters-82%2F&t_e=Programar%20sem%20enxergar%20%E2%80%93%20Hipsters%20%2382&t_d=Programar%20sem%20enxergar%20-%20Hipsters%20%2382%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Programar%20sem%20enxergar%20%E2%80%93%20Hipsters%20%2382&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Juliana Fernandes","comment":"Pessoal, muito legal esse podcast! Inclusive, todos os podcasts são super interessantes. Considerem fazer a transcrição dos áudios para que pessoas surdas consigam aproveitar também :)"},{"author":"Edson Carli","comment":"Sensacional este episódio, adorei o final com eles codificando. Muito legal, deu pra entender bem como é."},{"author":"germanovski","comment":"Caras, que louco o final desse podcast! Muito interessante mesmo saber como os deficientes visuais lidam com a programação. Achei muito massa, sério! Parabéns pelo podcast, galera, foi super esclarecedor!"},{"author":"Gustavo Gonçalves","comment":"Parabéns! Excelente cast"},{"author":"Tiago Aguiar Moreira","comment":"Excelente!!! Essa galera está de parabéns pela determinação. Tem muita gente que não tem qualquer tipo de deficiência física e não faz a metade do que esses convidados fazem no seu dia a dia. O que realmente importa é a força de vontade! Serve de exemplo para todos, com deficiência ou não. Parabéns!"},{"author":"educoutinho","comment":"Parabéns! Episódio excelente! Impressionante a profundidade que o tema foi abordado."},{"author":"Lucas Boeing Scarduelli","comment":"Cara, que podcast fod***!! Primeiramente parabéns a todos os profissionais cegos e dedicados como estes!! Segundamente, um dos melhores podcasts que já escutei, todo desenvolvedor deveria escutar, faz vocês abrir a mente para coisas corriqueiras que acabam passando batido e que ajudam muito, não só aos cegos mas a qualquer desenvolvedor.Gostei muito da parte que falam sobre o valor dos testes unitários, é uma abordagem que muitas vezes fica esquecida na hora de defender a utilização deles!! Muito bom mesmo, parabéns a todos!"},{"author":"liviagabos","comment":"Pessoal, esse é o link para o podcast que citaram no programa? https://www.blindtec.com.br..."},{"author":"Marcio Formiga","comment":"Excelente ideia e execução! Meus fortes parabéns pra esses profissionais!"},{"author":"Glaucyany Lira da Cruz","comment":"Parabéns ao pessoal do hipsters!!! Sou albina,  tenho baixa visão e sei como é difícil programar assim, mas não é impossível!!!"},{"author":"Marcos Ferreira","comment":"Fantástico! O conteúdo e a qualidade foram tão bons quanto todos os outros.Mas o final foi extraordinário. Ouvir o live coding foi uma experiência incrível, a maneira como os participantes descreviam suas linhas de raciocínio e interagiam para resolver o problema foi lindo :)Mereceria até um spin-off do Hypsters somente com sessões de live coding. Narrada apenas pelos participantes ou com a ajuda de um sintetizador de voz."},{"author":"Fernando Boaglio","comment":"Excelente podcast,a parte final é o melhor. Eu tive um aluno com deficiência visual que tinha uma memória fantástica. Eu encontrei esse aluno meses depois fazendo outro curso, aí ele me falou:  \"lembra Fernando que você disse que...\" aí ele repetiu 5 minutos exatamente do que eu tinha falado palavra por palavra, e eu fiquei ali parado com cara de besta, se pedisse para eu repetir acho que não faria igual kkk"},{"author":"Maicon Carraro","comment":"O repositório está aqui pra quem tiver curiosidade: https://github.com/magoolat..."},{"author":"Cleber Pereira","comment":"Perfeito esse  episódio!Parabéns..."},{"author":"Guilherme Almeida","comment":"Sem palavras! Melhor podcast!"},{"author":"Renato R. R. de Oliveira","comment":"É a primeira vez que comento no Hipster. Esse número foi simplesmente sensacional.Sou programador e atualmente professor na área de Ciência da Computação e também tenho deficiência visual. Enxergo com baixa visão de um olho e utilizo ferramentas como lupas e outras de ampliação.O maior medo na minha carreira até o dia de hoje era a possibilidade de eu perder a pouca visão que tenho hoje e não conseguir mais exercer a minha profissão. Depois desse podcast é como se uma mochila tivesse sido retirada das costas de saber que é possível continuar apesar de tudo!Muito obrigado à todos os participantes desse podcast =)"},{"author":"Itacir Pompeu","comment":"Meu Odin amaado..estou maravilhado com esses mitos, como sou um programador fraco.do caralho isso viu"},{"author":"Nelson Henrique","comment":"Sensacional!! Uma das coisas mais curiosas foi saber que os testes unitários agregam bastante no quesito acessibilidade. Parabéns pelo episódio."},{"author":"Denilson Carvalho","comment":"Sem palavras !!"},{"author":"Rafael Felipe","comment":"Faltou o Lucas Radaeli nesse episódio. Teve um nerdcast com ele que ele falou um pouco sobre programar sendo cego."},{"author":"Camelo Rodoviário","comment":"Pensei nisso."},{"author":"Diego França","comment":"Um dos melhores episódios. Parabéns!!!!!!!!!!"},{"author":"Fábio","comment":"Muitos reclamando de seus empregos e de como trabalham, de suas situações... vem esse podcast e nos da uma aula de valor, de carácter e de como as coisas simples que no dia dia não damos bola e nem mesmo gostamos de fazer, que é tão importante. Parabéns, cheguei a me emocionar com o podcast."},{"author":"Cleverson Lira","comment":"FANTÁSTICO!"},{"author":"rgarbin","comment":"Simplesmente fantastico esse podcast, parabéns!"},{"author":"Artur Veiga","comment":"Melhor episodio!!! Parabéns a esses monstros!"},{"author":"Enieber","comment":"muito bom, agora faz muito mais sentido escrever uma documentação em cada metodo."},{"author":"Enieber","comment":"uma documentação com os parâmetros e com o retorno, não que documentar uma função ou método não faça sentido."},{"author":"Augusto Santos","comment":"Episódio sensacional. Não fazia ideia de que haviam programadores com tamanho grau de deficiência visual. Foi ótimo poder entender melhor como é o ambiente de trabalho pra eles e parabéns a Microsoft pela preocupação com acessibilidade."},{"author":"Juliano Sales","comment":"Muito bom  o episódio, eu lembrei do episodio  do Grok  Podcast: http://www.grokpodcast.com/..."},{"author":"Rômulo Milani","comment":"Que episódio do caralho ! PQP"},{"author":"Gabriel Darezzo","comment":"Ótimo tema,A sacada de criar um WebCrawler com os convidados no final foi genial.Teria o código dele no github?"},{"author":"Paulo Silveira","comment":"eles mesmos deram a ideia de codificar algo no final. e ficou animal! é incrivel ver como eles ja se antecipam e nem esperam o reader falar, pois ja sabem o que vai acontecer. igual o que costumamos fazer com autocomplete: mal ele aparece, ja sabemos a opcao que queremos, ou ao menos chutamos."},{"author":"Olavo de Carvalho","comment":"Mano parabéns pelo Podcast com este tema. Puta tapa na minha cara que as vezes reclamo que não consigo programar."},{"author":"Marco Araujo","comment":"Muito bom este programa. Depois de trabalhar com projetos que seguiam acessibilidade pesquisei mais sobre o tema e sempre fico de boca aberta em saber o tanto que o tema e amplo.Fico feliz de saber que pessoas com deficiencia visual conseguem programar assim.Fiquei um pouco perdido na hora que estavam fazendo o codigo mas gostaria muito de ver o mesmo."}]}