{"title":"RPG hipster – Hipsters #83","releaseDate":"13/02/2018","tags":["games","Podcast"],"people":["Paulo Silveira","Rafael Balbi","Camila Duarte","Maurício “Balboa” Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1591%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1591&t_u=https%3A%2F%2Fhipsters.tech%2Frpg-hipster-hipsters-83%2F&t_e=RPG%20hipster%20%E2%80%93%20Hipsters%20%2383&t_d=RPG%20hipster%20-%20Hipsters%20%2383%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=RPG%20hipster%20%E2%80%93%20Hipsters%20%2383&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Kaelin","comment":"Lembrando que sempre dá pra jogar pela internet, utilizando aplicativos. Vocês comentaram sobre um ótimo aplicativo o Roll20, mas aqui temos também o Taulukko foi um dos pioneiros, tem 10 anos,   foi feito no Brasil,   não é tão poderoso mas roda em qualquer navegador -e principalmente no computador do trabalho kkk"},{"author":"Luiz Henrique","comment":"Aproveitando, gostaria de deixar uma dica de jogo que dá pra jogar sem tabuleiro e é muito divertido: Resistência.https://pt.wikipedia.org/wi..."},{"author":"André Vieira","comment":"Quem ai jogou \"A Criptia do Feiticeiro\"??? :Dshow galera muito bom falar de rpg, meu filho certamente vai jogar tabuleiros, dados, papel e caneta!!! abraço."},{"author":"Samuel T. Ferreira","comment":"Tah... Carverna do Dragão ... Eles estão mortos ou não ?A pergunta que não quer calar."},{"author":"Mateus Queiroz Correia","comment":"Show!!! No episódio vocês citaram alguma turma que joga no tabuleiro e grava live no youtube com várias pessoas assistindo. Não vi o link na descrição. Estou comendo mosca?"},{"author":"Rafael Balbi","comment":"Opa! Nós citamos as streams nacionais https://www.youtube.com/reg... e https://www.youtube.com/per...E citamos também a maior stream internacional, que é o Critical Role, do Geek & Sundry. =)Valeu Mateus!"},{"author":"Anthony Nalim","comment":"Paulo Silveira  os links de referência abrem na mesma aba :("},{"author":"Paulo Silveira","comment":"é uma eterna discussao se forcamos abrir na nova ou deixamos o usuario decidir pelo Control CLICK...."},{"author":"Gabriel Cano","comment":"Aguardando anciosamente o podcast que vai falar sobre Magic."},{"author":"Alexandre Bonfá","comment":"Excelente Cast! Quanta nostalgia... Só faltou falar dos primeiros Encontros Internacionais no Ibirapuera.Dois pedidos: vcs citaram uma plataforma de comunicação para jogo on-line e um canal que está transmitindo partidas na íntegra nas gringa e está atraindo milhões de espectadores. Quais são?"},{"author":"Rafael Balbi","comment":"Opa! A plataforma é o Roll20.netA Stream gringa que está atraindo milhões é o Critical Role, com Matthew Mercer. =)"},{"author":"Juliano Soares","comment":"Procurei um ep sobre python e não achei ;-("},{"author":"Paulo Silveira","comment":"estamos na divida!"},{"author":"Lucas Palma Stabile","comment":"A me lembrei das poucas vezes que participei de RPGs, acabei não jogando muito, não terminei nem uma aventura. Pessoal não continuou, não sei se era porque não sabíamos jogar tanto, ou a história não convenceu. Lembro que eu era um baita azarado, chegava a quebrar as minhas armas por tirar 1!Enfim, ouvindo esse e pelos famosos nerdcasts de RPG até bate vontade de jogar novamente, talvez eu vá atrás de grupos e talvez até jogar por internet, aqui por SP deve ter muitos."},{"author":"Douglas Dreer","comment":"Camila Duarte, \"Confiança e Sorte nos Dados\". #RPGNextwww.rpgnext.com.br"},{"author":"tiagocesar","comment":"Todo mundo que jogou RPG nos anos 80/90 compartilha as mesmas características: foi renegado, tinha (e ainda tem) uma sede tremenda por conhecimento, e em geral consegue se colocar bem no mercado - fruto de pensar fora da caixa desde cedo.Por mais episódios assim!"},{"author":"Gabriel","comment":"Então... pessoal citou raça no lugar de classes em relação ao D&D não?Valeu Alura muito bom o ep fora do tema!"},{"author":"Henrique Bozola","comment":"Comecei a ouvir vocês este ano e venho me surpreendendo e aprendendo muito com os podcasts! Parabéns e obrigado pelo trabalho! Abraços!"},{"author":"Thiago Cordeiro","comment":"Excelente!!! Bateu uma expectativa para ouvir um RPG do Hispsters.Tech nos moldes do NerdCast de RPG. #FicaADica"},{"author":"Juliano Soares","comment":"Eles podiam fazer meio que um nerdtech especial rpg ou coisa do tipo."},{"author":"Jônatas (JHOL)","comment":"Sou um mestre de rpg sem grupo kkkkkk"}]}