{"title":"Vida de Estagiário – Hipsters #85","releaseDate":"27/02/2018","tags":["carreira","Podcast"],"people":["Paulo Silveira","Henrique Calandra","Lucas Romão","Letícia Simões","Gabriel Santana"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1614%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1614&t_u=https%3A%2F%2Fhipsters.tech%2Fvida-de-estagiario-hipsters-85%2F&t_e=Vida%20de%20Estagi%C3%A1rio%20%E2%80%93%20Hipsters%20%2385&t_d=Vida%20de%20Estagi%C3%A1rio%20-%20Hipsters%20%2385%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Vida%20de%20Estagi%C3%A1rio%20%E2%80%93%20Hipsters%20%2385&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Pedro Henrique","comment":"Esse podcast entrou na minha playlist tem meses e ouvi num momento certo! Estou concluindo o 3º ano de Sistemas de Informação (6º período) e preciso de estágio para o ultimo ano. E comentando sobre eventos e networks, duas semanas atrás tivemos o StartupWeekend, minha equipe foi a vencedora e através desse evento, um integrante da minha equipe dono de uma agência, me chamou pra fazer um sistema de gerenciamento junto com ele, e sábado agora (24/11) teve o DevSummit e nele eu conheci um cara que marcou comigo uma reunião para uma vaga de dev back-end na cidade vizinha! E pra ano que vem estamos planejando o próximo startupweekend! PARTICIPEM de eventos, não tenham medo, façam networks. A maioria das vezes eu só ouvia e falava bem pouco, mas ainda sim vc absorve muita coisa!"},{"author":"Fernando Liell","comment":"Estágio na minha opinião é uma merda, até porque nossa carreira não é nem um pouco regularizada."},{"author":"Elson Sartori Junior","comment":"Olá galera, esse é o meu primeiro comentário aqui. Estou acompanhando o podcast há pouco tempo, graças à indicação de um amigo, mas já escutei deste este último até o #46. Em breve terei ouvido todos! ;-)Eu ouço sempre vocês falarem para darmos 5 estrelas no iTunes mas vejo que alguma coisa não rola legal. Eu escuto o Hipsters.Tech no iPhone, utilizando o aplicativo \"Podcasts\" que acompanha o iOS e que já há algum tempo foi desmembrado do iTunes. Ocorre que neste aplicativo o podcast do Hipstes.Tech não apresenta a avaliação. Isso não há uma limitação do aplicativo, pois alguns podcasts, como o do Jovem Nerd mesmo, apresentam a opção de avaliar.Gostaria de sugerir que vocês ajustassem isso, pois creio que assim mais pessoas poderiam avaliar positivamente o Hipsters.Tech.Eu mesmo só consegui avaliar este pois resolvi acessar pela Web para relatar o fato e pode contribuir com a avaliação.Abraços em todos e parabéns pelo EXCELENTE trabalho com o Hipsters.Tech e o também pelo \"Like a Boss\"(Em tempo: Acredito que deveria ter um link fixo na página para \"Like a Boss\". Achei muito bom!) :-D"},{"author":"Lucas Palma Stabile","comment":"Ótimo tema! Depois de vários episódios muito bons com pessoas de altos níveis hierárquicos, finalmente convidados que eu consiga me identificar e entender o que fazem HAHAHA.Já fui estagiário, e como minha formação foi de tecnólogo em Análise e Desenvolvimento de Sistemas, o estágio era obrigatório. Senti bastante diferença do que via em aula, mas ainda assim aproveitava bastante coisa. Um ponto que não gostava tanto é o fato de aprendermos na faculdade (meu caso, pelo menos) os conceitos e ideias em pequenos projetos, e na hora que cheguei no mercado e precisava trabalhar com projetos maiores eu não me sentia muito seguro ou preparado para lidar com os problemas que vinham com sistemas maiores, principalmente se me era solicitado desenvolver módulos ou telas do zero, tendo apenas uma especificação (O que me aconteceu algumas vezes).Outro ponto que aconteceu comigo é que não senti muita mudança depois que fui efetivado, além de maior carga horária e salário um pouco maior, a responsabilidade continuou a mesma. Mas isso deve cair um pouco no ponto que o Paulo falou, das empresas aproveitarem o custo menor dos estagiários."},{"author":"Bruno Silva","comment":"Acho que o curso de ciência da computação se propõe, como o próprio nome sugere, a dar uma base científica forte. Dessa forma, prepara profissionais para trabalhar com qualquer área da computação (criação de ferramentas para CG e IA, por exemplo). Por isso, disciplinas como álgebra linear e cálculo podem parecer inúteis além do contexto da universidade, já que a grande maioria das empresas procura engenheiros de software. Alem disso, a grande quantidade de bibliotecas e frameworks usados já cuida de diversos problemas de classificação e pesquisa de dados, por exemplo. Entretanto, acredito que esses conhecimentos contribuem indiretamente para que tenhamos uma compreensão geral de como as coisas funcionam. Ótimo episódio."},{"author":"Tiago Aguiar Moreira","comment":"A única prova que tirei 10 na faculdade foi em banco de dados, mas só consegui isso por causa do contato que eu tinha com esse tema no meu trabalho. Em contrapartida, a faculdade me deu base para pensar em soluções que ninguém tinha pensado na empresa. O mundo acadêmico e profissional devem andar de mãos dadas e desfrutar do melhor que cada um tem a oferecer."},{"author":"Cristiano Gonçalves","comment":"Esse comentário foi apagado."},{"author":"Cristiano Gonçalves","comment":"Já  até tentei, mas o pessoal sempre justificava que seria complicado acompanhar e passar o conhecimento  pra uma pessoa que não estivesse presente."},{"author":"Paulo Silveira","comment":"confesso que nao conheco!"},{"author":"Welton Vaz de Souza","comment":"Que vai pegar o cafezinho ou o envelope redondo!"},{"author":"Emmanuel Kant Duarte","comment":"Opa, podcast fresquinho! Acabei de consumir e já aproveitei e dei uma passar no Hipsters.jobs e já preparei mais um currículo. Haha, gostei muito do ponto em que o Paulo citou o currículo \"basicão\" super genérico. Realmente sempre que eu podia eu fazia um currículo diferente para cada vaga, nem que fosse uma vírgula. Grande podcast, abraços a todos os convidados e ao Paulo. Falando nisso, Paulo. Cadê o Linhares hein?! Ele não se rebaixa ao assunto quando se trata de estagiários?! Hahaha grande abraço à todos. Tudo de bom."},{"author":"disqus_DcSiF6PDIt","comment":"Show este Podcast, como sempre!Poderiam fazer um relacionado a idade no mercado de programação, eu por exemplo tenho 32 anos e já me acho \"velho\" para o mercado, pois estou começando tudo novamente, não me importo de começar como estagiário, mas qual é a visão das empresas? Eles ficam com medo de investir num profissional \"mais velho\"?Abraços!"}]}