{"title":"Vida de Programadora – Hipsters #86","releaseDate":"06/03/2018","tags":["carreira","Podcast","programação"],"people":["Paulo Silveira","Ana Elisa","Jacqueline Abreu","Vanessa Tonini","Jana Paradiso"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1623%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1623&t_u=https%3A%2F%2Fhipsters.tech%2Fvida-de-programadora-hipsters-86%2F&t_e=Vida%20de%20Programadora%20%E2%80%93%20Hipsters%20%2386&t_d=Vida%20de%20Programadora%20-%20Hipsters%20%2386%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Vida%20de%20Programadora%20%E2%80%93%20Hipsters%20%2386&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Matheus Henrique Silva Felix","comment":"Vo compartilhar com minha prima"},{"author":"Raphael Wilker","comment":"Olá !Bom dia.Um das convidadas, disse que usou C# no linux, como posso fazer isso?É que eu sou front-end, mas preciso compilar o projeto C# e subir ele no IIS e eu não sei como fazer isso.Alguma dica ?"},{"author":"Iago Cavalcante","comment":"No caso o multiplataforma é usando asp.net core, se o seu projeto é usando o core, vc pode usar no linux sem problema!"},{"author":"Nathan Tomaz","comment":"ela disse q pode programar c# no linux, só baixar um editor kk"},{"author":"Paulo Tarcisio","comment":"Faz um podcast de Business Intelligence? *-*"},{"author":"Luiz Eduardo C. de Oliveira","comment":"Eae pessoal do Hipsters ponto Tech,Trabalho como suporte help desk em uma rede de varejo. Por conta disso tenho diversas ferramentas de trabalho.03 delas eu acho que dariam bons tópicos para o Podcast: Sistemas ERP, Ferramentas de Suporte (registro de chamados) e por ultimo, ferramentas para mensurar a satisfação dos clientes (como atendo clientes internos da empresa, esse é um tópico que venho presenciando muito ultimamente)Acho que é só isso, parabéns pelo programa!"},{"author":"Nina Herrmann","comment":"Ih, putz! Tô me sentindo velha demais! Comecei a estudar e trabalhar com informarica em 1982! Não entendo mais nada! Apesar do meu filho dizer que eu entendo por causa da teoria da informacao. Agora estou na fase de netas me ensinarem. Kkk já programei muito em tela preta!"},{"author":"Enrique Prieto","comment":"Podcast com um papo dahora, sou front end a uns 4 anos e pra mim front end nada mais é o profissional que trabalha diretamente com a plataforma do client(navegador) focando no comportamento do usuário e na experiência do usuário, porque muitas vezes o layout do designer que chega pra você o design nao tem certas noções de ux e nessas horas a experiencia da implementação do layout no front end é importante. O backend hoje em dia o papel esta mais nas APIs que é bem importante para uma aplicação web, uma aplicação web bem construída unindo as duas profissioes pode criar aplicações web poderosas."},{"author":"André Luiz Leoni","comment":"Sobre linguagem para começar a programar, sou apaixonado por RoR... HAHAHHA e a comunidade é mt boa tbm! xD"},{"author":"Tiago Aguiar Moreira","comment":"Devo ser o único programador que não gosta de café rsrs. Ótimo programa pessoal.Meu conselho é: tenha paciência e persistência. Você vai longe com isso."},{"author":"Adriana Marques","comment":"eu tb não gosto de café"},{"author":"Tiago Aguiar Moreira","comment":"Agora são 2% dos programadores que não gostam rs"},{"author":"Geovana Coelho","comment":"Comecei na área de tecnologia por acaso e hoje é o que mais gosto de fazer, já sou graduada em análise e trabalho em uma grande empresa, muito boa para trabalhar com uma ótima equipe, chegar até aqui foi um grande caminho e olha que só tenho 20 anos shauhsuahus. Como mulher e moradora do interior de São Paulo (Interior mesmoo) fico feliz em saber que existe muitos projetos para o incentivo e acompanho de longe muito deles, ter uma grande comunidade e diversos grupos ajuda bastante quando você está começando ainda mais quando se trata de uma linguagem nova, sempre usando o bom senso. Como uma ouvinte semanalmente do hipsters fico feliz por procurarem sempre trazer uma mulher para falar também sobre os assuntos. Parabéns pelo trabalho galera!!"},{"author":"Roberta Arcoverde","comment":"+1, e faço um adendo: acho que eu nunca tinha ouvido um episódio de podcast sobre programação só com convidadas mulheres em que \"como é ser mulher em programação\" não era a pauta principal. Parabéns pro Hipsters <3"},{"author":"Geovana Coelho","comment":"Tem mais um podcast aqui no hipsters com nome de Mulheres na Tecnologia que também é muito bom!"},{"author":"Paulo Silveira","comment":"oi Geovana, fico muito contente de voce ter notado. A gente tem tentado trazer sempre uma mulher em cada episodio, e adivinha? Tem sido BEM mais facil do que eu imaginava. Basta procurar um pouco. Saí da minha zona de conforto e é fácil encontrá-las. Quem se oferece pra gravar um episodio sobre assunto X, eu falo \"traga tambem uma programadora que manja do assunto\" e a maioria das vezes nem preciso procurar. Acho que essa é uma forma discreta e muito boa de melhorar a representatividade e acolher melhor a todos."},{"author":"Geovana Coelho","comment":"Parabénss, e muito obrigada! É com essas atitudes sutil e simples porém inovadora que fazem a diferença!"},{"author":"Paulo Silveira","comment":"Esse comentário foi apagado."},{"author":"Paulo Silveira","comment":"oi Fabio. Entendo seu ponto de vista, muita gente teve pessimas experiencias com comunidades e ate eventos. Nao foi o meu caso, e acho que tambem nao foi das programadoras do episodio. Mas como a Jana bem falou e reforcamos no episodio, é importante cada um achar a formula que funciona pra si mesmo. Pra mim a comunidade funciona, desde o guj.com.br, ate os eventos que assisto e participo. Claro, em alguns momentos houve sim frustracao."},{"author":"Luiz Henrique","comment":"\"Como ser infeliz em um comentário - Parte 1\""},{"author":"Emanuel Carvalho","comment":"quando sai a segunda temporada do like a boss?"},{"author":"Paulo Silveira","comment":"estamos proximos :)"}]}