{"title":"Spring Framework – Hipsters #87","releaseDate":"13/03/2018","tags":["Podcast","programação"],"people":["Paulo Silveira","Rodrigo Lopes","Alberto Souza","Fernando Furtado","Maurício “Balboa” Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1635%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1635&t_u=https%3A%2F%2Fhipsters.tech%2Fspring-framework-hipsters-87%2F&t_e=Spring%20Framework%20%E2%80%93%20Hipsters%20%2387&t_d=Spring%20Framework%20-%20Hipsters%20%2387%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Spring%20Framework%20%E2%80%93%20Hipsters%20%2387&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Tardelli Aguiar","comment":"A real é que a Pivotal salvou o Java..."},{"author":"brunogbr","comment":"Esse livro da casa do código é bom para começar? Sou dev Java já e estou pensando em migrar para web"},{"author":"Junior Osho","comment":"Spring Boot com scaffolds fez eu voltar gostar do Java, eu vivo um caso com GO, mas java foi meu primeiro Amor !Maurício Linhares  Trabalha ai com Java ou GO ?"},{"author":"Djeison Selzlein","comment":"https://www.jhipster.tech/ esse framework é excelente pra construção de aplicações Spring Boot com scaffolds muito semelhantes ao Rails. Recomendo!"},{"author":"Igor Pereira","comment":"E o vRaptor?"},{"author":"Rafael Felipe","comment":"Pois é, gostava muito dele, tem uma facilidade de uso em alguns aspectos melhor que o spring inclusive."},{"author":"Igor Pereira","comment":"Nas minhas aulas, às vezes, prefiro o vRaptor do que o próprio Spring ou outras alternativas (JSF e etc)"},{"author":"Victor Yuji Maehira","comment":"Toda vez que tem piada de velho no podcast eu me identifico (Struts, ejb 2.x, Doom II), tô começando a ficar preocupado rs. Falando de nostalgia, tinha o webwork e o jboss seam que eram bacaninha. Tô lendo o livro de spring boot do Boaglio para me sentir mais hipster (https://www.casadocodigo.co... )."},{"author":"Daniel Marques","comment":"Ia ser legal se fizessem um episódio falando sobre o framework Phalcon do PHP.A propósito, ótimo episódio."},{"author":"G23","comment":"Putz, lembrou o CakePHP"},{"author":"Gaspar Barancelli","comment":"Melhor e mais simples framework para uma linguagem de programação.S2 Spring Framework"},{"author":"Ednaldo Dilorenzo","comment":"Não sou muito bom conhecedor das outras linguagens, mas para tomar a decisão de implementar uma aplicação utilizando microservices architecture sem spring cloud me parece arriscado, dadas as soluções preparadas dele (circuit breaker, client side load balancing, discovery server, etc.)."},{"author":"Luis Fernando Calegari","comment":"Manow pf... muda essa vinheta.... plsssssssssss"},{"author":"John Gomes","comment":"Essa vinheta é horrível"},{"author":"Daniel Moura","comment":"Ótimo podcast! Estou fazendo o meu TCC da faculdade utilizando Spring MVC. Fiquei interessado nas vagas, estão contratando sem exigir muita experiência?. Minha experiência é mais com o que to usando pra fazer o TCC, eu trabalho com .NET."},{"author":"Rodrigo Lopes","comment":"https://hipsters.jobs/compa... Manda seu cv la =)"},{"author":"Daniel Moura","comment":"Muito Obrigado! Vou enviar sim, espero que o meu cv agrade, gostaria muito dessa oportunidade. :D"},{"author":"Jilles Ragonha","comment":"Pessoal, foi indicado dois livros de Spring (Spring mvc e Vire o jogo com Spring). E reparei que alguns livros são atualizados, nunca adquiri livro da casa do código, sendo assim, seria melhor pegar a versão digital do livro? Outra dúvida, qual dos dois livros é mais interessante para quem vai começar com spring?"},{"author":"Alberto Luiz Souza","comment":"Opa, o vire o jogo é mais profundo, no sentido de entrar em detalhes mais técnicos do framework. O Spring mvc é mais focado em construir um projeto usando alguns dos projetos fornecidos pelo Spring. Acho que o mix é o melhor."},{"author":"Ricardo Correia","comment":"Muito bom o episódio, eu só gostaria se possível que vocês colocassem os links das citações que vocês fazem no podcast"},{"author":"Davi Mustafa","comment":"Spring é vida. Quem já trabalhou com ele e passa a voltar a trabalhar sem ele...sente no coro"},{"author":"Ednaldo Dilorenzo","comment":"Há muitos anos uso Spring e o que mais me chama a atenção é que acho que esse framework foi fundamental pra sobrevivência do Java."},{"author":"Inaldo Brandão","comment":"Spring é fantástico, sem dúvidas a melhor solução em Framework para Java, acho que tava faltando um tema como esse a um tempo, mais focado no mundo Java e no que a gente utiliza como solução no nosso dia-a-dia. Parabéns Hipsters !"},{"author":"Israel Dantas","comment":"Com relação à dockerização, onde posso encontrar esses \"guias\"  de integração de aplicações Spring com Docker que foram mencionados pelos entrevistados?"},{"author":"Wesley Egberto","comment":"A documentação do Spring mesmo tá muito boa nisso.https://spring.io/guides/gs..."},{"author":"Jose Vieira Neto","comment":"Paulo Silveira Para quem sente falta de um scaffold para o spring boot:https://github.com/NetoDeve..."},{"author":"João Antônio","comment":"Realmente o Spring é sensacional em todos os sentidos, fazer um select com o spring data usando somente a assinatura do método parece bruxaria rsrsrs.Estudava Spring em tutoriais aqui e ali pela internet, mas me aprofundei realmente quando li o livro do Alberto Souza que é muito bom."},{"author":"Deyvson Aguiar","comment":"Estou estudando agora spring boot, gostei da experiência... Vc teria algum ebook pra doar? Ficarei grato deyvsonaguiar@gmail.com"},{"author":"Bruno Roberto","comment":"Atualmente estou utilizando o spring boot com o mybatis, esta sendo uma delicia escrever os meus selects com responsabilidade."},{"author":"Carlos Victor Alcantara Carlei","comment":"Mutio bem !"},{"author":"Daniel Kanczuk","comment":"Adorei o podcast. Deu saudades de usar o Spring e programar em Java. Atualmente trabalho com GO e fiquei abismado com o comentário do Linhares que 'CRUD em go ngm merece' hehehehe"},{"author":"Junior Osho","comment":":-) --> GO"},{"author":"Rafael Felipe","comment":"O meu maior arrependimento da semana (na nossa profissão acontece muito, rs). É ter optado por JAX-RS no lugar do Spring pra fazer a API REST do último sistema que desenvolvi. Tudo é mais difícil, não porque o JAX-RS é ruim, mas pq o spring tem muito mais gente que tomou na cabeça antes de mim, e já tem a solução pronta em tudo quanto é lugar."},{"author":"Marco Araujo","comment":"Muito bom este episodio, mas acredito que falaram muito bem o que e o Spring em si. Falaram de Rails e do Spring Boot e suas funcionalidades e tudo mais. Atualmente trabalho com GRAILS que e uma aplicacao Groovy para web, que roda na JVM e e construida em cima do Spring Boot.Gostaria que voces que apresentam falassem mais um pouco de GRAILS e suas funcionalidades, pois aqui na Australia trabalhamos muito com ele, e desde o Brasil ja trabalhava com esta linguagem.https://grails.org/"},{"author":"Augusto Santos","comment":"Impossível inciar uma madrugada com algo melhor que um podcast nacional sobre o melhor e mais completo Framework já lançado para uma linguagem de programação haha. Frameworks JavaScript chegam nem perto rs."}]}