{"title":"PHP Experience: Performance Web, Criptomoedas e mais – Hipsters On The Road #01","releaseDate":"20/03/2018","tags":["design & ux","front-end","Podcast","programação"],"people":["Gabs Ferreira","Sérgio Lopes"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1642%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1642&t_u=https%3A%2F%2Fhipsters.tech%2Fphp-experience-performance-web-criptomoedas-e-mais-hipsters-on-the-road-01%2F&t_e=PHP%20Experience%3A%20Performance%20Web%2C%20Criptomoedas%20e%20mais%20%E2%80%93%20Hipsters%20On%20The%20Road%20%2301&t_d=PHP%20Experience%3A%20Performance%20Web%2C%20Criptomoedas%20e%20mais%20-%20Hipsters%20On%20The%20Road%20%2301%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=PHP%20Experience%3A%20Performance%20Web%2C%20Criptomoedas%20e%20mais%20%E2%80%93%20Hipsters%20On%20The%20Road%20%2301&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"mayconvm","comment":"poderia ter opção da acelerar o áudio... :)"},{"author":"edzera","comment":"Executa no console do navegador :Ddocument.querySelector('audio').playbackRate = 1.70"},{"author":"Fábio Palmério Salles Kock","comment":"Muito bom esse episódio!!!Você poderiam fazer um cronograma dos próximos eventos para que nós também se inscrever e  participar."},{"author":"Fernando Liell","comment":"Um dos melhores episódios, o Sergio Lopez tras sempre uns assunto foda sobre a WEB."},{"author":"Danilo Vieira","comment":"Eu uso Servless no Azure (Azure Functions) onde desenvolvemos todas as apis REST. Tem sido muito produtivo por ele já oferecer diversas ferramentas de linhas de comandos, como deploy da function, por exemplo."},{"author":"Elton Melo","comment":"Olá, vocês também visitarão empresas? Quem eu posso contatar para fazer uma sugestão?"},{"author":"Luís Aurélio","comment":"Não ouvi o episódio inteiro até o momento que escrevo, mas parabéns pela iniciativa. Muita gente que trabalha com informática não tem noção de como funciona os grandes eventos da área. Continuem assim! Como sugestão, sugiro a Latinoware, um evento sensacional de tecnologias open source que vai ocorrer em Foz em Outubro."},{"author":"Ravan Scafi","comment":"Excelente episódio!Gostaria de comentar que participei do evento todo e escrevi um post bem completo contando minhas experiências, pra quem quiser saber mais sobre o mesmo ou alguma palestra!https://medium.com/phpsp/co..."},{"author":"Paulo Silveira","comment":"poxa Ravan! Melhor ainda que o nosso podcast :)"},{"author":"Ravan Scafi","comment":"Que honra ler isso, Paulo Silveira! Acho que ajuda e muito a comunidade e vou tentar fazer isso em todos os eventos que eu vou :)"},{"author":"Fernando Boaglio","comment":"Muito bom Gabriel/Sérgio, parabéns."},{"author":"Marcel dos Santos","comment":"Assuntos interessantes, palestrantes feras e perguntas muito bem elaboradas. O episódio ficou excelente. Parabéns aos envolvidos! ;)É muito importante ter o pessoal do Hipster.tech participando do PHP Experience 2018 e ver de perto o que a comunidade PHP tem feito e como ela tem evoluído nos últimos anos. Isso pode ajudar a reduzir aquele estigma de que PHP é uma linguagem ultrapassada e que não traz mais novidades, além de mostrar que a comunidade está aberta para conhecer e experimentar novas tecnologias como serverless, blockchain, devops e front-end.Vale lembrar que o evento foi organizado pelo iMasters com a curadoria foi feita pelo PHPSP."},{"author":"Gabs Ferreira","comment":"Exato, Marcel!Confesso que fiquei bem surpreso com algumas palestras. O evento geral em si foi muito positivo.E além de organizar o evento o iMasters nos tratou muito bem por lá, inclusive dando um espacinho especial pra nós <3"},{"author":"Matheus Gomes","comment":"Essa nova série ficou muuuito massa, mal posso esperar pelos próximos episódios.PS: Também estou sentindo falta da nova temporada do likeaboss."},{"author":"Gabs Ferreira","comment":"Obrigado Matheus, que bom que gostou! Logo tem episódio novo :)"}]}