{"title":"Poliglotas, Aprendizado de Línguas e Tecnologia – Hipsters #88","releaseDate":"20/03/2018","tags":["carreira","Podcast"],"people":["Paulo Silveira","Guilherme Silveira","Lenka Rejfířová","Fabrício Carraro"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1646%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1646&t_u=https%3A%2F%2Fhipsters.tech%2Fpoliglotas-aprendizados-de-linguas-e-tecnologia-hipsters-88%2F&t_e=Poliglotas%2C%20Aprendizado%20de%20L%C3%ADnguas%20e%20Tecnologia%20%E2%80%93%20Hipsters%20%2388&t_d=Poliglotas%2C%20Aprendizado%20de%20L%C3%ADnguas%20e%20Tecnologia%20-%20Hipsters%20%2388%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Poliglotas%2C%20Aprendizado%20de%20L%C3%ADnguas%20e%20Tecnologia%20%E2%80%93%20Hipsters%20%2388&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Clayton Passos","comment":"https://graalvm.org - Já imaginou um único projeto com JavaScript, Python, Ruby, R, Java, Scala, Kotlin, C e C++.?Como vai ser a extrutura do projeto?Como vai ser a convenção, boas práticas, ferramentas de análise estática, cobertura de testes, etc?"},{"author":"Edson Carli","comment":"Muito bom o easter egg ^ ^Consegui entender o Italiano, o Espanhol , Inglês e o Português. Falar mesmo, mal falo o portugês rs"},{"author":"dexfs","comment":"Episódio fantástico. Uma alternativa ao italki barata  e eficiente é esse serviço https://www.wieldy.com.br/, tem uma aula grátis que é onde a professora verifica seu nível e organiza as próximas aulas.Estava valendo cada centavo investido :D"},{"author":"Willian","comment":"Muito legal o episódio! As dicas do Anki e Italki também foram de grande ajuda."},{"author":"Fabrício Carraro","comment":"Que bom que gostou, Willian! :)"},{"author":"Elio Capelati Junior","comment":"Obrigado pessoal por esse conteúdo sempre incrível.Gostaria apenas de compartilhar um pouco também! Sempre na descoberta de novas palavras, vem o anseio de saber seu significado, e um dicionário pode te ajudar muito!Minha recomendação é o dicionário https://www.wiktionary.org/. Que faz parte do mesmo projeto que a wikipedia faz."},{"author":"Fabrício Carraro","comment":"Excelente dica, Elio. Eu uso o Wiktionary quase que diariamente, principalmente para línguas eslavas."},{"author":"Matheus Bezerra","comment":"Muito bom! Me animou novamente a aprender inglês! Não conhecia o flashCard! Colocar em prática!"},{"author":"Fabrício Carraro","comment":"Maravilha, Matheus! Bons estudos :)"},{"author":"Fernando Liell","comment":"Senti falta de falar sobre as linguas de programação, sou poliglota nesse sentido :)"},{"author":"Tiago Aguiar Moreira","comment":"Esse trecho final do pessoal falando outras línguas continuamente me deixou em parafuso kkk"},{"author":"Tiago Aguiar Moreira","comment":"Muito show esse episódio. Acredito que deu um injeção de ânimo em muitas pessoas, assim como fez comigo.Já que vocês fizeram um episódio sobre aprendizado de línguas, será que caberia fazer um episódio sobre aprendizado de música seguindo a mesma estrutura? Já que vocês tem o MusicDot, poderia chamar alguma figuras muito legais para dar dicas de aprendizado!"},{"author":"DanCoutoS","comment":"Cara, falo isso a uns 3 anos para uma pessoa, pegar algo que você gosta e tem contato e aprende com ele.Mas as \"desculpas\" vem massivamente."},{"author":"Thiago Reis","comment":"O episódio foi bem motivador. Obrigado pelas dicas! até tive a ideia de fazer um auto desafio até o final do ano:https://medium.com/@thiago...."},{"author":"Fabrício Carraro","comment":"Excelente, Thiago! Fico feliz por ter te ajudado com a motivação! :) E bom desafio pra você!"},{"author":"Thiago Reis","comment":"Obrigado Fabrício!"},{"author":"Jack Headbanguer","comment":"voces podiam estar no Spotify..."},{"author":"Paulo Silveira","comment":"nao é tao simples assim :). mas estamos tentando."},{"author":"Cadu Thompson","comment":"Parabéns pela qualidade do podcast, sigo frequentemente!Havia apenas desenvolvido a leitura e deixava as outras skills de lado, porém ao olhar para o mercado de trabalho internacional é percebido que é mais do que necessário falar e escrever bem em inglês para conseguir uma boa colocação e interação.Agradeço aos participantes e sucesso!"},{"author":"Fabrício Carraro","comment":"É isso aí, Cadu. Todas as \"skills\" são importantes, e vão te diferenciar no mercado de outros candidatos.Abraço!"},{"author":"Fernando Silva","comment":"O quão um podcast pode ser útil na vida das pessoas!  Obrigado pela inspiração! E bora botar o inglês de buteco pra melhorar!  E quem sabe aprender Italiano... Francês...  Um obrigado a todos os participantes!"},{"author":"Fabrício Carraro","comment":"Fico feliz que você tenha gostado, Fernando! E principalmente por ter conseguido ajudar nem que for um pouco com a sua motivação pra voltar a estudar. Abraços!"},{"author":"Rafael Felipe","comment":"Achei muito interessante o Anki, baixei o AnkiDroid e eles têm um deck pronto de 4000 palavras em inglês, achei muito interessante pois tem a explicação e um exemplo (tudo em inglês, portanto é pra quem já tem um certo domínio). Queria saber de quem já usa, quantas palavras novas configura no App para aprender por dia?Também sou assinante alura, estou pensando em fazer o alura língua, como tô com férias marcadas pra Abril, vou esperar o retorno pra fazer. Já estava considerando o italki ou o cambly, mas o italki parece ser mais interessante pela flexibilidade, é meio q pré pago, o cambly é meio pós pago, não fez a aula perdeu."},{"author":"Fabrício Carraro","comment":"Fala Rafael,Eu pessoalmente coloco 60 revisões e 25 palavras novas como limite diário, mas isso funciona pra mim pois eu geralmente crio os meus próprios decks. Se você for usar um pré-pronto, melhor testar por alguns dias e ver como você se adapta, e ir mudando de acordo.No mais, espero que você goste das aulas e conteúdos da Alura Língua :)Abraço!"},{"author":"Eduardo Paixão","comment":"Tempo 05:10: \"Tem muito ouvinte que está preocupado com 'como eu aprendo o inglês', 'eu não estou conseguindo, to quase desistindo''..\"KKKKKK' Esse cara sou eu"},{"author":"Fabrício Carraro","comment":"Hahah entendo bem, Dudu. Talvez o melhor pra você seja fazer o que comentamos no episódio, de dividir os seus objetivos em \"mini-metas\". Assim, vai ser mais fácil alcançá-los. Se quiser mais umas dicas e talvez algo pra ajudar na motivação, a gente publicou uma apostila gratuita no site da Alura Língua.https://materiais.caelum.co...Espero que ajude :)Abraços!"},{"author":"Welton Vaz de Souza","comment":"Fantástico esse episódio #88, estou usando o DUOLINGO e o TinyCards para aprender espanhol, muito obrigado pelas dicas."},{"author":"Cesar Stati","comment":"Muito jóia esse podcast. Vai me ajudar no aprendizado que preciso pois surgiu uma oportunidade e preciso ter domínio da língua inglesa. Estou utilizando o Duolingo atualmente."},{"author":"Lenka","comment":"legal Cesar! Duolingo é legal para começar, também experimente o italk e o Babbel e, claro, a Alura Língua - tem vídeos bem bacanas no Youtube com dicas práticas do Fabricio :)"},{"author":"Cesar Stati","comment":"show!"},{"author":"Douglas Z. Piva","comment":"Show... Estou atualmente fora do Brasil, eu escuto podcasts para praticar meu portuguêsPaulo Silveira  tenho um probleminha com o podcast aqui na empersa ele da umas travadas e preciso dar um reload na pagina , escuto nerdcast e nao tenho este problema , nada que impede escutar."},{"author":"Paulo Silveira","comment":"poxa douglas, nao saberia te dizer o problema. o host é blubrry.com e nunca vi muita reclamacao, pode ser o plugin do wpengine, mas tambem escuto pouco. dificil isolar!"},{"author":"Fabrício Cabral","comment":"Paulo SilveiraParabéns pelo podcast! Muito bom!Mas eu tenho dúvida e vou perguntar na maior cara de pau: alguma possibilidade do conteúdo Alura Lingua ser liberado para quem já assina o Alura?"},{"author":"Fabrício Carraro","comment":"Olá meu xará,Você pode mandar um email para lingua@alura.com.br sobre isso. :)Abraço!"},{"author":"Fabrício Cabral","comment":"Opa Fabrício Carraro, tudo bem?Valeu pelo toque! Vou entrar em contato com eles sim! :)P.S. Parabéns pelo esforço e inteligência. Você é muito fera! :)"},{"author":"Fabrício Carraro","comment":"Maravilha! E valeu pelos elogios :)Abraço!"},{"author":"Ricardo Silva","comment":"Excelente !!! Parabéns pelo Podcast.Línguas sempre foi uma de minhas paixões, morei fora também, e gostava de aprender um pouco de cada língua do meus amigos estrangeiros.Mas comecei em 2004, japonês, russo e outras línguas, mas o dia-a-dia, correria, trabalho acabam nos desviando um pouco dos nossos objetivos, como disseram, isso não pode ser uma desculpa, por isso, estou retornando forte aos estudos de línguas, hoje poderia estar fluente em várias também ... mas bola pra frente, vamos ver aonde consigo chegar nos autos dos meus 36 anos. Abraços !!!"},{"author":"Lenka","comment":"Obrigada Ricardo, legal que você gostou do podcast :) isso aí, sem desculpas. O mais importante: na minha opinião, uma pessoa de 50 anos que tem motivação e se dedica aprende mais do que uma de 16 sem motivação e dedicação nenhuma. Boa sorte!"},{"author":"Ricardo Silva","comment":"Obrigado pela resposta e pela mensagem Lenka e Fabrício.Concordo, motivação e dedicação nos levam longe !!!Tenho bastante material e livros para estudo de Russo, agora é tirar a poeira deles e pegar firme nos estudos.E mais uma vez parabéns por esse podcast e por outros, excelente conteúdo, didático e divertido, já sou assinante da Alura e já comprei vários livros na Casa do Código, o material que vocês produzem é excelente.Mais uma vez parabéns e Sucesso !!!"},{"author":"Fabrício Carraro","comment":"Legal o seu depoimento, Ricardo! E fico realmente feliz por ter conseguido ajudar nem que for um pouco com a sua motivação pra voltar a estudar. Abraço!"},{"author":"emersonfn","comment":"Obrigado. Já é o quinto episódio que favoritei no meu agregador de podcast pois só tem conteúdo top neste podcast viu. TOPPPP"},{"author":"Silvio Caetano","comment":"Engraçado ouvir Russo com sotaque!Eu estou sofrendo bastante aqui na Estônia na rua falam Estoniano, no trabalho, quando não falam comigo, Russo , to correndo atrás pra aprender o Estoniano, mas língua é extremamente difícil."},{"author":"Fabrício Carraro","comment":"Fala Sílvio. Imagino. Aliás, tenho uma grande amiga portuguesa que trabalha aí na Estônia também, e ela me disse algo similar."},{"author":"darkjeffbr","comment":"Episódio muito bom! Parabéns galera do hipsters!"},{"author":"Jaime Neto","comment":"Bom, se o assunto é línguas, vamos aproveitar pra corrigir alguns vícios da nossa própria língua também né?Alguém no episódio falou a palavra \"gratuito\" com a pronúncia \"gratuíto\", quando a pronúncia correta seria \"gratúito\", com a tônica no \"u\" do ditongo \"ui\", assim como “intuito”, “circuito” e “fluido”. #fikdikÓtimo episódio! ;)"},{"author":"thiago","comment":"banana"},{"author":"Jaime Neto","comment":"O caso de \"banana\" é mais variação regional mesmo. Em alguns lugares se diz \"bãnãna\", em outros \"bánãna\".A rigor, deveria ser \"bãnãna\", pois a vogal seguida de consoante nasal (n ou m) se torna nasal também. Porém, em algumas regiões, essa regra só é aplicada na sílaba tônica. Por isso que em banana, a primeira sílaba, é pronunciada como \"bá\" e a segunda, que é a tônica, é pronunciada como \"nã\", e por isso também que não falam \"bánána\"... ;)"},{"author":"Paulo Silveira","comment":"olha, se não fui eu quem falou, ja aviso que faço esse sempre e meu pai sempre me corrige :). (no caso do fluido vale lembrar que existe ainda fluído com acento, ai sim muda)"},{"author":"Jaime Neto","comment":"Hehehe, esses vícios são difíceis de abandonar mesmo. Gratuito e fluido são duas palavras que escuto muito as pessoas pronunciarem errado.Mas você tem razão: Fluido pode ser pronunciado \"fluído\" se for o particípio do verbo \"fluir\", aí sim, seria fluído (de fluir), assim como caído (de cair) e saído (de sair). Mas enquanto substantivo, ou adjetivo, no sentido de líquido, a pronúncia é \"flúido\" mesmo. ;)"},{"author":"Bruno Borges","comment":"Ótimo podcast, o Italki me ajudou e ajuda muito com a minha fluência no inglês, sempre recomendo para os meus amigos, principalmente porque ele ajuda a quebrar aquele medo inicial de falar com \"gringos\" tenho amigos e colegas que travam quando precisam falar com nativos, mas que falam tranquilamente inglês com brasileiros. Quando vc consegue superar essa trava você cresce muito no aprendizado de uma linguagem estrangeira."},{"author":"Fabrício Carraro","comment":"Concordo plenamente, Bruno. Já usei o Italki pra vários idiomas pra praticar as coisas que eu já sabia, e exatamente por esse motivo."},{"author":"Marcos","comment":"Na dica de assistir séries em inglês, eu recomendo re-assistir séries/filmes que você gosta e só viu dublado. Contexto é tudo, quando você sabe o contexto as palavras se traduzem sozinhas."},{"author":"Fabrício Carraro","comment":"Perfeito, Marcos. Isso é realmente uma ótima dica!Outra similar é ler livros em inglês que você já leu em português. Livros do Dan Brown são ótimos pra isso (se for do seu gosto), pois geralmente não usam um inglês muito difícil e têm capítulos curtinhos.Abraço!"},{"author":"Lenka","comment":"Exatamente Fabricio, ia dizer o mesmo. Ler o mesmo livro que vc já leu em sua língua nativa na língua que você está aprendendo é uma excelente dica. O Pequeno Príncipe é o meu preferido, já li em todas as línguas que falo :) acho melhor do que aqueles livros bilíngues que tem uma página em outra língua pois a tentação de dar olhada na página onde tá a língua nativa é muito forte :) também existem aplicativos ou mesmo kindle que traduzem palavras que você não entende em um toque e até mostram conjugação de verbos."},{"author":"André Kauling Justi","comment":"Pessoal, gosto muito do podcast de vocês, pra mim é o melhor nacional, escuto todas as semanas, acho que ficaria legal sair um pouco das postagens sobre, Java, js e ferramentas dos mesmos.. acho que vale uns posts sobre python, Django, flask e outras tecnologias...Abraço, parabéns pelo site"},{"author":"montalvao","comment":"Galera de podcast costuma ser bem unida, então acho que não tem problema indicar aqui, né? :) O Castálio Podcast é nacional também e tem conteúdo bastante voltado a Python. Não tem toda a produção do Hipsters, mas o conteúdo é geralmente muito interessante."},{"author":"Paulo Silveira","comment":"ta engatilhado :)"},{"author":"André Kauling Justi","comment":"SHOWWWW  (L)"}]}