{"title":"Machine Learning – Hipsters #89","releaseDate":"27/03/2018","tags":["Podcast","programação"],"people":["Paulo Silveira","Alan Assis","Danilo J. S. Bellini","Cássia Sampaio"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1661%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1661&t_u=https%3A%2F%2Fhipsters.tech%2Fmachine-learning-hipsters-88%2F&t_e=Machine%20Learning%20%E2%80%93%20Hipsters%20%2389&t_d=Machine%20Learning%20-%20Hipsters%20%2389%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Machine%20Learning%20%E2%80%93%20Hipsters%20%2389&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Leandro Freire","comment":"É possível criar um algoritmo para a limpeza de dados?"},{"author":"Alisson Reinaldo Silva","comment":"Estou aprendendo Data Science com Python no DataCamp, tenho gostado bastante, tem muita aula prática. Aprendi a trabalhar com NumPy, Pandas, tenho muito o que aprender ainda, mas já posso dizer que tem sido muito legal. Eu tinha começado a fazer o curso de Machine Learning do Andrew da Stanford pelo Coursera há uns 3 anos, mas acabei parando na metade :( Quem sabe agora eu não comece do zero e termine."},{"author":"Junior Osho","comment":"Estou estudando isso a 2 anos, e o melhor livro que eu li em PT foi Machine Learning Introdução à classificação Guilherme Silveira, Bennett Bullock, foi a cabecinha do PÊNIS. Ai eu fiz um curso na udemy + Udacity, e li outros livros etc. E hoje eu tenho certeza que ML é o futuro e presente, hoje eu trabalho com ML + Unity e muito NavMash, então ML pode ser usado em tudo, para criar insight incríveis ! Adorei o pod!recomendo:https://www.udemy.com/machi...https://br.udacity.com/cour..."},{"author":"Ju Carvalho","comment":"Muito top!!"},{"author":"Fernando Liell","comment":"Machine Learning ta chegando de mansinho..."},{"author":"Felipe","comment":"Muito bom o programa!!! Parabéns..."},{"author":"Thyago Rezende","comment":"Python é muito simples de aprender, mas R ainda tem muitos adeptos, apesar da curva de aprendizado mais difícil.... é uma ferramenta incrível. Não há conteúdo em portugues e online melhor do que o da Data Science Academy!!!!!"},{"author":"Cássia Sampaio","comment":"Concordo em genero, numero e grau Thyago! A DS Academy é muito legal mesmo, valeu pela dica."},{"author":"Romulo Assis","comment":"Um cara foda que não foi citado diretamente, é o IBM Watson. Ferramenta foda e bem simples de entender!"},{"author":"Cássia Sampaio","comment":"Que bom que você gosta Romulo, trabalhei com esse cara por algum tempo :p. Temos inclusive um curso na Alura de chatbots que é com o Watson."},{"author":"Romulo Assis","comment":"Legal. Estou montando uma startup baseada nele.Realmente, essas ferramentas são o futuro. Cada dia estou mais apaixonado por essa área!! :D"},{"author":"Cássia Sampaio","comment":"Mandou muito! Espero que a startup decole. \\o/Ahahaha sim, tenho que concordar que é uma área fascinante e não tínhamos como fugir dela desde o clips que fazia perguntas no microsoft word."},{"author":"Thiago","comment":"Ótimo podcast. Quem quiser utilizar Java para Machine Learning tem o Weka ( https://www.cs.waikato.ac.n... ) que parece com o scikit-learn (Python). O https://weka.wikispaces.com/ possui vários exemplos/tutoriais para quem quiser utilizar o Weka em seu código."},{"author":"Caio Vinicius","comment":"Estou usando o Weka em alguns projetos de Machine Learning, estou gostando bastante, na plataforma da Udemy possui alguns cursos que falam dele."},{"author":"William R. Fernandes","comment":"Ah Udacity abriu uma porta gigantesca aqui no Brasil, para treinamentos na área! Estou realizando a formação  Nanodegree deles! Sempre muito bom ouvir sobre  a tecnologia!"},{"author":"Alisson Reinaldo Silva","comment":"Terminou seu nanodegree? O que você achou? Eu tava pensando em começar, parece muito interesse, principalmente a parte de você fazer projetos, hospedar no teu GitHub como se fosse um portfólio, achei bem interessante. No momento estou fazendo Data Science com Python no DataCamp, tenho gostado bastante, tem muita aula prática."},{"author":"William R. Fernandes","comment":"Cara! Eu gostei muito achei muito foda! Recomendo!"}]}