{"title":"Linguagens Funcionais – Hipsters #91","releaseDate":"10/04/2018","tags":["Podcast","programação"],"people":["Paulo Silveira","Roberta Arcoverde","Andrei Formiga","Charlotte Lorelei Oliveira","Maurício “Balboa” Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1676%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1676&t_u=https%3A%2F%2Fhipsters.tech%2Flinguagens-funcionais-hipsters-91%2F&t_e=Linguagens%20Funcionais%20%E2%80%93%20Hipsters%20%2391&t_d=Linguagens%20Funcionais%20-%20Hipsters%20%2391%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Linguagens%20Funcionais%20%E2%80%93%20Hipsters%20%2391&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Junior Osho","comment":"Paulo Silveira  quando você entrevistou o Jose Valim ? qual pode ?"},{"author":"Matheus Eduardo Machado Moreir","comment":"Recomendo demais a leitura do SICP (Structure and Interpretation of Computer Programs). É um livro sobre algoritmos e estruturas de dados que usa Scheme como linguagem. É um livro puxado mas a apresentação dos conceitos é explicações são das melhores que já vi em livros da área. É um livro que expande a mente do programador para novas abordagens de solução de problemas.Uma vantagem do SICP é que existem vários sites em que programadores postam soluções dos problemas propostos, então você pode avançar no estudo mesmo se agarrar em um problema mais complexo.O livro está publicado gratuito na internet em HTML e Scheme também pode ser baixado gratuitamente no site do MIT.Episódio muito bacana, tenho gostado muito do Hipster. Abraços!"},{"author":"Luís Aurélio","comment":"Excelente tema. Mostrou que as Linguagens Funcionais já passaram da barreira universitária e já tem bastante demanda no mercado. Além de mostrar ao pessoal do paradigma clássico, que ao usar funções como foreach, map, lambdas e outros, já está iniciando-se no paradigma funcional.Aproveitando, sugiro que vocês abordem a GDPR (General Data Protection Regulation). Muitos desenvolvedores devem estar em dúvidas com essa nova lei, mesmo que só seja uma lei europeia de impacto mundial."},{"author":"Tiago Aguiar Moreira","comment":"Realmente é uma quebra de paradigma. Confesse que terei uma barreira pra romper se quiser realmente entender esse mundo paralelo. Galera, parabéns pelo cast.Sugestão de tema: O que é um ORM, para que serve, quando usar e seus prós e contras."},{"author":"Marcel dos Santos","comment":"Parabéns a todos por mais um excelente episódio. A programação funcional é realmente fascinante. ;)Recomendo, para quem está querendo aprender programação funcional, começar com JavaScript. Isso vai te permitir aprender conceitos de programação funcional com o conforto de uma linguagem imperativa e conhecida.Após ficar mais confortável com os conceitos iniciais de programação funcional, recomendo partir para a linguagem Elm. Elm é uma linguagem funcional pura, para desenvolvimento front-end, super elegante e que compila para JavaScript. O workflow de desenvolvimento Elm é bastante suave, a linguagem é fortemente tipada e puramente funcional, possui estruturas de dados imutáveis e serviu de inspiração para a criação do Redux. Vale a pena experimentá-la!Abaixo um pequeno roteiro para quem quiser iniciar os estudos em programação funcional:- \n\n\nReproduzir\n\n\n Ocultar\n\n\n\n\n - Palestra que explica de forma bem didática os principais conceitos de programação funcional- http://bit.ly/mostly-adequa... - Livro sobre programação funcional em JavaScript que explica desde conceitos básicos até functors e monads de forma bem didática e suave- \n\n\nReproduzir\n\n\n Ocultar\n\n\n\n\n - Série de vídeos sobre a excelente linguagem Elm- http://bit.ly/introducao-a-elm - Slides bem completos da palestra sobre ElmAbraços e bons estudos! ;)"},{"author":"David Tormenta","comment":"Muito bom o podcast, comecei a estudar Rust no inicio desse ano, e estou gostando cada vez mais de linguagens funcionais. Continuem com o ótimo podcast!! Até o próximo episódio"},{"author":"Ricardo Silva","comment":"Excelente episódio, meu primeiro contato com o paradigma funcional foi com o Java mesmo, estudando para a certificação de Java 8. Realmente no inicio é complicado para quem está acostumado com OO, mas depois que pega o jeito, realmente se economiza no código e o mesmo fica muito mais legível. Vou pegar uma das linguagens sugeridas no episódio para me aprofundar mais."},{"author":"Alan Alves","comment":"Parabéns pelo Podcast! Estou cada vez mais <3 por FP."},{"author":"Inaldo Brandão","comment":"Realmente, assim que comecei com linguagens funcionais já percebi de cara a quebra de paradigma, e é impressionante o quanto podemos ganhar em termos de produtividade, legibilidade e performance. Nesse ritmo de funcional, manda um de Kotlin, hehehe. Parabéns pelo Podcast."},{"author":"Robert Resende","comment":"Fantástico esse episódio!!! O tema, as citações do participantes bem como traçaram os paralelos ficando fácil de compreender os exemplos. O paulo explicando que ao invés de utilizar o for fazer o uso de uma função recursiva me vi nas aulas linguagens funcionais na faculdade... na época penando para entender lisp, clean... lisp com 1 milhão de parenteses que parecia loucura na época mas depois que compreendi tudo ficou bem mais fluído. Poderiam fazer um episódio sobre programação lógica... e talvez fazer um mix com processamento de linguagem natural. Ficaria show!"},{"author":"Guilherme","comment":"Hipsters, trás a Roberta mais vezes!!!"},{"author":"Roberta Arcoverde","comment":"<3 participar sem entender tanto assim da pauta é comigo mesmo!"},{"author":"Marcos","comment":"Muito bom o episódio. Eu gosto desse purismo, quase filosófico, que essas linguagens trazem.E assim como no episódio de spring, consegui entender que muitas das coisas que eu uso hoje em C# e javascript, que considero boas práticas, são frutos de ideais e de contestação do que já estava estabelecido.Fique sem entender um pouco do escopo onde são realmente usadas essas linguagens, em qual parte do stack, onde elas são mais aplicáveis. Ou até mesmo se são linguagens generalistas, tipo C# e python. Isso foi bem abordado em outro episódio, acho que no episódio de GO."},{"author":"Maurício Linhares","comment":"É uma mistura, você pode usar linguagens funcionais no frontend (tem coisas como PureScript, Reason https://reasonml.github.io/ e várias outras pra substituir JavaScript) e também no backend, com Scala, Haskell, OCaml, Erlang. Algumas indústrias, como a financeira, usam mais linguagens funcionais mas elas são linguagens de uso geral que podem ser aplicadas em vários problemas diferentes."}]}