{"title":"Ideias para TCCs e Projetos – Hipsters #92","releaseDate":"17/04/2018","tags":["carreira","Podcast","programação"],"people":["Paulo Silveira","Professor Carlinhos","Roberta Arcoverde","Guilherme Silveira","Maurício “Balboa” Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1689%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1689&t_u=https%3A%2F%2Fhipsters.tech%2Fideias-para-tccs-e-projetos-hipsters-92%2F&t_e=Ideias%20para%20TCCs%20e%20Projetos%20%E2%80%93%20Hipsters%20%2392&t_d=Ideias%20para%20TCCs%20e%20Projetos%20-%20Hipsters%20%2392%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Ideias%20para%20TCCs%20e%20Projetos%20%E2%80%93%20Hipsters%20%2392&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Bruno Tinelli","comment":"No meu TCC tive que escrever uma monografia e codificar, foi tenso! O problema foi quando um dos avaliadores me disse que se ele fosse um empresário nao compraria minha ideia. Eu não sabia que tinha que ter essa perspectiva na hora de montar o meu tcc. Na minha faculdade eles tem o costume de cobrar por coisas que nao existam na grade curricular."},{"author":"MARIO F S JUNIOR","comment":"Codota?"},{"author":"MARIO F S JUNIOR","comment":"Paulo qual nome do software que você mencionou sobre os alto complete ?"},{"author":"Thiago H. S. Zampollo","comment":"Olá, excelente podcast!O meu TCC foi bem teórico apesar do curso ser bem prático, o curso foi de Automação Industrial e o TCC foi QUALIDADE DE ENERGIA – ESTUDO DE SOLUÇÕES REFERENTES ÀS INTERFÊRENCIAS HARMÔNICAS. Disse que foi bem teórico porque tivemos que ir a fundo em Séries de Fourier, Taylor, Maclaurin,.. pra conceber um modelo matemático  que representasse bem o que queríamos. Tivemos alguns poucos problemas no grupo, concebemos um protótipo funcional em escala minimalista com algumas ressalvas, mas ao fim foi muito bacana. Vou deixar os links do trabalho e da apresentação, vai que alguém queira dar uma conferida.\n\n\nReproduzir\n\n\n Ocultar\n\n\n\nhttps://1drv.ms/b/s!AnpPtDQ..."},{"author":"Walter Coan","comment":"Excelente podcast. Gostaria de sugerir o TCC de um egresso do nosso curso de sistemas de informação que construiu um extrator para a plataforma Lattes: https://fabricadesoftwareun..."},{"author":"Humberto Corrêa da Silva","comment":"Bom dia, excelente episódio! O tema do meu TCC foi Edução à Distância, tive que estudar pedagogia para implementar um sistema web que montava e disponibilizava cursos online. Hoje trabalho com coisas completamente diferentes, mas essa base de sistemas web sempre me ajudou."},{"author":"João Menighin","comment":"Sugestão: VueJS!"},{"author":"Tiago Aguiar Moreira","comment":"Quero deixar uma sugestão de tema... como as empresas lidam com novos funcionários.Toda empresa que entrei, no começo, sempre senti que poderia ser muito mais produtivo do que fui. Ou não me passavam atividades, ou não tinha ninguém pra explicar nada e você não consegue evoluir. Enfim, uma série de fatores que torna muito improdutivo o início em qualquer empresa além de ser um prejuízo."},{"author":"Victor Ribeiro","comment":"Foi bem gostoso lembra do meu TCC com esse episódio . Eu usei um método bayesiano pra previsão de intencao de votos. Pra coletar os dados usei a API do Twitter .Foi bem bacana!"},{"author":"Tiago Aguiar Moreira","comment":"Pessoal, onde eu baixo o banco de dados do StackOverflow?"},{"author":"Roberta Arcoverde","comment":"https://archive.org/downloa..."},{"author":"Tiago Aguiar Moreira","comment":"Obrigado!"},{"author":"Tiago Aguiar Moreira","comment":"Meu TCC foi muito triste... um grupo que uns saíram, outros ficaram, mas dava na mesma de ter saído. Enfim. Foi complicado.Uma ideia que um colega teve para o tcc foi de pagar a passagem no ônibus com o cartão de débito. Na época eu dei risada, mas hoje com NFC acho que seria algo mais viável."},{"author":"thiago","comment":"Para mim o grande problema da faculdade hoje em dia é que ela não prepara para a vida, tem muitas matérias que fogem do foco do curso e por ai vai."},{"author":"Tiago Aguiar Moreira","comment":"Lembra muito a auto escola..."},{"author":"Ricardo Quintanilha","comment":"Muito bacana esse podcast! Eu já fui universitário a um tempo atrás e sei como é difícil escolher um tema, escutando o podcast achei tão simples a ideia de recriar algo de uma forma mais acessível.Obs.: Na cidade de Luxemburgo onde eu moro a maioria dos pontos de ônibus exibem o horário dos onibus em real time,  seria animal ter isso no Brasil também porque realmente ajuda. :)"},{"author":"João Paulo Amaral Haddad","comment":"Sou professor de epidemiologia da UFMG na escola de veterinária e tenho exatamente esse tipo de problema que o Mauricio Linhares disse, temos diversas ideias de aplicativos para resolver problemas reais mas nos falta exatamente esse tipo de ligação com os desenvolvedores. O problema que ficamos, isso eu me incluo, cada um na sua caixa e acaba que a gente pode resolver varias coisas (e inclusive fazer uma grana) mas não temos contatos com esse tipo de profissional.Se tiver aluno da computação e tiver que fazer TCC e precisar de ideia pra resolver problema aqui nós temos ideias e necessidades."},{"author":"Felipe Krause","comment":"Boa noite tudo certo João? sou aluno de computação e estou iniciando o meu TCC, como podemos se contatar para trocar uma ideia?"},{"author":"João Paulo Amaral Haddad","comment":"Boa noite Felipe.Entra no meu linkedIn e a gente conversa.https://www.linkedin.com/in...Valeu e obrigado pelo contato!!!"},{"author":"Danilo dos Santos Ferreira","comment":"Olá. João.  Tenho interesse em desenvolver soluções na área de saúde para tcc, pois é a área que trabalho agora. Posso entrar em contato com você ?"},{"author":"João Paulo Amaral Haddad","comment":"Claro! Entra no meu linkedIn (endereço na mensagem de cima) e a gente conversa.Abraços."},{"author":"caiozf","comment":"Pô, podiam ter lançado esse episodio a uns 4 meses atrás né!O semestre começou em Fevereiro..."},{"author":"Tiago Aguiar Moreira","comment":"Poderiam ter lançado esse podcast em 2015 haha"},{"author":"caiozf","comment":"Eai man, é que eu estou no último ano, e mudei minha ideia de TCC (que ia ser um jogo, mas me desmotivei), agora estou com uma ideia que vai me agregar conhecimento, mas é pouco original..."},{"author":"Tiago Aguiar Moreira","comment":"Eu disse aquelo porque foi em 2015 que me formei. Se tivesse ouvido esse programa na época eu teria feito algo muito diferente. Cara, comigo foi a mesma coisa. Tive que mudar a ideia pra conseguir entregar. Me agregou conhecimento, mas não era o que eu queria fazer e nem do jeito que eu queria..."},{"author":"Marcelo Fidelis","comment":"Qual o nome desse projeto open source de autocomplete de algoritmo no Eclipse que usa a base de dados do stackoverflow?"},{"author":"Maurício Linhares","comment":"Um deles é esse aqui: https://marketplace.eclipse..."},{"author":"Vitor Guia","comment":"Bom dia, ótimo episódio. Roberta Arcoverde achei bacana você falando do seu TCC e sua animação, você pode divulga-lo?"},{"author":"Roberta Arcoverde","comment":"Vou ver se posso! Ele acabou virando parte de um projeto de pesquisa maior, preciso verificar com os pesquisadores envolvidos"},{"author":"Robert Resende","comment":"Bom dia! Mais um podcast com assunto apaixonante... não sei quem sugeriu o tema mas já parabenizo porque foi excelente. Professor Carlinhos falando que ensina os alunos sobre iniciação científica reprovando foi cômico, me lembrou um professor meu de estatística... Lógico que nós sabemos que não é verdade. Meu TCC inicialmente era pra ser um gerador de poesias automático utilizando PLN que seria um trabalho interdisciplinar com letras mas a pessoa que iria me auxiliar na parte de entender/tentar aprender uma parte lá da estrutura da poesia que dependência de um conhecimento profundo de latim (\"era um doutora em latim\") teve um problema grave de saúde e por incrível que pareça na época não consegui ninguém conseguiria me ajudar tive abandonar. Então, como alternativa fiz um conjugador verbal utilizando conceitos de PLN em prolog. Aonde eu fornecia uma palavra se fosse um verbo ele identificava, quebrava ele e realizava a conjugação completa do mesmo. Isso para os regulares é claro. Os irregulares criamos um base de dados bTree para ficar fácil/ágil recuperar. Já brincando nessa parte iniciei um trabalho de tradução do português para esperanto o que acabou virando o TCC de uma amiga de faculdade um ano após o meu. Saudades da época de faculdade... era feliz e não sabia kkkkkkkkkkkkk Como vocês mesmo dizem hipsters abraços!"}]}