{"title":"Mitos de UX – Hipsters #93","releaseDate":"24/04/2018","tags":["design & ux","Podcast"],"people":["Paulo Silveira","Daniel Furtado","Natan Souza","Carla de Bona","Marco Bruno"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1697%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1697&t_u=https%3A%2F%2Fhipsters.tech%2Fmitos-de-ux-hipsters-93%2F&t_e=Mitos%20de%20UX%20%E2%80%93%20Hipsters%20%2393&t_d=Mitos%20de%20UX%20-%20Hipsters%20%2393%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Mitos%20de%20UX%20%E2%80%93%20Hipsters%20%2393&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"heraldoluciano","comment":"Muito boa a discussão!Sobre muito ou poucos clicks, a Amazon tem as duas opções.Posso adicionar no \"carrinho\" e continuar comprando ou usar a opção \"Comprar com um click\".O que realmente falta em muitos sites é informação explicita. Não adianta ter um \"ícone\" que não entendo..."},{"author":"Leandro Fernandes","comment":"haha.. eu comprei um note book na amazon recentemente sem entender que estava comprando justamente com essa do botão continuar."},{"author":"Pê.","comment":"Em 49:20 é falado algo de \"panda\". É um app, blog, extensão de chrome? Qual nome correto?"},{"author":"bassirenata","comment":"é uma extensão do chrome; https://chrome.google.com/w..."},{"author":"Felippe","comment":"Está no TOP 3 de melhores episódios do Hipsters. Episódio muito divertido e com muita informação interessante. Sou apaixonado pelo assunto e agregou muito conhecimento!PS: Conforme mencionaram aí embaixo, achei o episódio acelerado demais também...."},{"author":"Rodrigo Grande","comment":"Estava jogando Diablo 2 e escutando o podcast hehe"},{"author":"Rodrigo Tognin","comment":"O episódio ficou muito bom, ótimas reflexões...Porém eu só achei estranho a velocidade da edição... quase ninguém respirava, risadas cortadas ao meio... participantes falando numa velocidade.. rsrsrsNão é crítica destrutiva não. Só uma percepção minha mesmo.Achei bem interessante cada detalhe de exemplo que os participantes falaram. Precisarei ouvir mais uma vez para absorver melhor o conteúdo.Valeu, abraço"},{"author":"heraldoluciano","comment":"Ah, eu gosto assim...No YouTube eu mudo pra velocidade 1.5 e às vezes 2 quando a fala está muito devagar..."},{"author":"Giovanni Andreas Capeli","comment":"Caramba tive a mesma sensação! Parece que algumas horas teve até aceleração na velocidade! O bom é que cabe bastante informação em uma hora, porém como eu ouço podcasts enquanto faço outras atividades, parece que dá um bug na compreensão. Pode ser costume também."},{"author":"Rodrigo Tognin","comment":"Pois é... eu ouço enquanto trabalho. E olha que sou programador e estou \"acostumado\" a ouvir podcasts mesmo em meio a lógicas de programação e tal... Mas nesse episódio eu tive que pausar algumas vezes para o cérebro \"respirar\" um pouco, rsrsrs.Como você disse, é bom para caber mais conteúdo em menos tempo. Algumas pessoas acostumaram a ouvir 1.5x ou até 2x mais rápido podcasts. Pra mim não dá.Valeu Giovanni"},{"author":"Danilo Silva Fernandes","comment":"Fiz o curso de acessibilidade, achei muito bom."},{"author":"Natan Souza","comment":"opa obrigado pelo feedback danilo! <3"},{"author":"Sebastião Relson Reis da Luz","comment":"Se o Daniel Furtado, é a Kefere, imagine o que é a Alda Rocha , Whindersson Nunes? :D"},{"author":"danielfurtado","comment":"Hahahahahhaa!"},{"author":"Filipe","comment":"HAHAHAHAHAHAHAHA!!!"}]}