{"title":"Seleção e Contratação de Times de Tecnologia – Hipsters #94","releaseDate":"01/05/2018","tags":["carreira","Podcast","programação"],"people":["Paulo Silveira","Silvia Kihara","Lucas Mendes","Roberta Arcoverde","Alberto Souza"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1708%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1708&t_u=https%3A%2F%2Fhipsters.tech%2Fselecao-e-contratacao-de-times-de-tecnologia-hipsters-94%2F&t_e=Sele%C3%A7%C3%A3o%20e%20Contrata%C3%A7%C3%A3o%20de%20Times%20de%20Tecnologia%20%E2%80%93%20Hipsters%20%2394&t_d=Sele%C3%A7%C3%A3o%20e%20Contrata%C3%A7%C3%A3o%20de%20Times%20de%20Tecnologia%20-%20Hipsters%20%2394%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Sele%C3%A7%C3%A3o%20e%20Contrata%C3%A7%C3%A3o%20de%20Times%20de%20Tecnologia%20%E2%80%93%20Hipsters%20%2394&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Leandro De Souza Oliveira","comment":"Poderiam adicionar aqui a playlist utilizada no fundo do video ?"},{"author":"Lucas Maciel Cordeiro","comment":"Seria legal discutir sobre trabalho remoto também, é bem pertinente quando se fala de seleção de times de tecnologia."},{"author":"Ramon Freitas","comment":"Cara troca essa música de fundo, o assunto é muito interessante mas a música da um sono horrível."},{"author":"Clayton Passos","comment":"Existem vagas sendo divulgadas no github, pra juntar os diversos repositórios e facilitar a busca, criei um projeto aqui: https://netstart.github.io/..."},{"author":"Tiago Aguiar Moreira","comment":"Aos 32:15 é citado em um exemplo o Trello e outra plataforma que não entendi o nome. Parece Azana... alguém sabe o que é?Em relação ao episódio, foi muito legal. Principalmente a parte sobre conversar com o candidato sobre situações reais e quais atitudes tomou. Minha última entrevista foi assim e achei muito legal. Não descarto um o famoso teste no papel, mas é mil vezes melhor do que só o teste. Um papo é muito esclarecedor."},{"author":"Lenka","comment":"Oi Tiago, a ferramenta é Asana, parecida ao Trello. Legal isso sobre as situações reais, concordo! :)"},{"author":"Tiago Aguiar Moreira","comment":"Valeu!"},{"author":"Lenka","comment":"Esse comentário foi apagado."},{"author":"Lenka","comment":":-D também fiquei rindo disso"},{"author":"thiago","comment":"O problema para mim é que as empresas parece que estão contratando a pessoa mais pela fumaça que elas fazem do que pela capacitação das mesmas e capacidade de aprendizado."},{"author":"Thyago Rezende","comment":"Muito bom. Este episódio foi incrível"},{"author":"Marcos","comment":"Muito bacana o episódio. Contratação é um temo pouco discutido, os convidados trouxeram muito conhecimento e opiniões relevantes.De adianto, quero deixar claro que a participação da Roberta é muito representativa pra mim. Primeiro porque eu sou desenvolvedor .NET e também pelos pontos de vista contrastantes ao hype.Um assunto bacana pra ser discutido nesse tema é rotatividade. Acredito que não seja o problema de nenhuma as empresas representadas nesse episódio.Gostei muito quando foi mencionado que a contratação é um processo de 2 vias, serve pro candidato avaliar a empresa também.Um relato pessoal sobre o processo de candidatura:Primeiro, eu que deixar claro que eu entendo que tenho uma posição privilegiada em relação a outras profissões. Mas também não sou um supra-sumo técnico que é disputado a tapas.No papel de candidato, por mais que a vaga que vá ocupar não seja de extrema importância estratégica pra empresa, eu sinto falta do recrutador apresentar mais informações sobre a empresa. Até mesmo algumas coisas triviais, como código de vestimenta, o time que você vai trabalhar, lugares pra comer. Além do objetivo, qual o desafio técnico, qual a expectativa com a minha contratação, como é o fluxo de trabalho, se o trabalho é sustentação ou desenvolvimento do produto, o nível de maturidade dos produtos ou do sistema que você vai criar ou manter.Então, eu geralmente entrevisto o recrutador de volta. E as vezes a reação é surpresa. O entrevistador por vezes fica perdido quando eu começo a perguntar sobre a empresa, dia a dia e outros detalhes, que parecem totalmente triviais. Algumas vezes a reação também é evitar responder, dar respostas como \"isso daí você vai ver com o pessoal\" ou \"isso é detalhe\", \"depois você com o RH\".As vezes uma coisa que parece trivial, como a distância do local de trabalho pro metrô ou facilidade de estacionar, pode ser um fator decisivo pra escolha.Os 3 fatores determinantes pra minha avaliação são: crescimento profissional, salário e ambiente de trabalho. Crescimento profissional é muito importante na minha avaliação. Eu tendo a preferir vagas que tenham desafios técnicos, que o produto seja bem arquitetado, que o processo de desenvolvimento esteja bem desenvolvido, ou que a ideia seja elevar o nível de desenvolvimento da empresa. Além do trabalho ser interessante tecnicamente, a experiência profissional é o que agrega valor a minha carreira profissional. Mas se for tudo muito legal e não tiver remuneração compatível não funciona, não adianta eu crescer como profissional se eu não souber que minhas contas vão conseguir ser pagas no fim do mês. E o ambiente de trabalho determina permanência. Ou se eu perceber, antes da contratação, que vai ser muito moroso o trabalho eu já fujo.O \"momento profissional\" (totalmente pessoal) impacta muito na minha decisão também. Se dinheiro não é problema, eu largo qualquer empresa \"normal\" por um estágio no Google, Facebook, Amazon, Stack Overflow ( ͡° ͜ʖ ͡°) que me permita subir de patamar tecnicamente. Mas se o problema é grana, não adianta vir uma carta do Larry Page homologada pelo papa, me solicitando para participar do conselho da Alphabet se a remuneração for 1 real menor que a atual."},{"author":"Cesar Lemos","comment":"Chorei com essa trilha sonora kkkkkk"},{"author":"Riad Vargas de Oliveira","comment":"Excelente podcast, arrisco dizer que os participantes não poderiam ser melhor escolhidos.Outra ferramenta que parece estar ganhando adesão na divulgação de vagas de tecnologia é o StackShare. A ideia da divulgação lá seria guiar o possível candidato ao encontro da empresa pelo stack que ela usa.Faz tempo que não se fala sobre cultura nos podcasts, seria um tema muito bom para os próximos episódios #ficadica haha"},{"author":"Riverfount","comment":"Muito bom. Vejo sempre um problema na contratação que é as respostas meio padronizadas às pessoas que se candidatam às vagas. Mesmo que solicitemos um feedback mais detalhado que nos indique no que precisamos melhorar até mesmo para uma possível candidatura futura, mas infelizmente é sempre o padrão: seu perfil não se enquadra ao que a vaga solicita e por aí vai! Mas, parabéns, o episódio foi sensasional!"}]}