{"title":"Desenvolvimento de Jogos Indie – Hipsters #96","releaseDate":"15/05/2018","tags":["games","Podcast","programação"],"people":["Paulo Silveira","Stiven Valerio","Jeferson Silva","Ricardo Bugan","Maurício “Balboa” Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1729%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1729&t_u=https%3A%2F%2Fhipsters.tech%2Fdesenvolvimento-de-jogos-indie-hipsters-96%2F&t_e=Desenvolvimento%20de%20Jogos%20Indie%20%E2%80%93%20Hipsters%20%2396&t_d=Desenvolvimento%20de%20Jogos%20Indie%20-%20Hipsters%20%2396%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Desenvolvimento%20de%20Jogos%20Indie%20%E2%80%93%20Hipsters%20%2396&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Thiago Cordeiro","comment":"Eu ouvi esse tema \"maroto\" de Top Gear versão Metal aos 45:34... Nostalgia bateu forte!😍"},{"author":"João Menighin","comment":"Ótimo episódio pessoal!Gostaria de comentar aqui de algo muito bacana e que tem tudo a ver com jogos o CodinGame (https://www.codingame.com/).O CodinGame é basicamente mais um site de desafios de programação mas voltado para jogos. Tem vários desafios de programação de bots, campeonatos e etc. É bem interessante pra quem quer brincar com essa parte mais técnica de IA e algoritmos inteligentes pra deixar seu jogo legal.Abraço!"},{"author":"Junior Osho","comment":"Eu comecei fazer uns DEMOS usando Unity:https://booksgames-br.fireb...Tem muita coisa divertida, nosso carro chefe é MACUNAIMA e DOM QUIXOTE, mas vai rolar um CRIME E CASTIGO Paulo Silveira  eu sei que você curte ! A o Zaratustra do Nietzsche ta bem adiantado ! by juniorsatnas"},{"author":"Paulo Silveira","comment":"muito bom Junior!! cenarios lindos!"},{"author":"Rafael Felipe","comment":"Legal o tema desse, comecei na carreira pensando nisso, fiz vestibular para um curso de \"Tecnologia em Design de multimídia\", pois não existia dev de jogos na época. Mas acabei estudando sistemas e hoje sou programador \"Arroz Feijão\".Sugestão de tema (Treta): \"Dilemas na hora de escolher uma tecnologia: open source vs proprietário\"."},{"author":"Mateus Paes","comment":"Olá Hipsters, Excelente podcast!Escuto o Hipsters desde de o Início, um dos melhores podcast!Gostaria de sugerir um Tema para podcast.Sou Eng. Elétrico e trabalho com Hardware e Software Embarcado no Setor aeroespacial.Trabalhei nas duas se não as Únicas empresas que desenvolvem Mísseis, foguetes no Brasil. Mectron EIC, e atualmente Avibras.Neste ramo de Embarcados Utilizamos muito C/C++ Assembly.E para Softwares de Teste LabView e C#!Acredito que seria um cast legal, abordar estes tema SW Embarcados.Um Abraço"},{"author":"Paulo Silveira","comment":"mateus, me manda um email? quer gravar com a gente? paulo.silveira@caelum.com.br"},{"author":"Danilo Vieira","comment":"Ótimo Podcast. Parabéns !!Sou desenvolvedor Android e usuário de Linux. Durante muito tempo estive procurando por uma engine open source que desse para fazer bons games, tanto para Android quanto para PC.Então eu achei a GoDot engine, ótima enine para criação de games 2D e 3D e você pode exportar para windows, linux, Android, IOS, MAC e HTML. Além de ser OpenSource outro ponto positivo para mim foi a facilidade de criar modulos Android usando o SDK do Android e portá-los para o game."},{"author":"Andre Luis","comment":"Hoje em dia as engines estão muito equilibradas, realmente é uma questão de gosto pessoal. No caso dos indies, no final das contas o que importa é a ideia (game design) e a forma como ela foi implementada. Tem jogos extremamente simples na parte gráfica mas geniais no design, o que os levou a ser sucesso de vendas.E parabéns pelo excelente podcast."},{"author":"Horácio Dias Baptista Neto","comment":"Ninguém falou do Godot..."},{"author":"Thaynan Breno","comment":"Gostaria de deixar uma sugestão de tema, sobre frameworks para desenvolvimento web, em especial o Laravel que ultimamente ficou muito popular."},{"author":"Renan","comment":"esperei muito por esse podcast *-*"},{"author":"Ricardo Silva","comment":"Cara, show de bola esse podcast !!! Sempre curti jogar também, nascendo no inicio dos anos 80, pode-se dizer que passei por todas as plataformas, infelizmente não comecei a programar tão cedo, hoje trabalho com desenvolvimento backend, mas criar um jogo sempre foi um daqueles planos engavetados, acho que vou tirar ele da gaveta e tentar algo, nem que seja simples, vamos ver no que dá."}]}