{"title":"Fake News – Hipsters #98","releaseDate":"29/05/2018","tags":["gerais","Podcast"],"people":["Paulo Silveira","Igor Valoto","Sérgio Lopes"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1749%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1749&t_u=https%3A%2F%2Fhipsters.tech%2Ffake-news-hipsters-98%2F&t_e=Fake%20News%20%E2%80%93%20Hipsters%20%2398&t_d=Fake%20News%20-%20Hipsters%20%2398%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Fake%20News%20%E2%80%93%20Hipsters%20%2398&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Marcelo Custódio","comment":"Apesar de terem cometido o erro crasso de omitir a origem do termo que foi a constante campanha de destruição sistemática e injusta de reputação de Donald Trump por parte da CNN e do resto da grande mídia esquerdista, o que levou o mesmo a chamá-la de \"Fake News\", este foi um bom episódio.Aconselho fortemente aos colegas, inconsciente e inadvertidamente influenciados por essa mesma mídia brasileira que copia e cola sem imaginação alguma o que a grande e rica mídia esquerdista americana produz a olhar essa brilhante animaçãozinha de 5 minutos apenas sobre o método da fake news:\n\n\nReproduzir\n\n\n Ocultar\n\n\n\n"},{"author":"Murilo","comment":"Bacana o episódio.Acredito que a maioria das FakeNews hoje alcança um público maior quando são compartilhadas por apps de IM como é o caso do WhattsApp, neste caso as empresas que produzem esses apps não poderia criar um mecanismo em que fosse possível verificar mensagens que são 'altamente compartilhadas' entre pessoas e grupos e assim colocá-las automaticamente em sites que investigam FakeNews? Geralmente o pessoal (leia-se família rsrs) simplesmente dá um forward ou copia e cola, por isso acredito que seja fácil ter um checksum das mensagens e assim obter um número de compartilhamentos para cada uma. Seria possível algo do tipo, ou as vezes já existe? rs"},{"author":"Ruthenio Muniz","comment":"Episódio sobre fake news muito fraco.  Primeiro que não falou sobre a origem do termo: eleições americanas onde Trump foi e ainda é muito caluniado pela grande mídia, assim como é caluniada qualquer situação que seja contra a agenda esquerdista. Dizer que a grande mídia hoje vende credibilidade é uma grande piada. A imprensa tradicional tenta banalizar o termo fakenews e tenta colar essa \"palavra\" às redes sociais. Sugestão de leitura aos participantes: Corrupção da Inteligência de Flávio Gordon"},{"author":"Paulo Silveira","comment":"oi Ruthenio, como falamos no episódio, tentamos evitar ao máximo entrar em política. E, em nenhum podcast do hipsters, a intenção é falar de definições, história, etc. Considero bem chato esse formato, mas tem gente que gosta, claro.` A imprensa tradicional tenta banalizar o termo fakenews e tenta colar essa \"palavra\" às redes sociais` confirma exatamente a nossa fraase que a imprensa tenta vender credibilidade: ela joga nas costas das outras mídias o problema da fake news e tenta fazer voce comprar os jornais e suas midias ao pensar/achar/acreditar que lá sim haverá a \"verdade\"."},{"author":"Marcelo Custódio","comment":"Paulo, vocês são fera, mas falar sobre fake news e omitir a origem do termo, no caso a campanha de desinformação ativa ( sugiro o livro \"Desinformação\" do ex agente do braço romeno da KGB Ion Mihai Pacepa bem como os vídeos no YouTube do ex-KGB Iury Bezmenov ) da mídia esquerdista CNN pra fritar a reputação de Donald Trump injustamente ( Na verdade até hoje continuam ) não é de forma alguma \"entrar em política\". É dizer a verdade.Eu sei como a Esquerda militante nrasileira é burra, histérica, autoritária, intolerante, violenta, policialesca, truculenta e não sabe refutar mas apenas REPETIR palavras de ordens e colar pechas ( de ontem pra hoje sofri com ALGUNS moleques desse tipo ) e ganhar no grito, são covardes e atacam em bando de serpentes mas pelo menos a menção da origem do termo valeria a pena."},{"author":"Tiago Aguiar Moreira","comment":"Muito interessante esse mundo de fake news que não é tão novo assim.Não sei se é o meu fone de ouvido, mas achei o áudio das falas muito baixo em relação ao áudio das músicas de transição."}]}