{"title":"Por trás do Hipsters: Caelum, Alura e Casa do Código – Hipsters #100","releaseDate":"12/06/2018","tags":["carreira","gerais","Podcast"],"people":["Maurício “Balboa” Linhares","Paulo Silveira","Guilherme Silveira","Sérgio Lopes"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1763%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1763&t_u=https%3A%2F%2Fhipsters.tech%2Fpor-tras-do-hipsters-caelum-alura-e-casa-do-codigo-hipsters-100%2F&t_e=Por%20tr%C3%A1s%20do%20Hipsters%3A%20Caelum%2C%20Alura%20e%20Casa%20do%20C%C3%B3digo%20%E2%80%93%20Hipsters%20%23100&t_d=Por%20tr%C3%A1s%20do%20Hipsters%3A%20Caelum%2C%20Alura%20e%20Casa%20do%20C%C3%B3digo%20-%20Hipsters%20%23100%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Por%20tr%C3%A1s%20do%20Hipsters%3A%20Caelum%2C%20Alura%20e%20Casa%20do%20C%C3%B3digo%20%E2%80%93%20Hipsters%20%23100&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Cirilo Lourenço Xavier Junior","comment":"Só hoje vi este episódio e o ouvi com uma certa dose de saudosismo.  Lembro de minha busca no final de 2008 por cursos mais avançados de Java aqui no Rio. Já conhecia a Caelum por causa das apostilas e ficava \"namorando\" os cursos. Como não tinha como ir para SP ficar 2 semanas fazendo curso, resolvi ligar e lembro de ter falado com a Ana Paula. Lembro de ficar tentando convencê-la que o Rio tinha mercado para bons cursos e até indicar pontos onde poderiam abrir as filiais. Devo ter feito, se não a primeira, uma das primeiras turmas do FJ-31 no início de 2009, mas já de olho no FJ-91. Aí tive aula com 2 pessoas: o Rodrigo e o figuraça do Nico que voltou a me dar aula no FJ-91 algum tempo depois!Fica aqui meus parabéns pelo trabalho e agradecimento por fazerem parte de minha formação profissional até hoje."},{"author":"Danilo Vieira","comment":"Aprendi java com as Apostilas da Caelum em 2008. Muito Obrigado !!"},{"author":"Danilo Pereira","comment":"Comecei com Java em 2004 e sou muito grato a galera do GUJ.... CV, Shoes, Rafael Steil, Luca Bastos... pra citar alguns.... teve o Crolmos tb que eu conheci nos cursos de verão do IME e chegou a me contratar! :DMuito obrigado gente!Eu tinha a impressão que a Caelum havia nascido a partir da experiência com os cursos de verão do IME, lembro das apostilas JCE - Java com Esforço (  péssimo nome -hahahaha ).Também tinha a impressão que o primeiro curso não Java havia sido de Ruby, na época uns Javeiros do GUJ foram trabalhar na TW e passaram a defender o Ruby on Rails e desdenhar do Java ( hahahaha ). Inclusive tive um amigo que foi para a Caelum ensinar Ruby, o Anderson Leite.14 anos já, meu Deeeeeus! :P"},{"author":"Danilo Sales","comment":"Aproveitando as curiosidades sobre a empresa, eu sou doido pra saber se tem alguma lógica por trás dos códigos dos cursos: FJ-11, FJ-26 ?"},{"author":"Cleberson Osorio","comment":"Caelum em Curitiba plz"},{"author":"leorocco","comment":"Uma sugestão pra diminuir ainda mais a taxa de evasão nos cursos da alura: que tal uma opção para \"espiar\" o curso? Sempre que me deparo com um curso interessante que não quero fazê-lo no momento mas apenas olhar os projetos ou o conteúdo abordado tenho que, necessariamente, me inscrever no curso. Isso é ruim em alguns aspectos: pra mim, que vai aparecer lá um curso \"começado e não terminado\", o que me gera, apesar de não tão significante, uma certa ansiedade desnecessária e pra vocês, que terão um aluno iniciando o curso sem, as vezes, a real pretensão de concluí-lo. Abraços (:"},{"author":"Ricardo Martinelli Oliveira","comment":"Sobre a questão dos ebooks da casa do código, eu gostaria de deixar meus 2 centavos a respeito do assunto:A Casa do Código é um modelo de sucesso de ebooks na minha opinião porque de verdade existe uma diferença de preço entre o modelo digital e o físico. Eu cansei de ver livros na kindle store em que a versão kindle é mais cara que a versão impressa. Isso já afugenta o cliente que não tem mais espaço em casa para livros físicos e precisa apelar para o modelo digital. Claro, isso não é justificativa válida para a pirataria, mas se realmente houvesse uma diferença de preço entre o livro digital e o físico tal que o digital fosse mais barato, duvido que existiriam tantas pessoas partindo para a pirataria (o número não chegaria a zero mas tenho certeza que diminuiria drasticamente).Sobre a Alura: Nem me importo se vou até o fim nos cursos. Pago mesmo, renovei para o terceiro ano e não me arrependo. Afinal de contas, estou ajudando o que eu vejo como um grande projeto de educação e que deve sim ser financiado cada vez mais.Por fim, um comentário rápido: Comprei o livro de ionic e fiquei super feliz em começar a fazer algumas apps mobile, mas para minha infelicidade descobri que agora o ionic está na versão 3 e o livro foi escrito na versão 2. Por favor, atualizem o livro (já falei por favor?). =D"},{"author":"Marcelo Custódio","comment":"Só posso dizer parabéns aos empreendedores!Escuto o Hipsters desde o lançamento."},{"author":"Luciano Cordeiro","comment":"Tive o prazer de presenciar o crescimento da Caelum quase lá no início. A empresa que eu trabalho estava procurando treinamentos Java e encontramos a Caelum. Caelum preparou um curso com uma ementa incrível, cobrindo os assuntos que precisávamos. E os instrutores : Paulo e Guilherme !!! Foi show !!!Depois daí, acho que só fiz treinamentos com a Caelum !!! Didática incrível!  Ainda hoje continuamos escolhendo alguns treinamentos com vcs ... só que agora com a Alura. Parabéns pelo grande trabalho !!!"},{"author":"Dias Neto","comment":"No começo eu achava que o nome do Paulo, era Paulo Silveira Selhost KKKKK"},{"author":"Paulo Silveira","comment":"gente, essa é a melhor coisa que ja li nos ultimos tempos"},{"author":"Tiago Aguiar Moreira","comment":"Quando o Linhares tava falando no final do cast e colocaram a risada dele no fundo deu um bug na minha cabeça hahaQue história legal. Parabéns pela trajetória. Esse mês renovei com gosto minha assinatura da Alura. Mais um ano para iniciar em novos cursos (e tentar terminar alguns haha)."},{"author":"Junior Osho","comment":"GUJ faz parte da minha vida profissional ! briguei muito para as apostilas da Caelum serem grátis kkkk, e falei muito de criar um Curso online pois não tinha em todo Brasil. Acho que entrei em 2004 ou 2005. Fantástico !"},{"author":"Daniel Zamora","comment":"Não tinha dinheiro para fazer os cursos da Caelum por sorte acabei ganhando um dinheiro na loteria e consegui pagar 3 cursos, que me ajudou a entender como funciona o front-end, tempo depois apareceu uma oportunidade de emprego na área de desemvolvimento back-end e me foi pedido que em um prazo de 1 semana, entregar um CRUD com Cakephp, pra minha sorte Alura tem um curso do framework, no fim consegui o emprego e só tenho agradecer a vocês muito obrigado e muito sucesso."},{"author":"Rafael Felipe","comment":"Sou usuário do GUJ desde o inicio (2004), teve um momento que parei de usar e assinei a alura um pouco antes do nerdtech (apesar de ser ouvinte do jovem nerd).Acho até que tive uma treta com o Paulo em algum momento no fórum (hehehe).Mas isso aí, vocês merecem o sucesso, continuem o bom trabalho. E acredito que estão revolucionando a educação, teve um nerdcast recente sobre a educação e vocês deveriam ter participado deste como convidados."},{"author":"Tiago Aguiar Moreira","comment":"Esse nerdcast sobre educação é um dos raros casos que ouço de mais de uma vez. Achei incrível o foi abordado e como as coisas mudaram e, infelizmente, como o Brasil está atrasado. Com certeza a participação do pessoal da Alura ia agregar muito."},{"author":"Rodrigo Dantas","comment":"Vida longa ao grupo!"},{"author":"Priscila Stuani","comment":"Que orgulho poder trabalhar com vocês!"},{"author":"Diego Brocanelli","comment":"Excelente episódio, fantástica a trajetória das empresas que admiro muito, onde trouxeram inovação para o mercado do ensino de tecnologia, sou aluno da Alura a anos e tem diversos livros da Casa do Código e sempre que me questionam se são bons digo que são EXCELENTES!"},{"author":"Nilton Filho","comment":"Concordo com o que o Paulo disse. Conheci a alura, caelum e hippsters através do jovemnerd. No inicio ficava pensando \"quem são esses caras?\", mas aí fui vendo cada vez mais que chegou uma hora que eu fiquei curioso e acessei o site dessa tal de Alura. Hoje sou aluno da alura e ouvinte assíduo do hipsters<3"},{"author":"Tiago Aguiar Moreira","comment":"Comigo foi parecido. Eu conheci a Alura pesquisando cursos online, mas ficava na dúvida de assinar. Quando saiu o nerdtech (e aquele desconto maroto) aí ne senti encorajada a assinar haha."},{"author":"Ricardo Silva","comment":"Parabéns, usei muito o GUJ uns 11, 12 anos atrás, sou assinante da Alura, já comprei livros da Cada do Código, usei e li muito as apostilas e blog da Caelum,  só falta fazer um curso presencial, mas acho que o que mais se destaca nessa jornada de vocês, é que além do lado comercial, vocês realmente gostam, vivem, respiram e estão envolvidos com esse mundo da programação e tecnologias relacionadas, acho que isso faz toda a diferença. Sucesso mais do que merecido."},{"author":"Raphael Lacerda","comment":"Que história parceiro. Deveria incluir esse cast como \"leitura\" obrigatória pra todo mundo que entra na empresa"},{"author":"Olavo de Carvalho","comment":"Dúvida, hoje ainda são vocês que administrão o forúm GUJ?parabéns pessoal!Aprendi muito com podcasts de vocês, eu sou do marketing e ouvindo alguns podcasts estou indo para área de dados."},{"author":"Paulo Silveira","comment":"somos nós sim!! e ele anda bem sozinho com o conteudo"},{"author":"Bruno Almeida","comment":"Que legal saber como o grupo nasceu! Quais são as inspirações, para vocês, de plataformas de e -learning?"},{"author":"Paulo Silveira","comment":"oi Bruno! O team tree house e o codecademy sempre mostraram muitas coisas legal. O datacamp tem um a boa plataforma mas está atrás de metodo e conteudo, mas a gente olha pra muitas, querendo sempre encontrar a nossa forma de fazer o estudo acontencer. Em especial a gente tem esse carinho por forum e interação"},{"author":"Carlos Ferreira","comment":"Quero deixar registrado meu parabéns a toda a equipe de vocês pelo sucesso. Tenho muito orgulho do sucesso de vocês e, como bem disse o Paulo, citando o Prof. Coelho, ter atrapalhado pouco a trajetória de vocês."},{"author":"Paulo Silveira","comment":"professor, nem sabe como fico contente de ler um comentário seu aqui!"},{"author":"Cleiton Dantas","comment":"Meus parabéns ao Hipsters e toda equipe Caelum que tenho acompanhado o crescimento dês da minha época de facu lá pra ~2010 com o GUJ e as apostilas FJ11 e FJ 22 que tanto me salvaram pela linguagem mais simples e sem enrolações e após alguns anos já como javeiro na empresa que trabalho consegui um curso presencial e Claro escolhi Caelum pela referencia no mercado, depois veio a casa do Código onde perdi as contas de quantos e-book já comprei, depois indiquei a minha empresa a disponibilizar os cursos da Alura para toda a equipe. Mas nesta historia toda o mais engraçado neste meio tempo eu já ouvinte do NerdCast quando um belo dia tava lá o Paulo fazendo um jabatech poucos meses depois ele anunciou o Hipister e logo no lançamento do primeiro episodio aqui estava eu. E hoje muito feliz por ver essa evolução que em vários momentos entrelaçou com minha historia."},{"author":"Paulo Silveira","comment":"poxa, ler alguém seguindo nossa trajetória dá muito orgulho!"},{"author":"Victor Ferreira","comment":"Foi um bom episódio mas faltaram falar das Stacks que vocês usam, etc."},{"author":"Diego Brocanelli","comment":"Excelente tema!"},{"author":"Maurício Linhares","comment":"Quem sabe no 150 :D"},{"author":"Paulo Silveira","comment":"pediram isso pra gente tambem! teremos :)"},{"author":"Welton Vaz de Souza","comment":"Bom dia,Eu aqui correndo para fazer uma API REST com PHP, para conseguir uma nova colocação! É tudo que eu sei hoje tem uma influência grande da Caelum, da Alura, da Casa do Código e do Hipsters. Um resumo, tenho 50 anos, trabalhando com Suporte Técnico! Antes aprendi no colégio COBOL, formei em 1987 e trabalhei um pouco com programação na época, depois a vida seguiu por outros caminhos. Hoje, tenho uma família, meu objetivo ajudar pessoas e aprender a programar, sou aluno do Alura,! Então o meu muito obrigado por tudo, meus respeitos e admiração a todos da equipe CAELUM e ALURA! Live long and prosper!!"},{"author":"Paulo Silveira","comment":"Fiquei muito contente em gravar esse episódio. Claro que esqueci de milhares de detalhes, pessoas, tentativas frustradas e alguns outros poucos sucessos, mas é o que cabe em 1 hora!"},{"author":"Raphael Figa","comment":"Paulo Silveira Obrigado Paulo os podcasts sempre são incríveis, e posso ter o Hipsters como um dos melhores e sérios. E foi bem interessante conhecer a história de toda empresa, mais que startup negócio de verdade!"},{"author":"Vitor Soares Pereira","comment":"Paulo, parabéns pela evolução e inovação proposta pela Caelum, Alura e Hipster.tech! Sempre acompanho de perto! Aproveitando, onde posso encontrar o artigo/notícia sobre a taxa de conclusão da Cousera)?"}]}