{"title":"Android P, Inteligência Artificial e Google I/O – Hipsters #101","releaseDate":"19/06/2018","tags":["mobile","Podcast","programação"],"people":["Paulo Silveira","Tais Batuira","Neto Marin"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1785%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1785&t_u=https%3A%2F%2Fhipsters.tech%2Fandroid-p-inteligencia-artificial-e-google-i-o-hipsters-101%2F&t_e=Android%20P%2C%20Intelig%C3%AAncia%20Artificial%20e%20Google%20I%2FO%20%E2%80%93%20Hipsters%20%23101&t_d=Android%20P%2C%20Intelig%C3%AAncia%20Artificial%20e%20Google%20I%2FO%20-%20Hipsters%20%23101%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Android%20P%2C%20Intelig%C3%AAncia%20Artificial%20e%20Google%20I%2FO%20%E2%80%93%20Hipsters%20%23101&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Tiago Aguiar Moreira","comment":"Sempre que vejo um robô da Boston Dynamics penso: \"que incrível\". Em seguida: \"imagina isso com uma metralhadora. Meu pai do céu!\". Pensei que só eu era paranoico hahaÓtimo cast. Agora estou aguardando o cast do Kotlin."},{"author":"Ricardo Silva","comment":"Parabéns pessoal, mais um podcast show, mas fiquei com uma dúvida, o Kotlin compila apenas nas versões mais recentes do android? Tipo, se eu desenvolver um novo app totalmente em Kotlin mas com compatibilidade com o Android 4, ele vai funcionar?"},{"author":"Luis Antonio","comment":"Kotlin usa o JDK6 ... usa a mesma vm, ou seja todas aquelas bibliotecas do android Java funcionam no Kotlin e os kits de desenvolvimento são compatíveis, porém acredito que ainda precise de algum plugin para interoperar entre as duas."},{"author":"Jilles Ragonha","comment":"Como sempre um prazer enorme ouvir o Neto Marin  discursando sobre android. O cara é fera :) Ansioso pela palestra dele no TDC tb."},{"author":"Junior Osho","comment":"Historicamente, o Java tem sido a única linguagem oficialmente suportada para o desenvolvimento do Android. Isso mudou no ano passado, quando o apoio Kotlin foi anunciado no Google I / O . Mesmo que o Kotlin ainda use o Java Virtual Machine e possa interagir com o código Java, existem algumas mudanças importantes que facilitam significativamente algumas tarefas. O Google continuou a melhorar o suporte ao Kotlin desde então, mais recentemente com a biblioteca Android KTX para o Android Studio . Como parte do Android P, os aplicativos escritos no Kotlin serão mais rápidos, especialmente quando se trata de loops. O Google também está trabalhando com a JetBrains (os desenvolvedores do Kotlin) para otimizar o código compilado, mas isso não depende necessariamente do Android P. EU NUNCA GOSTEI DO JAVA, NUNCA, NUNCA, NUNCA ! mas eu usava por que precisava ganhar dinheiro ! Python + Kotlin + Javascript + GO são linguagens que sinto prazer em usar ! Eu também não gosto de mulheres morenas, adoro uma LOIRA DE OLHOS AZUIS !"},{"author":"Di_fsantos","comment":"Esse podecast está show de bola, o Neto Marin  domina o assunto e o mais legal é que tudo que foi perguntado foi respondido com propriedade. Comecei estudar Android a pouco tempo e fiquei com mais vontade de aprender agora. Abraço a todos."},{"author":"Jilles Ragonha","comment":"Concordo plenamente"},{"author":"Shinodu","comment":"Episódio de Python não foi desta vez :("},{"author":"Paulo Silveira","comment":"to em divida!"},{"author":"Junior Osho","comment":"Python é o toque de midas na ML, Junto com a prima do pascal R tosca. Paulo Silveira  vamos ficar no aguardo dessa não muito nova \"modinha\". rsPython é muito legal, da para fazer umas gambiarras loucas, mas tenho muita dúvida na integração do BACK juntado aos trabalhos do PANDAS, essa especie de JOBs, ainda é muito estranho. WS SpringBoot em java vai receber um CÓDIGO Python que vai atualizar a Base ? ou o Python vai direto no Banco ? é muita dúvida. rsPYTHON URGENTE !"},{"author":"Welton Vaz de Souza","comment":"Se não der para falar de Python, poderia falar sobre as futuras mudanças da ORACLE, nas licenças do JAVA e o que pode acontecer para desenvolvedores e empresas?Se der para falar de PYTHON poderia convidar o LUCIANO RAMALHO ou BRUNO ROCHA(Twitter: http://twitter.com/rochacbruno )"},{"author":"Olavo de Carvalho","comment":"Olá amigos sempre um ótimo Podcast.Vocês sabem me dizer se Dialogflow  é o mesmo serviço Tensorflow?Abraço!"},{"author":"Neto Marin","comment":"Fala Olavo!Não, o Tensor Flow é o projeto para aprendizado de máquina, onde vc pode criar modelos e treiná-los pra usar nas suas aplicações.O Dialog Flow (ou conhecido antes como Api.ai) é para criação de chatbots e agentes para o Google Assistant e vários outros.Valeu!"},{"author":"Olavo de Carvalho","comment":"Nossa já usei então. conhecia ele pelo Api.ai , muito legal.Neto Marin  Valeu pela resposta amigo."},{"author":"Vinicios Lima Clarindo","comment":"Quero podcast sobre Flutter com esse Marin da Google ai ein !!!#ajudaeo"},{"author":"Junior Osho","comment":"Fluttttter usa dart ?"},{"author":"Neto Marin","comment":"Putz, eu conheço bem pouco do Flutter.É um produto de uma outra área aqui dentro e infelizmente não tive mto tempo de \"brincar\" com ele ainda. Sei apenas o que é público mesmo. :(Abraços"},{"author":"Vinicios Lima Clarindo","comment":"Poxa :/ mesmo assim fico no aguardo de um podcasts dos hipster... Obrigado pela resposta mesmo assim."},{"author":"Olavo de Carvalho","comment":"Agora só vejo falar de flutter =D fiquei curioso pra ver tbm."},{"author":"Vinicios Lima Clarindo","comment":"Testei aqui muito fácil fazer algo funcional nele"}]}