{"title":"Apps para SmartTVs – Hipsters #102","releaseDate":"26/06/2018","tags":["Podcast","programação"],"people":["Paulo Silveira","Bill Coutinho","Diego Santos","Maurício “Balboa” Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1791%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1791&t_u=https%3A%2F%2Fhipsters.tech%2Fapps-para-smarttvs-hipsters-102%2F&t_e=Apps%20para%20SmartTVs%20%E2%80%93%20Hipsters%20%23102&t_d=Apps%20para%20SmartTVs%20-%20Hipsters%20%23102%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Apps%20para%20SmartTVs%20%E2%80%93%20Hipsters%20%23102&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"pdR.","comment":"Uma grande dificuldade que sinto em relação ao desenvolvimento para TV é a documentação de algumas marcas (que é um pouco fraca na parte de exemplos) e a comunidade (que é pequena, o que dificulta a busca de soluções para problemas comuns). A ideia de fazer um app como um webview é realmente interessante. Fiquei curioso para saber se utilizam algum framework/lib JS (tal como React, Angular) ou se utilizam JS vanilla mesmo (se falaram isso no podcast eu acho que perdi, malz).Espero que esse ramo de desenvolvimento cresça e que apareçam grandes players que também tenham como foco a SmartTV, pois já é comum o desenvolvimento de apps web e mobile, agora podem incluir a SmartTV e fechar um bom app OTT.O podcast foi muito bom. Gostei de ouvir ideias e como solucionaram alguns problemas que ocorrem frequentemente."},{"author":"Tiago Aguiar Moreira","comment":"Apesar de um pouco curto, foi legal. Esses dias estava pensando mesmo como é o mundo de apps para tv's. Seguindo a mesma ideia, que tal um cast sobre apps para smartwatches? Acredito que eles estejam muito distante da realidade que a tv's vivem hoje."},{"author":"Diogo Oliveira","comment":"28:56 \"Aqui tem virgula\"Esqueceram um console.log no áudio kkkkk"},{"author":"Paulo Silveira","comment":"arrumado :)"},{"author":"Ednaldo Dilorenzo","comment":"Vcs acham que vai acontecer um movimento parecido com o mobile para consolidação do android tv para todos os players? Fico imaginando o trabalho também das empresas para manter esses SO's."},{"author":"Rodrigo Tognin","comment":"Muito legal o episódio. Gostaria que fosse maior com mais informações e curiosidades, rsrs.Fiquei surpreso quando foi dito que a linguagem utilizada é o JavaScript!Mais um motivo para estudar bastante essa linguagem.Valeu, abraços"},{"author":"Sebastião Relson Reis da Luz","comment":"Desenvolver pra Smart TV tem que ter muita \"Ginga\" mesmo.Rolou até uma saudade da Samsung Ocean, bons tempos.Como Sempre ótimo episódio. Abrax0:29 aqui tem vírgula :D"},{"author":"Maurício Linhares","comment":"\n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n"},{"author":"Tiago Aguiar Moreira","comment":"[Áudio com a risada do Linhares] agora imagine rs"},{"author":"André Kauling Justi","comment":"Podcast sobre kotlin e outro sobre python, plisss"}]}