{"title":"Um pouco de compiladores – Hipsters #105","releaseDate":"17/07/2018","tags":["Podcast"],"people":["Paulo Silveira","Douglas QMX Campos","Maurício “Balboa” Linhares","Roberta Arcoverde"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1823%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1823&t_u=https%3A%2F%2Fhipsters.tech%2Fum-pouco-de-compiladores-hipsters-ponto-tech-105%2F&t_e=Um%20pouco%20de%20compiladores%20%E2%80%93%20Hipsters%20%23105&t_d=Um%20pouco%20de%20compiladores%20-%20Hipsters%20%23105%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Um%20pouco%20de%20compiladores%20%E2%80%93%20Hipsters%20%23105&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Walison Moreira","comment":"Vocês conseguiriam apresentar um assunto muito complexo de uma maneira muito tranquila. Parabéns!"},{"author":"Cleyton Slaviero","comment":"Pessoal (do podcast e ouvintes), vocês podem ajudar na divulgação do abaixo assinado da SBC? não sei se já estão sabendo,  é uma abaixo assinado para o MEC incluir conceitos de computação na BNCC. Existe um texto mas são livres pra compartilhar da forma que for  o link.Prezados, a Sociedade Brasileira de Computação (SBC) elaborou um manifesto pelo ensino de conceitos básicos de Computação na Educação Básica. O objetivo é pressionar o Conselho Nacional de Educação (CNE) e o Ministério da Educação a incluir os conteúdos respectivos na Base Nacional Comum Curricular (BNCC). Peço a quem tem interesse no tema que, por favor, leia o manifesto e, se estiver de acordo, assine e ajude a divulgar o abaixo-assinado eletrônico: https://chn.ge/2NB2zpw.não encontrei outro local para falar com os hosts do programa então vai por aqui que todo mundo também pode ver :)"},{"author":"Junior Osho","comment":"Essa risada macabra do linhares assusta minha filha toda vez.( Maurício Linhares ), tive que mostrar tua foto por que ela falava que era um monstro ! :-)"},{"author":"Maurício Linhares","comment":"Monstro não, mágico! \n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n\n"},{"author":"Fernando Boaglio","comment":"Interessante vocês falarem de AspectJ, essa semana vi uma palestra falando do próximo hype depois de Kubernetes, que é o Service Mesh, que nada mais é de um AOP nas instâncias docker para controlar log, tráfego e outras coisas"},{"author":"Maurício Linhares","comment":"meu deus, nunca tinha pensado nisso, que horror."},{"author":"Paulo Silveira","comment":"This comment was marked as spam."},{"author":"Paulo Silveira","comment":"excelente Guilherme!!! obrigado pelos detalhes."},{"author":"Luiz França Dos Santos","comment":"Oi Paulo, que tal criar uma trilha mais hard core de Ciencia da Computacao, algo tipo uma revisao pra quem ja saiu da faculdade tem um tempo e apresentacao de assuntos  como Estrutura de dados, Grafos, Compiladores pra os q tiverem curiosidade ou iniciando, a propria Roberta falou no epsodio que ela recorreu ao youtube pra uma revisao. Acho q teria procura, eu mesmo me escreveria no Alura novamente! :-)"},{"author":"ThomThomThom","comment":"Eu já procurei inclusive se tinha algum curso para escrever um compilador ou interpretador. Que tal, hein Paulo!?"},{"author":"Eduardo Paixão","comment":"Tô com raiva... Não entendi nada kkkkk'"},{"author":"Jaison Pereira","comment":"PauloSilveiraScript essa eu não conhecia , consigo instalar via npm ?"},{"author":"Marc Pires","comment":"Outra referência é o http://createyourproglang.com, inclusive CoffeeScript foi criado usando os métodos descritos no livro."},{"author":"ThomThomThom","comment":"Já está na lista de compras! Sabe quantas páginas tem esse ebook? Obrigado."},{"author":"Bruno Costa","comment":"Fiquei interessado no video que a Roberta indicou de compilador em GO. Qual o link? Obrigado"},{"author":"Luiz França Dos Santos","comment":"Esse livro https://interpreterbook.com/ , num eh um compilador, mas quase...O author pra lancar um livro com um compilador completo, https://compilerbook.com/"},{"author":"ThomThomThom","comment":"É de fácil entendimento? Quantas páginas tem?Obrigado!"},{"author":"Roberta Arcoverde","comment":"Esse aqui. É do Rob Pike \n\n\nReproduzir\n\n\n Ocultar\n\n\n\n\n"},{"author":"William Oliveira","comment":"Aqui também tem um vídeo muito maneiro sobre compiladores, galera\n\n\nReproduzir\n\n\n Ocultar\n\n\n\n\n"},{"author":"ThomThomThom","comment":"Fantástico!!! Obrigado."},{"author":"Junior Osho","comment":"eu vi isso ao vivo !"},{"author":"Luiz França Dos Santos","comment":"Olhei o artigo no medium (https://medium.com/@kosamar... e o repositorio no github (https://github.com/kosamari.... Eh um bom artigo, explica bem as fases da compilacao, mas acho que e implementacao podia ser melhor usando autonomos.  Nao estou dizendo que nao vale a pena ler, como disse eh uma boa introducao, mas eh  bom ter em mente que falta uma parte."},{"author":"William Oliveira","comment":"Muito bom, Luiz França Dos Santos!Indica algum link maneiro sobre o assunto? (queremos :D~)"},{"author":"Luiz França Dos Santos","comment":"William Oliveira  num eh bem sobre compiladores, mas sobre como escrever um interpretador em GOLANG.. https://interpreterbook.com/ ,  eh o melhor livro nao academico q eu conheco sobre o assunto. O cara implementa objetos, tipos complexos como Strings array, implementa um REPEL, usa uns algoritmos mais sofisticados  para as fases da compilacao, sem usar bibliotecas de terceiros...eh bem legal, ele diz que ta pra lancar um livro sobre compiladores em breve."},{"author":"William Oliveira","comment":"\\o/Valeu demais, manooo!"},{"author":"Marcos Carneiro Lima","comment":"Essa palestra foi muito boa, na verdade, o evento como um todo foi muito bom."},{"author":"Sebastião Relson Reis da Luz","comment":"-vb Todos chora :'("},{"author":"Tiago Aguiar Moreira","comment":"Assunto hardcore, mas muito interessante mesmo. Se aventurar um pouco nesse mundo te dá um conhecimento muito legal para resolver outros probleminhas que possam surgir. Lembrei agora da minha matéria de autômatos.Off topic. Galera aqui do site do hipsters... quando clico dentro do campo de busca (o \"search\") aparecem duas opções. Um é o resultado de pesquisa que já fiz e o outro, no caos o primeiro, é este erro abaixo rs.\"Error: Multiple pixels with conflicting versions were detected on this page.    at v (https://connect.facebook.ne...    at https://connect.facebook.ne...    at https://connect.facebook.ne...    at Object.SignalsFBEvents (https://connect.facebook.ne...    at Function.f.__fbeventsModules.f.getFbeventsModules (https://connect.facebook.ne...    at https://connect.facebook.ne...    at https://connect.facebook.ne...    at https://connect.facebook.ne...\""},{"author":"Paulo Silveira","comment":"wow! que horror. vou dar uma olhada"},{"author":"Luiz França Dos Santos","comment":"Hispters raiz.....q saudade!!! Excelente episodio, parabens."},{"author":"Tiago Aguiar Moreira","comment":"Bota raiz nisso rs"},{"author":"Victor Ferreira","comment":"O @qmx falou sobre um livro que era uma melhor alternativa ao livro do dragão mas não disse qual era o livro. :("},{"author":"Roberta Arcoverde","comment":"Ha, ia perguntar a mesmíssima coisa!"},{"author":"Douglas Campos (qmx)","comment":"Engineering a Compiler https://g.co/kgs/eKoTD6"},{"author":"DoAssogue","comment":"Esse que é citado que tem uma nova edição em Python?"},{"author":"ThomThomThom","comment":"É legível por um humano?:PObrigado!"}]}