{"title":"Casos bacanas de Data Science – Hipsters #106","releaseDate":"24/07/2018","tags":["Podcast","programação"],"people":["Paulo Silveira","Larissa Lautert","Daniel Severo","Roberta Arcoverde","Maurício “Balboa” Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1847%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1847&t_u=https%3A%2F%2Fhipsters.tech%2Fcasos-bacanas-de-data-science-hipsters-106%2F&t_e=Casos%20bacanas%20de%20Data%20Science%20%E2%80%93%20Hipsters%20%23106&t_d=Casos%20bacanas%20de%20Data%20Science%20-%20Hipsters%20%23106%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Casos%20bacanas%20de%20Data%20Science%20%E2%80%93%20Hipsters%20%23106&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Maikel Penz","comment":"Mto bom o episódio ! Poderiam fazer um sobre Data Engineering. Eu trabalho como Data Engineer e a relação entre os dois times é diária."},{"author":"Alisson Reinaldo Silva","comment":"As vezes eu recebo email do Google Places me dizendo onde eu andei o mês todo, quantas cidades eu visitei, quantos restaurantes, etc. As vezes vem no celular um pedido para eu avaliar algum lugar que visitei xD"},{"author":"Paulo Henrique Silva","comment":"muito bom este post, referente ao numero do CPF solicitado é para emissão da NF, e facilitar o controle por parte do governo estadual e simultaneamente o federal."},{"author":"Tiago Aguiar Moreira","comment":"São muito bons esses episódios com cases de alguma tecnologia no mundo real. Muito legal a participação desses dois co-hosts. Falta mais aparições do Sergio do Lopes do Silveira Brother rs"},{"author":"Rodrigo Rezende","comment":"Caros, foi citado algo para transformar o notebook direto numa apresentação :D o que é? Acabei não localizando e preciso MUITO disso!"},{"author":"Diego Freitas","comment":"Não falaram do akinator, como assim? kkkkkkkkkkkkk'"},{"author":"Black Power Dog","comment":"Bacana o episódio. Eu só acho curioso o fato de todo mundo reclamar de spam, mas quando se trata de uma tecnologia usada pra que o anúncio de um produto que você pesquisou uma vez fique te perseguindo o resto da vida, é 'coisa bacana de data science'. Pra mim no fundo é a mesma coisa, puro spam."},{"author":"Maurício Linhares","comment":"hahaha, isso definitivamente não é bacana, pior, você compra um produto hoje e passa o resto do mês vendo propaganda da mesma merda."},{"author":"Junior Osho","comment":"GraphQL, Neo4j, Tensorflow,Pypher, Cypher on Node-RED  <---- TOP TOP TOP"},{"author":"Vinicius Roggério da Rocha","comment":"Alguém sabe a referência (link, artigo, ...) para o estudo que foi comentado do Airbnb sobre existir uma relação entre nebulosidade e reservas de hospedagem?"},{"author":"Paulo Silveira","comment":"Vinicius, aqui eles citam um pouco: https://medium.com/airbnb-e..."},{"author":"Cristiano Gonçalves","comment":"Eu nem ligo mais se sabem onde eu ando ou o que estou fazendo kkkkkkk"},{"author":"Willian Sa Carvalho","comment":"Ah bacana to inclinado a fazer meu TCC  sobre essa área , problema e refinar o tema rs."},{"author":"Lucas Gomes de Oliveira","comment":"sugestão de episódio... Desenvolvedores e profissionais que foram formados por seus pais que já atuavam na área, tá chegando dia dos pais e ainda é super pertinente na nossa área"},{"author":"Sebastião Relson Reis da Luz","comment":"Aproveito pra sugerir uma convidada pra esse episódio Camila Achutti"},{"author":"Sebastião Relson Reis da Luz","comment":"O Livro é o \"O poder do hábito\" q tem os casos das gravações e da targetA Disciplina de recomendação de produtos é a \"Inteligência Coletiva\"Um site bacana com datasets é o Kaggle como o Daniel chegou a falar no finalzinho junto com o Codenation"},{"author":"Roberta Arcoverde","comment":"Ele mesmo! Li no início do ano. :)"},{"author":"Welton Vaz de Souza","comment":"Fantástico podcast! A mineração de dados de farmácia é uma loucura, imagina, a mineração e do Data Science de DNA? Para farmácias, seguradoras e empresas de Saúde. Para que não lembra do exemplo da Target, tem um vídeo do Nerdologia:\n\n\nReproduzir\n\n\n Ocultar\n\n\n\n\n"}]}