{"title":"Tecnologias e Transformação Digital no Magazine Luiza – Hipsters #107","releaseDate":"31/07/2018","tags":["business","Podcast","programação"],"people":["Paulo Silveira","Leila Nakashima","André Fatala","Adriano Almeida"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1854%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1854&t_u=https%3A%2F%2Fhipsters.tech%2Ftecnologias-e-transformacao-digital-no-magazine-luiza-hipsters-107%2F&t_e=Tecnologias%20e%20Transforma%C3%A7%C3%A3o%20Digital%20no%20Magazine%20Luiza%20%E2%80%93%20Hipsters%20%23107&t_d=Tecnologias%20e%20Transforma%C3%A7%C3%A3o%20Digital%20no%20Magazine%20Luiza%20-%20Hipsters%20%23107%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Tecnologias%20e%20Transforma%C3%A7%C3%A3o%20Digital%20no%20Magazine%20Luiza%20%E2%80%93%20Hipsters%20%23107&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Ebson Silva","comment":"Muito bom  o podcast, realmente os caras tomaram conta do negócio da Dona Luiza.....Tecnologia, logística e data science  integrados não falham...Sou formado em logística trabalho a 12 anos com logística, e estudo no IFSP-SP Analise e desenvolvimento de sistemas...com certeza vou integrar as duas areas do conhecimento na minha vida profissional....Hipsters Ponto Tech parabéns, escutei a história da alura e caelum no CBN Professional e desde de aquele dia passei a seguir vocês...Tem me ajudado muito nessa nova area de TI que estou estudando...Valeu vocês são feras..."},{"author":"Lucas Palma Stabile","comment":"Ótimo podcast, ainda mais para mim que trabalha em e-commerce tmb! Sobre essa transformação e refatorações, teve alguma empresa pra ajudar, alguma consultoria? Pode ser bem complicado para um time conseguir lutar por refatorações no meio de várias demandas"},{"author":"Tiago Aguiar Moreira","comment":"off topic... galera do site, coloca um botão para compartilhar no linkedin, por favor."},{"author":"Tiago Aguiar Moreira","comment":"A história de tecnologia na magazine luiza é realmente inspiradora. Ter a coragem que usar tecnologias novas e a noção de começar aos poucos, dessa foram inovando. E o ponto mais incrível é o lab school. Por onde eu passei sempre bati nessa tecla! O time sendo capacitado pelo próprio time. Não tem como dar errado.Fora o desafio de fatiar um monolito em serviços e ir desacoplando aos poucos. Refatoração é vida!Não chegaram onde estão à toa. Parabéns galera do Magazine Luiza!"},{"author":"Giorgio","comment":"Excelente PodCast!"},{"author":"Junior Osho","comment":"Paulo Silveira  o André Fatala, falou sobre Banco Grafo ! saberia dizer se eles usam o meu amado Neo4J ? Eu sou o primeiro a comentar ! então a gambiarra que eu fiz usando beautifulsoup python FUNCIONA... não pode faltar a risada satânica do Maurício Linhares  cade ?"},{"author":"Paulo Silveira","comment":"eu nao fui muito atras, mas eu aposto que é o neo4j :)"}]}