{"title":"ASP.NET Core – Hipsters #108","releaseDate":"07/08/2018","tags":["Podcast","programação"],"people":["Paulo Silveira","Giovanni Bassi","Guilherme Costa","Marcelo Oliveira","Roberta Arcoverde"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1864%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1864&t_u=https%3A%2F%2Fhipsters.tech%2Fasp-net-core-hipsters-108%2F&t_e=ASP.NET%20Core%20%E2%80%93%20Hipsters%20%23108&t_d=ASP.NET%20Core%20-%20Hipsters%20%23108%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=ASP.NET%20Core%20%E2%80%93%20Hipsters%20%23108&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Alisson Reinaldo Silva","comment":"O .NET Core está evoluindo muito bem, no geral estou muito satisfeito com ele. Dei risada na parte das Razor Pages, eu também não sou muito fã xD"},{"author":"Marcos","comment":"top"},{"author":"Felipe Tofoli","comment":"Ainda vejo muitas pessoas com preconceito em relação ao .net por fazer parte do stack da Microsoft, ignorando toda a evolução que aconteceu nos últimos tempos.Trabalho com .net há alguns anos e posso dizer que nunca foi tão gostoso quanto agora!Parabéns ao pessoal do podcast, ficou bastante legal o episódio! Até o próximo!Abraços!"},{"author":"Rafael Felipe","comment":"Sou javeiro desde sempre, ainda trabalho com java. E após ouvir esse podcast, percebo uma tendência na mesma direção desse dotnet core e o spring boot.A principal diferença é que o spring boot é feito totalmente pela comunidade spring.OBS: uso muito o visual studio code, pra front end e pra gerenciar alguns projetos simples não java (tipo composições do docker ou projetos de documentação/especificação)."},{"author":"Paulo Silveira","comment":"bom ponto rafael!"},{"author":"Charles Messias Bezerra","comment":"Gostei desse EP108 já compartilhei com alguns amigos :D"},{"author":"Rafael","comment":"Como sempre, muito fera esse podcast"},{"author":"Guilherme","comment":"Aí sim! ASP.NET!!! Obrigado Hipsters!Como sugestão poderiam fazer um episódio sobre arquitetura e design patterns.Ps: .NET > all (bricadeira)"},{"author":"Ray da Costa","comment":"Gostei, acho válido...."},{"author":"PodTag - Podcast","comment":"O que acham sobre um episódio sobre GraphQL?"},{"author":"André Kauling Justi","comment":"Mais podcast de Dev backend- kotlin no desenvolvimento backend- python no desenvolvimento backend- graphql- etcPlisss"},{"author":"Paulo Silveira","comment":"estão na mira :)"},{"author":"Ray da Costa","comment":"E ai Paulo, tudo bem? Kra, muito legal o trabalho de vocês, sou ouvinte dos podcast (estou parado no 108), sou aluno na Alura curos on-line. Velho, gostei do 108, ASP.NET! Agora para ficar redondo... vc poderia fazer um PodCast sobre Java ( J2EE+EJB etc ). Kras que manjam... Vinicius Senger, Cleber Xavier, Bruno Souza... Vc deve conhecer os kras... Ia ser SHOW! Pense nisto!"},{"author":"Paulo Silveira","comment":"conheço! estao na minha mira assim que voltar de ferias. ia gravar um com o senger essa semana, mas ele teve um contratempo. virá!"},{"author":"Ray da Costa","comment":"Oooooo Paulo, que legal!!! que legal... ja estou ansioso...  eu vou dar uma cutucada no Senger ..."}]}