{"title":"Git e Github – Hipsters #109","releaseDate":"14/08/2018","tags":["Podcast","programação"],"people":["Paulo Silveira","Claudio Santoro","Roberta Arcoverde","Maurício “Balboa” Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1868%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1868&t_u=https%3A%2F%2Fhipsters.tech%2Fgit-e-github-hipsters-109%2F&t_e=Git%20e%20Github%20%E2%80%93%20Hipsters%20%23109&t_d=Git%20e%20Github%20-%20Hipsters%20%23109%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Git%20e%20Github%20%E2%80%93%20Hipsters%20%23109&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Cussa Mitre","comment":"Para os programadores Windows, utilizar linha de comando para fazer os commits era um processo doloroso. Hoje está se tornando melhor, mas antigamente linha de comando era um bicho de 7 cabeças. Na empresa que trabalhava, isso se tornou um problema tão grande, e as soluções visuais, como tortoise-git não era tão boas, que acabamos indo para Mercurial por ter no tortoise-hg uma ferramenta chamada HgWorkbench, que tinha uma configuração de tudo que você precisava.Segundo ponto, era que os valores para repositório privado no GitHub até um tempo atrás acabava sendo consideravalemente caro. Por isso, a empresa acabou indo, por esses dois motivos, indo para o Bitbucket, trabalhando com Mercurial. Coisa que hoje em dia é tão diferente. Ferramentas como o #GitKraken e #SourceTree transformaram essa utlização.E o Bitbucket permite repositórios privados para até 5 usuários de forma gratuita. Logo, para empresas que estão começando e precisam de repositórios privados, acaba sendo uma escolha melhor que o GitHub que para ter respositórios privados o custo começa em US$ 25."},{"author":"i'm Hironu","comment":"O que significa dizer que o repositório do linux é uma shadow?"},{"author":"Claudio Santoro","comment":"Significa, que é apenas uma cópia apenas leitura. :)"},{"author":"João BBN","comment":"- \"Nesse caso você não pode\"- \"Rejeitado!\"kkkkkMuito massa esse podcast, foi meu primeiro, mas com certeza não o último.Parabéns pessoal!"},{"author":"Tiago Aguiar Moreira","comment":"Prêmio de melhor frase do cast vai pro Linhares: \"primeiro que o source forge é uma merda\" kkkkkkk"},{"author":"Walison Moreira","comment":"O host e co-hosts salvaram esse episódio!"},{"author":"Evandro Teixeira","comment":"@PaPaulo Silveira e @MaMaurício Linhares gostaria de sugerir alguns temas para os próximos  podcast; 1° Sistemas Embarcados e 2° Sobre Linux Embarcado."},{"author":"Junior Osho","comment":"Cara fez o Linux não ficou satisfeito fez o Git e Agora está fazendo um Fork do Neo4J com Machine Learning !"},{"author":"Raphael G. Frantz","comment":"Poderia ter vindo antes esse excelente podcast... Conheci o GIT e seus comandos pelo caminho das pedras mesmo"},{"author":"Mayke Alisson","comment":"Bom dia pessoal, fiquei com uma duvida, na empresa que eu trabalho usamos SVN  no momento mais iremos migrar para git e usar o gitLab como server. Gostaria de saber de vocês porque escolheram usar o gitHub como server e não o gitLab? Vocês tem alguma dica para quem esta chegando agora no Git?parabéns pelo trabalho."},{"author":"Maurício Linhares","comment":"O gitlab veio depois do github, então muita gente que começou lá atrás não se interessa muito em migrar ou testar outros serviços. no início faltavam muitos features também, hoje já estão bem mais próximos então vai de cada um."},{"author":"Alex","comment":"O primeiro SCM da microsoft foi o horrível Visual Source Safe"},{"author":"Paulo Silveira","comment":"a compra foi boa :)"},{"author":"Fabrício Cabral","comment":"Adendo importante: o novo CEO do GitHub Nat Friedman (que por curiosidade foi um dos fundadores do GNOME) respondeu recentemente no Reddit um AMA (Ask Me Anything) sobre a compra do GitHub pela Microsoft e os rumos que o GH ia tomar. Segue o link:https://www.reddit.com/r/AM...Inclusive, um dos maiores medos da comunidade, era que a Microsoft acessasse do código fonte de diversas empresas que hospedam os seus códigos no GH. Perguntei diretamente e com todas as letras isso ao Nat, e ele não me respondeu (embora outro tenha respondido e achei o comentário bem coerente):https://www.reddit.com/r/AM..."},{"author":"Paulo Silveira","comment":"otimo fabricio!"},{"author":"Igor Fastroni","comment":"Muito bom, outro episódio espetacular. Parabéns"},{"author":"Bruno Almeida","comment":"Muito legal este episódio. Só queria adicionar um detalhe. A Microsoft quando comprou o Github além de se aproximar mais da comunidade open source ele comprou a empresa usando suas ações como moeda de troca. Ou seja não desembolsou nenhum dólar do se caixa pra isso. Link da matéria =  https://forbes.uol.com.br/n..."},{"author":"Henrique Brasileiro","comment":"Faz um episodio sobre linguagens da JVM"},{"author":"Ronaldo Prates","comment":"up"},{"author":"Niel Q.Santos","comment":"git commit -m \"iniciando download\""}]}