{"title":"Trabalho Remoto – Hipsters #111","releaseDate":"28/08/2018","tags":["carreira","Podcast","programação"],"people":["Paulo Silveira","Mateus Linhares","Willian Molinari Pothix","Roberta Arcoverde","Maurício “Balboa” Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1884%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1884&t_u=https%3A%2F%2Fhipsters.tech%2Ftrabalho-remoto-hipsters-111%2F&t_e=Trabalho%20Remoto%20%E2%80%93%20Hipsters%20%23111&t_d=Trabalho%20Remoto%20-%20Hipsters%20%23111%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Trabalho%20Remoto%20%E2%80%93%20Hipsters%20%23111&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Elías","comment":"Olá hipsters.tech!Seus podcasts, convidados, tretas e afins são demais! Parabéns! #keepLikeThisEntre tantas sugestões, gostaria de indicar um podcast sobre opções de abertura de empresa (MEI, PF), como receber, registrar salário, pagamentos como freelancer, quais seriam as características de um bom contrato de prestação de serviços (por projeto, tempo, etc), quanto cobrar pelo serviço (quais custos considerar na definição do preço e margem de lucro), etc.E abusando mais um pouco, sugerir também a possibilidade da transcrição de partes dos podcasts que vocês avaliarem importantes, dicas, nomes e links das tecnologias comentadas, no estilo alura aulas.Valeu!"},{"author":"Rodrigo Santos","comment":"A maior dificuldade que enfrentei (e continuo enfrentando), é a falta de entendimento e respeito com a minha necessidade de ficar em \"paz\" no meu horário de trabalho. Tipo, ser chamado de meia em meia hora pra ir na feira, ou carregar algo, isso é mega complicado."},{"author":"PotHix","comment":"Æ!!A forma de lidar com esse tipo de situação é bem pessoal, portanto eu vou dizer como eu sempre fiz e você escolhe se é útil para você ou não.Quando morava com meus pais, eu sempre avisava o meu horário para eles antes de trabalhar e me fechava no meu quarto com fone de ouvido. Se alguém aparecesse eu falava que estava trabalhando (como eu já tinha dito) e a não ser que fosse algo *MUITO* urgente, eu não ia parar até o horário que eu já tinha dito. As vezes as pessoas não gostam, mas isso é parte de vida. Se eu tivesse no escritório ia ser a mesma coisa.Deixar bem claro para as pessoas seus horários e objetivos é bem importante, assim fica um pouco mais fácil delas entenderem quando você falar não.Há braços--PotHix"},{"author":"Rodolfo Arruda","comment":"Ótimo episódio! Trabalho remoto ha oito anos e já enfrentei todos as situações mencionadas no episódio. O que é bem engraçado, porque situações com Banco e desaparecimento de membros do time já aconteceram.No começo foi fácil à adaptação porém na época morava na casa dos meus pais, o que complicou bastante pelo simples motivo dos meus pais acharem que eu estaria disponível para ajudar em qualquer tarefa.Trabalhei alguns anos para uma empresa em San Franscico, que quando estava em horário de verão, participava de reuniões as 20/21 hrs de uma sexta-feira, o que era bem tenso haha (Eu morando em João Pessoa - PB!)Atualmente, trabalho ha quatro anos para uma empresa localizada em Boston, o que considero uma timezone muito boa em relação ao BR (incluindo horário de verão). Recentemente largamos o office e passamos ser 100% remoto e funcionamos muito bem. Tinhamos um office muito legal com vários atrativos como stand desks, almoço, jogos, cervejas e etc... Porém o office sempre estava deserto e gerando custo para a empresa.Acho importante para quem trabalha remote possuir uma máquina de backup (se possível). Minha máquina já me deixou na mão umas 4x e varias vezes enfrentei problemas com o provedor de internet. O que é péssimo, no caso da máquina porque assistência sempre demorava uns 20 dias para resolver o reparo. Desde de então eu tenho uma máquina de backup (não tão boa como a principal) em caso ter problemas e uma conexão de internet mobile que consigo ao menos ficar online no canal da empresa."},{"author":"Mateus Linhares","comment":"Fala, Rodolfo.Você levantou um ponto excelente. Máquina de backup.Recentemente tive um problemão com isso e tive que usar uma muito abaixo do que eu costumava. Não foi nada fácil.Consegui recuperar, mas morro de medo de acontecer de novo.Ótima dica!Abraço!"},{"author":"Rodolfo Arruda","comment":"Cara, aconteceu ano passado da minha máquina dar pau e tive que usar uma outra máquina de 2007. Foi bem sofrido! hahaAbraço!!"},{"author":"PotHix","comment":"Æ!!Bem legal, Rodolfo. Eu sou bem preocupado com esse fato da maquina de backup. Acabei de comprar um computador novo porque estava com receio de algo acontecer com o meu computador principal. Vou deixar o atual com a minha esposa e deixar um dual boot com meu ambiente preparado caso eu precise dele como backup, já que ela nem usa muito o computador.Obrigado por adicionar suas experiências aqui ;)Há braços--PotHix"},{"author":"Rodolfo Arruda","comment":"Foi exatamente o que fiz, fiz o setup na máquina da esposa com um dual boot. Ela mal usa, mas ele está lá para quando precisar! hahaAbraços!"},{"author":"Alisson Reinaldo Silva","comment":"Eu trabalho bem melhor a noite e de madrugada. Como minha esposa trabalha a noite (12/36), após o almoço eu costumo ir passear com ela (ou ver TV), e começo a trabalhar a noite. Ela chega em casa 8h da manhã, a gente toma café e vai dormir xD"},{"author":"Roberto Oliveira","comment":"Excelente assunto... Gosto tanto que tenho um projeto para divulgação de vagas pra trabalho remoto. https://remotejobsbr.github...https://github.com/remotejo..."},{"author":"Fernanda","comment":"Vocês poderiam colocar no player do site uma opção para ouvir o áudio em diferentes velocidades, como 1.25, 1.50 e 2.00, semelhante ao que tem no youtube? Obrigada!"},{"author":"Fanime Fartoon","comment":"Concordo plenamente, sinto mta falta disso.Hoje eu acabo acelerando na mão mesmo com o seguinte código:document.querySelector('audio').playbackRate = 1.70"},{"author":"Ricardo Vieira","comment":"Vocês podem colocar uma lista de lugares para encontrar empresas assim?!"},{"author":"Tiago Aguiar Moreira","comment":"Vocês comentando sobre pessoas que sumiram... no meu primeiro trabalho tinha uma mulher que saiu pra almoçar como todo mundo faz todos os dias e nunca mais voltou. Sinistro rsrs"},{"author":"Nathan Tomaz","comment":"carai, eu ja fiz isso, depois de um feriado de fim de ano, no outro ano não voltei nem falei nada kkkk"},{"author":"Tiago Aguiar Moreira","comment":"Caraca rsrs. Mas ninguém ligou pra você nem nada do tipo? E depois pra arranjar outro trampo, como fica a carteira de trabalho?"},{"author":"Maurício Linhares","comment":"Você fugiu desse trabalho depois também? HAHAHAHA!"},{"author":"Tiago Aguiar Moreira","comment":"Sim, mas de uma maneira legal e recebendo a rescisão haha"},{"author":"Paulo Silveira","comment":"ok, temos uma campeã! mas realmente espero que ela esteja bem. se foi porque nao gostava do trabalho, que tenha encontrado algo que se encaixe."},{"author":"Tiago Aguiar Moreira","comment":"Tomara mesmo, mas esse tipo de atitude é muito bizarra. Simplesmente sumir. Teve um outro lugar onde trabalhei (esse mais recente) que o cara ficou com tanta raiva do lugar que um belo dia não veio mais trabalhar. Só ligou no dia avisando. Não voltou nem pra pegar a carteira. Mandou um boy buscar. Os profissionais da nossa área precisam ser estudados rs"},{"author":"Thiago Ramos","comment":"Eu trabalho remoto pra uma empresa americana e a solução mais viável pra pagamento foi pagar em BTC. Pra o pessoal da empresa foi a melhor coisa e pra gente também."},{"author":"igorsantos07","comment":"A discussão foi muito interessante! Eu já trabalho remoto há 2 anos pela Toptal (https://www.toptal.com/#obt..., e o episódio me trouxe certos alívios (como o jeito que a produtividade flutua quando você passa a ficar livre em casa e sem chefe no cangote, etc). Eu costumo dizer que no escritório rola uma \"pressão social\" pra que todos trabalhem, e isso acaba fazendo com que você seja mais ativo do que seria naturalmente no escritório - por outro lado, os ciclos de produtividade te fazem se sentir infeliz naqueles horários em que você simplesmente não faz muita coisa. Daí, ao invés de relaxar a cabeça, você ficava pilhado por não estar produzindo né? rsA Toptal é uma ótima empresa pra trabalhar. Apesar de ser freelancer, eles tem um volume tão alto de clientes (e de jobs) que eu nunca passei mais de duas semanas em \"entressafra\", no limbo entre um job e o seguinte. É possível pegar projetos part-time, full-time ou mesmo hourly, nas mais diversas áreas de programação, devops, design, e agora até em algumas áreas de business (PM e Finanças).O processo seletivo é BEM puxado, mas a dedicação para passar vale bem a pena, pois ao mesmo tempo que você passa a ser remote worker no Brasil (vivendo uma mágica onde seu pagamento vale 3~4x a moeda local), você não fica preso a projetos fixos. Dá pra variar o tipo de projeto, experimentar novas tecnologias e empresas... No final das contas, me fez muito bem pro crescimento profissional :)Pra quem quiser mais detalhes, seguem as landing das áreas que citei:- dev: www.toptal.com/developers/j...- design: www.toptal.com/designers/jo...- PM: www.toptal.com/project-mana..."},{"author":"Alan Gabriel Pereira","comment":"Muito legal o episódio. Aqui na empresa estamos no nível \"trabalhar remoto eventualmente\", porém tratam-se de situações totalmente esporádicas. Um dia chegamos lá, rs."},{"author":"Leonardo Souza","comment":"Galera... mesmo com as dicas que vcs passaram para receber pagamentos online, pareceu mais complicado se for comparado com a que eu ja utilizo. Eu recebo pagamentos pela Payonner(https://www.payoneer.com )  e nunca tive dor de cabeça. Tirando a parte chata de preencher um formulário, pronto e cobra uma taxa pequena. Eu recebo ha mais de um ano da Udemy pela payonner e eu atualmente trabalho para uma empresa que atua como API, presta serviços para Payonner e é especializada no mercado financeiro Brasileiro que é a PontualMoneyTransfer e USend.com"},{"author":"Roberta Arcoverde","comment":"Eu tenho uma experiência um pouco diferente das relatadas no episódio; sempre recebi como Pessoa Física, em banco \"do dia a dia\" (Citibank, depois Itau) e nunca tive problemas. Os bancos comem um bom pedaço do dinheiro na operação de câmbio (que sempre usa um cambio bem desfavoravel), mas via de regra, bastava mandar meu contrato com a justificativa da operação pra minha gerente via email e ela fazia o processo andar pra mim. A chatice é que eu tinha que ir no banco pessoalmente assinar contrato de cambio todo mês, mas o dinheiro caía na minha conta imediatamente.Recentemente precisei criar uma empresa pra receber por outros trabalhos, e aí alterei meu contrato com a Stack pra passar a receber como PJ. Depois dessa alteração, faço tudo online mesmo, pelo site do Itaú. Creio que esse trâmite de receber dinheiro de fora tenha ficado mais fácil recentemente, talvez antigamente fosse bem mais chato, ou então dei sorte :)"},{"author":"Alisson Reinaldo Silva","comment":"Comecei a trabalhar recentemente para uma empresa no Reino Unido. Eu criei uma conta no Remessa Online, eles te dão os dados de duas contas bancárias: uma no Brasil e uma lá no Reino Unido (eles tem em outros países, depende da moeda que você recebe). A taxa deles é bem baixa comparada com bancos. Também recebo como PJ, compensa na questão de impostos."},{"author":"PotHix","comment":"Æ!!E ae Leonardo. Acho que depende muito de como você recebe e do quanto você quer seguir alguns processos.Eu hoje recebo via corretora registrada no banco central (https://www.bcb.gov.br/rex/..., assim eu tenho um contrato de cambio certinho para cada uma das minhas transações. Caso tenha alguma fiscalização eu consigo mostrar todos os documentos e tudo mais.O processo realmente é um pouco mais chato que o normal, mas com a minha corretora até que funciona muito bem. Recebo o dinheiro na corretora, fecho o cambio por e-mail e recebo o dinheiro na minha conta pessoa jurídica. Não tem muita dificuldade. :)Obrigado pelo comentário.Há braços--PotHix"},{"author":"Leonardo Souza","comment":"Ótimo!! Depois de tanto tempo eu consegui trabalhar remoto para uma empresa e que não fosse para ser só um freelancer. Interessante quando o Maurício comentou que a pessoa quando escolhe trabalhar remoto pois parece que está \"deixando\" um pouco a carreira de lado já que fica mais difícil virar um gerente. Realmente isso vai de cada um e no meu caso a única promoção ou guinada que eu vejo na minha carreira, e acredito que outros pensem da mesma maneira, é a de ser gerente do próprio negócio ou não ser gerente de ninguém. E quando só o trabalho remoto não resolve, empreender liberta! :)"},{"author":"Roberta Arcoverde","comment":"Na Stack, todos os gerentes são remotos ¯\\_(ツ)_/¯"},{"author":"Leonardo Souza","comment":"Bom para quem pretende ser um gestor e ainda conseguir trabalhar remoto :)"},{"author":"Filipe de Holanda","comment":"É possível trabalhar remotamente em um emprego de nível Jr?? Existem muitas vagas?"},{"author":"Maurício Linhares","comment":"Infelizmente não tem muitas vagas pra Júnior mas se você tem pelo menos alguma experiência em alguma tecnologia que tem muita vaga vale a pena começar a aplicar."},{"author":"Filipe de Holanda","comment":"Valeu pela resposta Linhares!! Tamo junto, dale João Pessoa!!"},{"author":"Lucas Caton","comment":"Muito massa o episódio, obrigado por compartilhar a experiência de vocês! 🙂Eu trabalho há mais de 1 ano e meio remotamente em uma empresa que é mais do que \"remote-first\", ela é \"remote-only\". Todos os 35 programadores e os outros 10 funcionários que ocupam outros cargos, trabalham de casa. O escritório só existe por razões legais, mas ele não fica aberto e tampouco tem espaço ou equipamento para se trabalhar de lá.Eu escrevi um post com os desafios que encontrei, vou deixar como os meus 2 cents para a discussão: https://www.lucascaton.com.....Grande abraço!"},{"author":"Joao Silva","comment":"Que massa esse lance da empresa que você trabalha, cara! Atualmente eu trabalho como desenvolvedor - o primeiro da empresa empresa. Uma das coisas pelas quais estou reunindo o pessoal para debater e se organizar é a questão do trabalho remoto, sendo algo totalmente possível aqui mas nunca pensado. Esse podcast veio na hora certa, e tenho certeza que seu post me dará uma boa leitura."},{"author":"Roberta Arcoverde","comment":"Excelente post, Lucas. Gostei (e me identifiquei) particularmente com \"ter um espaço privado para fazer reuniões, evitar distrações e se manter focado no trabalho\". Isso realmente é muito importante pra criar um ambiente que desencoraje distrações e que tanto nós quanto quem nos visita (ou mora conosco) identifique como lugar de trabalho."}]}