{"title":"Startupismo da Real – Hipsters #112","releaseDate":"04/09/2018","tags":["Podcast","startup"],"people":["Paulo Silveira","Carol “Code” Soares","Marco Gomes","Startupdareal","Rodrigo Dantas"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1893%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1893&t_u=https%3A%2F%2Fhipsters.tech%2Fstartupismo-da-real-hipsters-112%2F&t_e=Startupismo%20da%20Real%20%E2%80%93%20Hipsters%20%23112&t_d=Startupismo%20da%20Real%20-%20Hipsters%20%23112%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Startupismo%20da%20Real%20%E2%80%93%20Hipsters%20%23112&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Nioshi","comment":"entrei no twitter da startup da real, e entendi pq ela falou tanta bosta no podcast..."},{"author":"Mariana Freitas","comment":"Eu amei o ep, mas confesso que tive uma dificuldade enorme em ficar ouvindo com essa voz... Sério. Estava tentando trabalhar e ouvir... Foi me dando uma agonia. Muito ruim."},{"author":"João P. Vanzuita","comment":"não concordo com bastante coisa, mas é muito legal ouvir o outro lado, nós só amadurecemos. mas em resumo..existe algo que é mt mais importante que tudo isso, que é conseguir entregar algo p/ o nosso planeta, que de alguma forma o deixa melhor, sendo empreendedor, ou funcionário, empresa grande ou pequena, o que importa é a entrega e a ajuda p/ fazer desse lugar onde a gente vive, um lugar cada vez melhor.pq apesar da turbulência, as coisas estão sempre melhorando e evoluindo."},{"author":"Lucas Messias","comment":"opa tudo bom ? Não curti esse ET Bilu, escutar enquanto trabalha é bem irritante, essa voz atrapalha. Fica minha critica para avaliarem =D"},{"author":"Nathan Tomaz","comment":"a vantagem de uma startup em frente as grandes multinacionais é justamente q ela pode \"por o pau pra quebrar\", virar noite msm, trabalhar pra caralho e fazer dar certo, isso é o diferencial. Mas isso não é pra vida toda, tem uma tempo limitado. Agora alguns de vcs criticaram tdo isso, com essa mentalidade não é atoa que o Brasil tem as startups menos inovadoras do mundo, perdemos até para o Chile aki na America Latina e poucos investidores querem vir para cá por conta da nossa burocracia..."},{"author":"Vinicius Giacomelli","comment":"Eu amei o podcast e vi um lado que as vezes fica de lado de conversas que buscam popularidade; a verdade!Mas gostaria de saber só uma coisa: a voz da(do) \"Startup Da Real\" está somente manipulada em tonalidade ou acelerada também? Você fala um bocado rápido! XD"},{"author":"Alexsandro","comment":"Uau!!! que Podcast incrível, parabéns pelo batepapo, as pessoas precisam ouvir isto aqui.."},{"author":"darioajr","comment":"Essa voz do ET Bilu ficou legal :)"},{"author":"Fernanda","comment":"Vocês poderiam colocar no player do site uma opção para ouvir o áudio em diferentes velocidades, como 1.25, 1.50 e 2.00, semelhante ao que tem no youtube? Obrigada!"},{"author":"Maurício Linhares","comment":"Mais uma seguidora da igreja da alta velocidade!"},{"author":"Fernanda","comment":"Só vejo vídeos no youtube assim! rsrs"},{"author":"Paulo Silveira","comment":"Esse comentário foi apagado."},{"author":"Paulo Silveira","comment":"ahhahaha. meio verdade"},{"author":"Wilder Barbosa Galvão","comment":"Cara, que episódio foda. Queria ressaltar só a importância da transparência contando uma história pessoal. Meu primeiro emprego foi em uma startup, uma fintech aqui de Recife. Cinco devs, três outras pessoas trabalhando em todo resto. Certo dia chega, chega todo mundo pra trabalhar e o dono manda a real: NO OUTRO DIA, ngm precisa mais vir pq a empresa tinha sido vendida pra um banco em São Paulo. Todo mundo tinha comprado a conversa do sonho de crescer com a empresa coisa e tal. Todo mundo pego de surpresa e tendo que se virar do dia pra noite, literalmente.Em contra partida, já trabalhei em multinacional em que os caras semestralmente abriam o livro de contas em reuniões gerais. O escritório de Londres teve X de lucro, o de Portugal Y, o do Brasil teve Z de prejuízo. Todos os funcionários tinham noção do estado da empresa e suas respectivas próximas ações e operações.Ser transparente com seus funcionários é essencial para toda e qualquer empresa. Quem discordar é clubista."},{"author":"João Luís Ribeiro","comment":"Pior podcast de todos, se ficasse só na parte de desuldir o cara que sonha com startup seria top, mas de resto ficou a desejar e muito. #maisMercadoEmenosCLT"},{"author":"João Luís Ribeiro","comment":"Vender bolo e café no ponto de ônibus é empreendimento sim, não pode ser o empreendimento dos sonhos, mas de fato É EMPREENDIMENTO. Tirando essa parte mais \"socialista\" eu concordo."},{"author":"Alisson Reinaldo Silva","comment":"Transparência é tudo."},{"author":"Roberto Rodrigues","comment":"Melhor episódio de todos os tempos do hipsters, não gosto quando o podcast fica parecendo papo de bar, como esse ficou, mas esse eu adorei, todos mandaram muito bem e fiquei feliz de conhecer mais a Star. Star, seria muito bom ter um podcast com você e seus outros vocês mas acho que assim você corre o risco de perder o anonimato. Vou ouvir novamente pois queria trocar umas ideias sobre democracia. Trabalhei mais de dois anos na Lambda3, um ano em um projeto especificamente  com o Giovanni, vivi muito isso na prática e gostaria de discutir sobre isso com vocês e os leitores, acho que tem bastante coisa legal sobe isso."},{"author":"Rodrigo Waltenberg","comment":"Prefiro programar num MAC do que receber auxílio alimentação #tragoverdades"},{"author":"Gustavo","comment":"Única coisa que não curto é esse circlejerk sobre quem é o startup da real. Pode ser qualquer um, não precisa ser esses figurinhas de sempre."},{"author":"David Paniz","comment":"O que mais me incomodava na época que trabalhava em startups eram as reuniões com o board/investidores. Os investidores querem retorno e não é pouco. O modelo de investimento de aceleradoras não foi feito pra encontrar dezenas de empresas que lucram um pouco, mas sim 1 empresa que retorne milhões. Investidor não quer ver um crescimento orgânico, sustentável. Ele quer ver o negócio crescer muito rápido e se for pra falhar, que falhe o mais rápido possível. Já vi times precisando mudar prioridade de backlog deixando de implementar funcionalidades que ajudariam a deixar a empresa mais rentável ou o cliente mais feliz, pra implementar feature inútil que o board pediu. Não é atoa que essa startup em questão já não existe mais.É muito triste ver empresas que poderia estar bem das pernas, pequeninha, mas vivas, gerando emprego e movimentando o mercado, fechando as portas porque foram espremidas até quebrar pelos investidores e eles ainda achandom bom. \"É sinal que o faltou fit ao mercado, é melhor investir em outra coisa\". Dane-se os empresários, funcionários e clientes.PS: Muito triste esses comentários criticando o posicionamento político dos participantes (fora daqui) ao invés de focar no conteúdo do episódio e focar no assunto. Esperava mais dos ouvintes."},{"author":"Rodrigo Waltenberg","comment":"Estava ótimo enquanto estavam focando no assunto de empreendedorismo, gestão, etc. Seu comentário em relação à pressão do board também foi muito pertinente.Ficou chato no epidósio quando começou aquele mimimi de funcionário incompetente. Esse tipo de mimimi só gera mais divisão e desemprego e é por isso que o pessoal faz rage aqui nos comentários."},{"author":"Fabio Soares","comment":"Startup da real não sabe do que está falando, alegar que o sonho de todo mundo que tem um pequeno negonio, vendedores ambulantes etc, sonham em ter um emprego com carteira assinada. Ela simplesmente acha que todo mundo é igual a ela. Eu mesmo, não quero uma CLT de forma nenhuma, já revisei inúmeras propostas e também comheco várias pessoas que trabalham por conta ou de forma flexível por conta própria."},{"author":"Rodrigo Waltenberg","comment":"Concordo plenamente. Desde que saí da CLT só melhorou a minha vida. Já recusei diversas propostas pra voltar pra essa que é a verdadeira escravidão."},{"author":"André Braga","comment":"Estou com você brother, no momento em que falaram que um cara que vende coxinha na frente da parada do ônibus não é um cara empreendedor, fico pensando o que seria um empreendedor na visão deles?"},{"author":"Paulo Silveira","comment":"oi Andre. Acho que essa é uma boa pergunta. Na minha opinião, é um empreendedor sim: tirou um negócio 'do papel' e se vira sozinho. Também acho muito legal ver isso acontecer em vários casos. O que soa um pouco estranho é usar esse tipo de exemplo de empreendimento como prova de que dá para todo mundo se virar muito bem sozinho, que o mercado dá um jeito em tudo, etc."},{"author":"Lucas Leandro","comment":"A Startup da Real, só saber reforçar a lógica do Empresário Malvado, Estado Bonzinho. CLT é uma bença de Deus e PJ ou Autonomo é um pecado.Obs: Eu trabalho com CLT, prefiro trabalhar assim do que PJ, a questão é que você trabalha como quiser e como puder pra pagar as contas, só saiba que você tem mais de uma opção."},{"author":"Alisson Reinaldo Silva","comment":"Se você prefere CLT, ótimo, mas não venha dizer que PJ é pecado. Eu prefiro trabalhar como PJ. Mas de fato, seria interessante se as pessoas pudessem escolher como trabalhar. Infelizmente, na maioria das casos, as empresas só oferecem CLT (não sei o motivo)."},{"author":"Rodrigo Waltenberg","comment":"Porque não querem o MPT no cangote deles enchendo o saco. A CLT é completamente engessada e corta as pernas tanto do empregador quanto do empregado"},{"author":"Fabio Soares","comment":"Verdade, cagou muita regra e está querendo reinventar a roda. Vender o sonho faz parte de qualquer negócio, começando por vc mesmo, depois sua equipe, clientes etc.   O mina prega uma transparência de 100%, quer dizer que não podemos mais valorizar nada, que já nos tornamos desonestos, temos que pegar todo mundo no colo e por pra nanar?  Startup é guerra, vc nao leva soldados para o front alegando que eles vão provavelmente tomar tiro e morrer, vc tem que dar um propósito e valorizar o que eles estão fazendo pelo país e por suas famílias. Triste das Startups que abrassarem essas ideias leite com pera."},{"author":"Wagner Alves","comment":"Muito bom! Vejo muito o que foi dito no minuto 42'15'' até 46''45. Estou ficando revoltado cada vez que entro no LinkedIn, 70% de pessoas vendendo sonhos e emitindo uma mensagem de que a sua vida é uma porcaria e que eles têm a fórmula mágica do sucesso."},{"author":"Rafael Felipe","comment":"Legal o episódio, entendo que algumas pessoas gostavam mais do perfil antes. Pois agora ele faz mais críticas sociais (com seu fundamento) do que antes. Antes zoava mais com a cultura das startups, mas como está tudo relacionado e é um ser humano a dona desse perfil, todo ser humano tem seu humor e seus momentos na vida (ora vamos pender mais pra um assunto do que outros).E uma crítica social minha, um pouco relacionada ao assunto. É que na área de desenvolvimento de software hoje em dia tem um monte de popstars do desenvolvimento, alguns frequentam o hipsters, não desmerecendo essas pessoas, mas parece que há uma cultura que pra você ser um dev de sucesso você precisa aparecer, fazer projetos opensource, estar nos foruns e ser conhecido.Gente, se você tem uma família, tem que se atualizar e principalmente TRABALHAR, você não tem tempo de ser um popstar do desenvolvimento, poucos tem essa capacidade.Não conheço a fundo muitos deles, mas posso apostar que muitos não tem filhos, se algum deles tiver e ainda sim conseguir ser visto, parabéns.E vejam, não estou falando que estes são maus devs, muito menos que aqueles que não são popstars (a maioria) são piores, deve ter muita gente melhor do que esses popstars por aí.Só pra quem ler isso pensar um pouco a respeito."},{"author":"Patricia Guollo","comment":"AMEI com força! #somostodosstar"},{"author":"Clayton Passos","comment":"Só 54 minutos? Ta de bincadeira né? Faz uma série... pelo menos uns 12 :D"},{"author":"Neto Junior","comment":"Sinceramente, para mim o StartupDaReal é um desserviço para a comunidade, na maioria das vezes só faz criticas não construtivas, só critica por criticar, além de colocar uns contra os outros, chefe contra empregado, divide homens das mulheres, homossexuais dos héteros, e toda hora fica tentando \"lacrar\", é muito mimimi,  fora os discursos políticos de esquerda. Poderia usar o tempo para fazer algo mais útil pela gente. Alô Hispter, tão sem assunto para os Podcasts?"},{"author":"Alessandra","comment":"É... eu acho que eu vou ter que concordar com você, no começo até gostava da Startup da Real, mas por fim tirei as mesmas conclusões também."},{"author":"Brendo Marinho","comment":"Ouvir o episódio, que está muito bom, não conseguiu, \"né\"?Só acho (mais) estranho, alguém vir no HipsterS (o S maiúsculo foi intencional, afinal é Hipsters, não Hispter, e, se foi sarcasmo, \"errou rude\", ainda assim), reclamar que fizeram um episódio falando sobre algo que é um hype, como Startups, e sobre a realidade de trabalhar nesses ambientes... com \"toda a certeza da dúvida\" estão sem assunto \"lacrador\"...Que feio Paulo + equipe, conseguiram um bot hater..."},{"author":"Neto Junior","comment":"O cara ficou puto porque eu não coloquei o S do hipsters, pelo menos dei opinião e não pití kkkEu racho o bico de cara nervosinho só porque eu não compactuo com tudo que o fake de estimação dele diz. É o mimimimimi de sempre... se você acha que StartupDaReal na maioria dos casos acrescenta algo na sua vida, tudo bem, pega seu Doritos e Coca-Cola e dê seu scroll."},{"author":"Brendo Marinho","comment":"Primeiro, não fiquei puto, não perco tempo com analfabeto funcional. Segundo, Netu, já que não importa escrever o nome certo, dê a minutagem do episódio em que discorda, aí, todos podem compactuar com a sua opinião, ou, apresentar em uma discussão os seus pontos.Como, provavelmente você não ouviu o episódio, e nem vai, volta lá para a página de comentários do G1, a comunidade não precisa de mais haters burros (que não se dão ao trabalho de ouvir, já reclamam pelo teaser do episódio)."},{"author":"Rodrigo Waltenberg","comment":"Pra alguém que \"não [perde] tempo com analfabeto funcional\" eu acho que você tá perdendo bastante tempo reclamando de alguém que você acredita que é assim. Cheio de ad hominem no discurso. No final sua crítica foi tão vazia quanto a que você está julgando."},{"author":"Brendo Marinho","comment":"Como não? Eu perguntei em qual minutagem está o que ele discordou e não obtive a resposta até agora, o que significa que a pessoa nem se deu ao trabalho de ouvir ao episódio e já veio comentar que não gosta das publicações da Startup da Real. Se não ficou claro nos comentários anteriores, era isso. E repito, estou bastante calmo, falta interpretação de texto aí para os \"ad hominem\", porque não fiz nenhuma crítica.A pergunta foi clara, em qual parte falaram \"besteira\"? Porque, se a parte for sinalizada, podemos ouvir novamente o trecho e refletir se faz sentido e se também discordamos do ponto levantado NO EPISÓDIO.Está em caixa-alta apenas para sinalizar que estou falando do episódio. Pouco me importa o perfil do Twitter, pois, o cast não é sobre o perfil, e sim, sobre a cultura que temos de startups \"salvadoras da Pátria\".E sim, o perfil deles no Twitter tem exagerado bastante... =)"},{"author":"Rodrigo Waltenberg","comment":"Okay, se a sua dúvida é genuína e não é só pra crítica, eu te ajudo a saber a parte que ele tá falando então. É só ver os comentários dela no último \"ato\" do episódio e comparar com o que os outros falam.Ela para de falar da parte empreendedora e começa aquele discurso de patrão malvadão, funcionário explorado, defendendo a tão defasada CLT, o roubo do salário do trabalhador por parte do governo. Dizendo que os caras vendem sonhos falsos.Falso o caramba, eu tenho há um bom tempo só trabalhado em ambiente de startup e conheço os CEOs pessoalmente. Os caras realmente acreditam naquilo. Muitos deles dão a alma pro negócio dar certo.O maior problema é que muitos funcionários vão trabalhar sem vestir a camisa e querem ser tratados com todo o glamour. Quanto mais você se dedicar, mais você vai ser reconhecido.Na empresa que eu trabalho agora, mês passado um dos programadores que trabalhava lá há 5 anos acabou de virar sócio. Ele nem precisou comprar a sociedade, foi dado a ele em reconhecimento pelo esforço dele em fazer dar certo. Estou lá há pouco mais de um ano e passei de um programador frontend pra líder técnico da área.Isso é só um dos vários exemplos que conheço. Tenho certeza que é essa a crítica que o Neto Junior estava fazendo, claro que somado ao perfil dela no twitter que só corrobora com a atitude que ela teve no episódio."},{"author":"Brendo Marinho","comment":"Obrigado por esclarecer a questão. Com o que falou, concordo.Mas, o que ela fala, por outro ponto, é real sim. Estou há 6 anos em uma agência digital que, te garanto que, se eu saísse hoje e nunca mais pisasse lá, pararia a demanda que dá mais retorno para eles. Hoje mesmo, fiquei bastante estressado, pois, outro \"JR\" como eu conseguiu o feito de demorar 8h para fazer uma demanda e, eu, como \"JR\" há 4 anos (e, único especialista nessa tecnologia naquele lugar), fiz em 2h30, entre 16h-18h30, quando voltei do \"almoço\", pago com um VR que não paga nem um lanche na região onde trabalho, que é a Av. Paulista...Detalhe, eu fiz 2 projetos parecidos nesse período, enquanto ele conseguiu fazer 1, no mesmo molde e ainda esquecer a principal metadata que garante que o projeto funcione em produção, que é o identificador do projeto.O pior é que, todas as vagas que surgem para eu ter uma carta de alforria daquele lugar dependem de tecnologias que eles se recusam a utilizar para manter os clientes utilizando IE8 (quando não é o IE7) e, porque, nenhum recrutador entende o motivo de um especialista em CLM estar há 4 anos sem uma promoção e, pessoas que entraram em 2016 terem virado líderes técnicos ou, até mesmo SRs...Perdão pelo desabafo, mas, sim, as empresas continuam nesse foco de explorar e não pagar 1/3 do que deveriam. Em 6 anos nesse lugar, o aumento que tive foi de 500 reais, até hoje. Na carteira está um valor, mas, todo mês descontam pelo menos 700 reais desse valor, não chegando nem em 2k o líquido, por um trabalho que nenhum outro \"JR\" consegue tocar sozinho...O perfil pode exagerar, mas, em nenhum momento ela está mentindo. O mesmo acontece em startups, não é só \"vestir à camisa\", se o chefe não quer, você não ganha. Nem se você for o melhor amigo dele..."},{"author":"João Santana","comment":"Brendo, li sua história e apesar de ser só um ouvinte randômico, te aconselho a procurar outro emprego. Fui te stalkear no Linkedin (desculpa =)) e vi que você está a bastante tempo nesta mesma empresa. Essa realidade que você apresentou, não vai mudar, os caras não vão te olhar um dia e falar \"olha, vamos valorizar o Brendo pq sim\". Se valorize bróder, trace um plano pra sair daí pq trabalhar assim é muito ruim. Vou listar algumas ideias, depois você me xinga:- Foco. Você gosta de SEO, Marketing, front-end. Defina o que você mais gosta - Estude. Pega o que você focou, e estuda. Vale tudo (Alura tá aí e nem é tão caro), mas leia livros, Youtube, Meetup, Workshop, cara de pau em perguntar pra pessoas que você admira como é o processo deles. Você está em SP, aproveita a cidade.- Não reclame. Eu sei que você tá boladaço, mas é bem provável que a \"energia\" que você chega assusta as pessoas, e por mais que você faça, seus chefes te verão como o reclamão, e não como o cara que entrega tudo que eles pedem. Gentileza gera gentileza.Agora pode me mandar à merda =D"},{"author":"Neto Junior","comment":"Perfeito Rodrigo, é exatamente isso! que nem preciso responde-lo mais. E ao contrário do que ele está dizendo, é claro que eu ouvi o podcast, não to criticando por criticar, por ser \"hater\" não é nada disso."},{"author":"Eduardo Tominaga","comment":"Calma mano, o cara só deu a opinião dele sobre o perfil da startup da real, entendeu? e você já tá partindo pra ofensa, relaxa"},{"author":"Rafael Pontello","comment":"Tapa na cara da sociedade!!!Episódio excelente recheado de verdades e piscinas de bolinhas."},{"author":"Thiago Vieira","comment":"É ele mesmo Maurício Linhares e ta deixando o Marcos Gomes ficar com a culpa hahaha"},{"author":"José Theodoro","comment":"Cara, eu acho que não. O sotaque não é de Recife. hahahaha"},{"author":"Maurício Linhares","comment":"Nunca diga que uma pessoa de João Pessoa é de Hellcife 😂😂😂😂😂😂😂😂\n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n"},{"author":"Rodrigo Dantas","comment":"hahahaha, to chorando aqui"},{"author":"Roberta Arcoverde","comment":"E nem o Linhares! De Recife sou eu :D a diferença maior é que pernambucano faz um \"shhh\", que nem os cariocas"},{"author":"Gabs Ferreira","comment":"Rapaz, não tinha pensado nisso."},{"author":"Frost Any","comment":"perfeito"},{"author":"Juliano Soares","comment":"A Startup da Real com certeza é o Maurício “da Real” Linhares!"},{"author":"Roberto Rodrigues","comment":"Eu acho que não, tem umas expressões que a Star falou que o Linhares não usa."}]}