{"title":"Grandes livros de Tecnologia – Hipsters #113","releaseDate":"11/09/2018","tags":["Podcast","programação"],"people":["Paulo Silveira","Roberta Arcoverde","Mauricio Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1901%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1901&t_u=https%3A%2F%2Fhipsters.tech%2Fgrandes-livros-de-tecnologia-hipsters-113%2F&t_e=Grandes%20livros%20de%20Tecnologia%20%E2%80%93%20Hipsters%20%23113&t_d=Grandes%20livros%20de%20Tecnologia%20-%20Hipsters%20%23113%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Grandes%20livros%20de%20Tecnologia%20%E2%80%93%20Hipsters%20%23113&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Glauber Ferreira","comment":"Acredito que a referência para o livro Devops Handbook está errada (68 páginas). O livro correto não seria esse aqui (480 páginas)?"},{"author":"Alexandre Pereira","comment":"Foi foi colocado na lista mas foi citado no episódio, Use a Cabeça! Padrões de Projetos. Melhor recurso que achei para aprender esse assunto. Muito didático."},{"author":"Jorge Borges","comment":"Eu sou um calouro entusiasmado vou tentar consultar todas essas pérolas, mas vou começar com o livro do \"Tal do Paulo silveira\""},{"author":"Rodrigo Santos","comment":"Estou procurando pelo livro físico \"O Programador Pragmático\" que foi citado, deve ser um livro excelente, pois até os e-books estão em falta kkkk. Se alguém souber onde encontrar a versão física, tenho muito interesse."},{"author":"Matheus Henrique Silva Felix","comment":"Estou no começo da facu e assim como a Roberta eu tó começando a programar agora e por sinal aqua  a gente foca muito em java por isso também fui atrás do Deitel,  e mano...A didática dele é técnica demais pra quem tá começando a programar, abandonei e to me virando melhor sem ele"},{"author":"Tacio Souza","comment":"Vou deixar uma contribuição básica aqui: o livro Linguagem C do luis damas, ótimo pra aprender c e lógica de programação, sem duvida um dos livros que mais gostei de programação, a didática e realmente muito boa, e tenho também uma história pra contar: quando tem prova de linguagem de programação aqui na minha faculdade todos os livros de c desaparecem!!! e quando termina a prova com consulta eles magicamente voltam na biblioteca.Ps.: tears in heaven e uma música muito boa!"},{"author":"Junior Osho","comment":"Clean CodeBook by Robert Cecil MartinThe Art of IntrusionBook by Kevin Mitnick"},{"author":"Matheus Catarino","comment":"Gosto muito dos livros Packt Publisher, tem uma boa didática. Principalmente no sentido introdutório.No sentido técnico, na minha primeira leitura como por exemplo \"C++ moderno explicado e aplicado\" fiquei boiando devido ser bastante extenso e complexo ao contrário do livro de Bjarne Stroustrup, já que segundo ele mesmo na CppConference disse que o intuito do ensino é explicar o entendimento do porquê e pra quê serve tal função/operação.Não sei qual a relação do C++ com beija-flor, segundo os autores pondo na capa de seu(s) livro(s)."},{"author":"Charles Agra","comment":"Jazz top de fundo hehe"},{"author":"Cussa Mitre","comment":"Vou deixar uma dica aqui: existe uma ferramenta (que foi feita através de colaboração da comunidade e está ainda em criação) que faz uma intermediação entre pessoas que querem doar livros e pessoas que estão interessadas em tal livro.www.sharebook.com.brQuem quiser doar ou ganhar um livro, pode dar uma olhada no site."},{"author":"jallisson jallis oliveira band","comment":"Como povo da minha região diz éguas o livro que eu aprendi a programar em Java, que é o Java Como Programar foi o mais criticado, certo que eu também na li ele todo, mais me ajudou muito pois gostava da didática, muito detalhista."},{"author":"Alexandre Torres","comment":"Maurício Linhares falando de como estudou nas férias para não ir mal na matéria. Eu como professor quase comecei a chorar de emoção. Maurício, você é o aluno que eu sempre quis e nunca tive..."},{"author":"Maurício Linhares","comment":"Hahahha, desespero faz isso com as pessoas."},{"author":"Paulo Sérgio Jr","comment":"Uma dúvida de alguém que está iniciando: O que faz com que um livro / artigo / tutorial seja considerado \"datado\"? Sempre fico na dúvida de quando vou pesquisar sobre algum assunto na internet e os top search results são de 5, 10 anos atrás..."},{"author":"Renan Frois","comment":"Creio que é quando a ferramente muda, por exemplo, vou fazer um tutorial sobre como fazer um app usando o android studio, porém daqui um ano o android studio lança uma versão nova, muda tudo, e a versão para qual você fez o tutorial entra em desuso. Ou então, se pensarmos em liguagem como o python e o java que tem versões novas, Java 9 , python 3, nas quais mudam-se algumas coisas. Pode-se ainda pensar em novas estratégias, mais eficientes ou melhores para determinado código."},{"author":"Victor Yuji Maehira","comment":"Se não foi mencionado, vai minha contribuição: \"Effective Java\". Eu li a versão antiga! Tem bastante boa prática para código Java.Compro mais livros do que leio, comprei a versão nova com programação funcional, mas ainda não digeri.Saindo da linha técnica, um romance que achei num sebo e influenciou minha decisão de continuar nessa vida massoquista de programador foi o \"Softwar - a Guerra Sem Armas\". É dos anos 80 mas as questões de espionagem digital continuam bem atuais como casos do Snowden."},{"author":"Maurício Linhares","comment":"Effective Java é muito bom também, mas evitamos indicar coisas de tecnologias específicas porque termina não sendo muito útil pra quem não trabalha com Java."},{"author":"Ronaldo Silva","comment":"Excelente episódio, gostei muito! Mas pra mim ficou faltando uma indicação de livro... Quando comecei a facul, isso em 2015, meu aprendi algoritmos em portugol e em C, o livro texto que o professor indicou era muito ruim, daqui caçando um melhor conheci o livro Linguagem C do André Bakes, minha vida mudou... rsrsrs Excelente livro, recomendo muito!"},{"author":"Lajaques","comment":"Só posso dizer que é muita coisa para ler! rs"},{"author":"Renato Dinhani","comment":"Gosto bastante dos livros Don't Make Me Think e The Lean Startup. Apesar de não serem sobre programação, eles me deram outra visão de como construir software porque são livros sobre \"Por que fazer tal coisa?\" e não \"Como fazer tal coisa?\"."},{"author":"Gabriel Maia","comment":"Porque não curtir o Bob Martin, do Clean Code?"},{"author":"Roberta Arcoverde","comment":"Bom, eu pessoalmente acho ele meio chato pelas posições profissionais mesmo. Ele costumava dizer que \"programador que não faz A ou B não é profissional\" e essa cagação de regra me caaaaansa. Aí ele publicou uns textos bem pobres em argumentação e bem senso-comum sobre, por exemplo, o famoso memorando do programador da Google que dizia que mulheres eram biologicamente menos aptas pra programar que homens ¯\\_(ツ)_/¯"},{"author":"Alexandre Pereira","comment":"Meio complicado que você deu a entender que ele falou isso também. Melhor cada um ler e ter sua própria opinião sobre sua obra. Pra dizer a verdade, é a primeira vez que vejo um hate assim em relação na obra dele, mas ok, é questão de opinião mesmo."},{"author":"Roberta Arcoverde","comment":"Ah sim, obrigada por me ajudar a esclarecer. E hate é meio forte, eu diria que é só um dislike mesmo. É curioso (e super interessante) pra mim ver como as pessoas são plurais; vc comentou que foi a primeira vez que viu o \"hate\", ja eu conheço um tanto de gente que não curte tanto o trabalho do Robert - talvez mais do que gente que curte! :)"},{"author":"Alexandre Pereira","comment":"Interessante, é o segundo episodio aqui que escuto com todo mundo falando mal dele, um dislike talvez seja fraco. Deve ser um meio termo rs.. O legal do mundo é ele ser plural(evitando extremismos claro), se todo mundo pensasse diferente seria meio chato ne."},{"author":"André Castilho","comment":"Meu deus.. parem de julgar o tio bob pelo que ele não é... leiam o que ele tem a falar se aprofundem e aí sim, tirem suas conclusões. Ele nunca disse que mulheres são inaptas.. muito pelo contrário, ele apenas levantou a discussão, o \"awareness\" da disparidade de genero na nossa área. Coisa que não existia quando ele começou a carreira. E pra quem não leu os livros ou prefere vídeos, ele tem uma serie de videos aulas sobre o clean coders que valem muito a pena."},{"author":"Roberta Arcoverde","comment":"Ah sim, mas não foi isso que eu disse; o artigo dele, na minha opinião (eu li!), foi pobre e cheio de senso comum, ao comentar o memorando que dizia, sim, que as mulheres eram menos aptas (não inaptas, e não unânimes). Mas como falei, meu problema com ele são as posições profissionais mesmo -- o alarmismo e a cagação de regra. Eu li três livros dele, e penso que há autores melhores, de novo, na minha opinião."},{"author":"André Castilho Filho","comment":"comprei um kindle justamente para ler esses livros que você indicou e verificar a procedência. Já estavam na minha lista a algum tempo, mas acabei trocando a leitura pelos cursos em vídeo e afins (cleancoders, domainlanguage, pluralsight) Enfim, preciso reacender  minha paixão pela leitura, e esse episódio foi um gatilho muito importante. Por isso, muito obrigado."},{"author":"Marcelo Velasquez","comment":"Vixi, ja fui recomendado várias vezes ler este livro, ainda bem que nem comprei, um cara que fala uma asneira desta que a Roberta citou tem que fazer um CLEAN  em sua mente"},{"author":"André Castilho Filho","comment":"exceto que ele não falou nada disso que ela sugeriu...cuidado com os \"influencers\" que você adota.."},{"author":"Roberta Arcoverde","comment":"Correto, não foi o Martin que disse que as mulheres eram biologicamente menos aptas pra programar, e sim o famoso ex-Googler. O Martin fez outras analogias, em outros textos, de gosto duvidoso. Mas recomendo sim a leitura, até pra cada um ter suas conclusões."},{"author":"Maurício Linhares","comment":"Yup, todas essas regras pra ser programador são uma coisa muito desnecessária."},{"author":"André Castilho Filho","comment":"menos testar.. pra mim, independente de usar TDD ou não,  escrever testes é uma disciplina essencial para nossa área...se vc não escreve teste, além de estar se auto-sabotando, está dificultando a vida de outras pessoas"},{"author":"Maurício Linhares","comment":"hahaha, a galera do stackoverflow não testa e estão aí rodando tranquilamente. eu não faria isso, mas cada um sabe pra onde vai :D"},{"author":"Renato Dinhani","comment":"Porque a visão política dele é diferente do que manda a regra."},{"author":"André Castilho Filho","comment":"também senti isso quando ouvi comentários que o Robert não é uma pessoa legal...Ele pode ser alarmista sim, mas muito do que ele prega, tem sim fundamentos, e ele expõe muito bem suas idéias e argumentos em defesa da qualidade e responsabilidade que almeja para nossa área. Ele ainda tem a coragem de se posicionar politicamente e abrir espaço para um bom debate, levantando questões complicadas que afetam de alguma forma a nossa profissão. Sem contar que ele está com 66 anos e ainda na ativa, escrevendo código!"},{"author":"Victor Antonio Barbosa","comment":"Acabei de ler \"O programador apaixonado\" hoje, muito bom!"},{"author":"Tony Costa","comment":"Muito bom. Parabéns!"},{"author":"Rodrigo Vieira","comment":"Parabéns pelo podcast! Muito legal mesmo!Agora uma curiosidade: concordo com as comparações que fizeram dos livros do Uncle Bob com os livros dos demais autores. Mas queria saber um pouco mais sobre as críticas que fizeram a ele. Gosto muito dele como autor, e justamente por isso quero saber o que ele já fez de \"não tão bom assim\" :DSobre a casa do código: simplesmente a O'Reilly brasileira! Abraços!"},{"author":"Marcelo Velasquez","comment":"Vou citar , mas acho que não se compara aos que os Hosts  disseram,  aliás destes citados, eu só conheço 4, mas um livro que me ajudou muito na época de faculdade,  e ainda era pascal  foi um livro do Niklaus Wirth, chamado  Algorithms and data structures, lá mostrou noções de alguns algoritmos  de sort,  de árvores, hash, backtrack foi bom para ter uma base"},{"author":"Marcelo Custódio","comment":"Lembro da época dos \"bichinhos da O'Reilly\"... Agora, quer ser herói mesmo? Tenta ler de cabo a rabo o \"Object-Oriented Software Construction\", 2a edição, do Bertrand Meyer!"},{"author":"Maurício Linhares","comment":"Esse aí é chato de morrer mesmo, não consegui terminar."},{"author":"Augusto Xavier","comment":"Este programa ficou épico! Parabéns!"},{"author":"Thiago Ramos","comment":"O livro DDD só fica bom do meio pro final. Quando falo, fica bom, o que eu quero dizer é: O livro começa a ficar mais legal a leitura. No inicio até uns 55% do livro, exige muita força de vontade pra ler. Embora eu ache que o livro é bem denso e por isso deve ser lido devagar."},{"author":"Luís Aurélio","comment":"Tenho mais de 100 livros na minha casa e sempre vou comprando mais, fora os livros da Casa do Código que estão no meu tablet (sou um cliente fiel de vocês) e os que estão no Kindle.Mas um livro que guardo com carinho é o \"Segredos do Ninja Javascript\" da Manning (e das suas capas de roupas medievais). O cara mostra diferentes formas de escrever códigos em JavaScript, levando a uma programação mais profissional. Esse livro é demais."},{"author":"Vagner Fonseca de Freitas","comment":"Pessoal, o meu primeiro livro de tecnologia foi o Clipper - Versão Summer 87 do Antonio Geraldo da Rocha Vidal. Por aí vocês já calculam a minha idade, tudo bem que eu era moleque. Devorei o livro, li e reli várias vezes, mas como não tinha um PC não conseguia praticar. Quando tive acesso a um computador parecia que já sabia programar em Clipper havia anos de tanto que memorizei o livro, rs.Gostei de vários livros que foram citados, mas como trabalho no mundo \"corporativo\" por toda minha carreira, um livro que me ajudou, e ainda ajuda, muito é o Working Effectively with Legacy Code do Michael Feathers. Ele apresenta várias técnicas para lidar com aplicações legadas e até fazer refatoração nas mesmas.Aproveito a oportunidade para sugerir um tema para o podcast. Queria sugerir uma discussão sobre a formação dos profissionais de desenvolvimento de software. O fenômeno dos bootcamps (que ainda não chegou no Brasil), cursos técnicos, cursos livres, cursos universitários, etc.Paulo, você conhece a 42 School? https://www.42.us.org/Em tempo, a Roberta é a host que faltava ao Hipster.tech, encaixou como uma luva.Abraços."},{"author":"Welton Vaz de Souza","comment":"Dos livros citados neste episodio o único que li, ainda é tive que parar reler outras coisas para entender certos conecitos e voltar para ele, foi o Algoritmos - Teoria e Prática (Português) 3o. edição, paquei R$150,77 numa promoção da AMERICANAS.COM. Eu já era fan do Mauricio Linhares por causa das \"tretas\",  mas declarações dele sobre o livro fiquei mais aliviado!. Mas depois que descobri um \"resumão\" do Cormen sobre este livro, lançado ano passado já estou programado rele-lo de novo até o final do ano. O livro em questão é \"Desmistificado Algoritmos\", https://goo.gl/BwzQn7Se vc quer saber só um pouco o assunto, esse já é suficiente, se vc quer arranjar um emprego fora do Brasil, vc tem que ler estes dois e mais a lista completa que vcs sugeriram no mínimo!Acho que ficou uma \"puxasão de saco\"  para Java e C# no programa, por vcs serem \"javeiros\" de carteirinha. Mas Como sugestão:- Python Fluente - Luciano Ramalho - Obra sensacional e completa sobre Python, apesar de ser pra quem já programa e conhece bem os conceitos da linguagem, essa obra nos torna programadores Python melhores. Super recomendo para qualquer profissional e/ou estudante que programe em Python. Já sugeri uma vez para o Paulo Silveira. E volto a frisar o Luciano tem que ser entrevistado por vcs, pessoa sensacional é só ver as palestras dele disponíveis no youtube.- Python Cookbook (Português) - por David Beazley,‎ Brian K. Jones - Editora Novatec - Livro muito prático e altamente didático, com exemplos muito úteis. Recomendo para desenvolvedores com certa experiência em python que queira melhorar ainda mais suas habilidades.Mais um excelente episodio do Hipsters! Parabéns!!"},{"author":"Leandro Sá","comment":"Gostei bastante do episódio, muito bom e saudosista ao mesmo tempo. Um dos primeiros livros que comprei foi de vb6, não lembro ao certo o autor e editora. Já na faculdade comprei o Java Como Programar do Deitel, tambet nunca o li. Comprei também o Programador Pragmático e o achei excelente. Esses dias passei na livraria e vi o livro de DDD do Evans e quase comprei; depois desse podcast, tenho certeza que não irei comprar, rsrsrs. Foram muitos clássicos, senti falta de livros mais recentes. Concordo que existe muita modinha, atualmente se fala muito de Containers e Nuvem. Mas de modo em geral, qual livro de hoje poderia se tornar o clássico de amanhã? Sinto falta de boas indicações recentes.Grande abraço a todos e vocês fazem um excelente trabalho."},{"author":"Maurício Linhares","comment":"O que vale como recente, 5, 10 anos? :PEu recomendaria:* Os dois livros de SRE do Google: https://landing.google.com/...* Devops handbook: https://itrevolution.com/bo...* Functional programming in Scala: https://www.manning.com/boo...* Working effectively with legacy code: https://www.amazon.com/FEAT...O maior problema é que livros de tecnologias específicas (e esses tem aos montes) morrem muito rápido, então livros que vão durar por muito tempo são poucos."},{"author":"Paulo Silveira","comment":"tambem gostaria de saber dos recentes, o que poderia virar um classico"},{"author":"Gracyane Oliveira","comment":"Esse comentário foi apagado."},{"author":"Gracyane Oliveira","comment":"Entrei para a faculdade de Engenharia de Computação aos 30 anos, estou formada e atuando na área. Tenho uma outra graduação e estava trabalhando quando decidi mudar de área. Quando decidi não fiquei pensando se poderia dar certo ou não, apenas decidi e segui em frente, não tive dúvidas.Minha faculdade foi em período diurno durante todo o curso. Consegui um estágio no final do 2º semestre e a partir daí consegui me manter com a reserva financeira que tinha e com o que o estágio oferecia. Durante muito tempo tive que abrir mão de sair e de comprar uma roupa melhor...eu comprava livros, e pra mim isso não foi tão difícil, talvez pra algumas pessoas sejam.Se computação é uma paixão pra você e ninguém está te impedindo de seguir, vá em frente. Em nenhuma profissão tem-se 100% de mar de rosas. Mas aquilo que nos realiza profissionalmente faz com que suportemos todas as dificuldades. Em muitos momentos da minha jornada achei que nunca conseguiria programar, desenvolver um software completo, mas segui em frente, pesquisei, fiz cursos, aprendi com colegas, e venci, passei por essa fase ruim, porque não desisti. Ainda tenho muito o que aprender.Não baixe a cabeça e não fique muito tempo olhando o quanto os outros evoluíram, tome a sua decisão e siga em frente, não desista."},{"author":"Maurício Linhares","comment":"Cara, se você tá se achando velho com 27 anos, acho que vou ficar com depressão aqui :DTem muita gente sim entrando no mercado depois dos 30, muita gente trocando de área, eu não sei como estão os cursos técnicos ma se você ainda tiver condições de ir pra uma faculdade, nem que seja num horário noturno, dá sim pra você entrar no mercado."},{"author":"Welton Vaz de Souza","comment":"Eu tenho 50 anos e sou aluno do Alura - Cursos Online e estou procurando estagio e fazendo pequenos trabalhos na área. Nunca é tarde para começar!"},{"author":"Hermes Passer","comment":"Eu estava procurando por bons livros de tecnologia ontem mesmo, acertaram no timing."},{"author":"Leonardo Lucas Lana","comment":"Ri demais quando a Roberta disse que o livro de Domain Driven Design que era muito chato e seco. Senti isso na pele a algum tempo. Mas não tem como negar que o conteúdo não é bom. Realmente é bom, curti bastante quando li durante meses kkkk"},{"author":"David Paniz","comment":"Jurava que o Paulo ia colocar o \"O mítico homem-mês\" do Brooks na lista. Acho que com tantos anos de metodologias ágeis ele é meio mais do mesmo, mas é um dos grandes clássicos e sempre um bom presente para aquele gerente mala.Também sou muito fã da série \"use a cabeça\" (Head first), só com ele que consegui aprender os design patterns porque eu não aguentei ler o GoF :)Pra mim o livro que faltou na lista foi o (GOOSGT) \"Growing Object-Oriented Software, Guided by Tests\" de Freeman e Pryce.Meu primeiro livro técnico foi um da série \"for dummies\", o \"Java para leigos\", mas nem lembro se foi útil ou não."},{"author":"Maurício Linhares","comment":"Ele ainda é melhor que 90% dos livros de agilidade por aí viu hahaha!"},{"author":"Roberta Arcoverde","comment":"Eu gostei muito do GOOS, um dos meus favoritos! Talvez o que melhor me ensinou sobre como aplicar no trabalho o que eu lia por aí no saudoso Google Reader (na época os blogs de tecnologia só falavam em TDD e suas variações). Realmente tinha muito livro pra recomendar mas o tempo, como disse o Linhares, é curto :)"},{"author":"Fernando Seguim","comment":"Um livro muito bom que eu li e recomendo bastante é o \"Test-Driven Development Teste e Design no Mundo Real com .NET\" do Mauricio Aniche, que me ajudou muito no início. Acho que existe outras versões do livro em Java e Ruby. Independente de você ser adepto ou não de TDD, esse livro é bom pois dá ótimas dicas para escrever seus testes. É um livro muito bom para que já tem uma boa noção de programação e quer melhorar a qualidade do seu código."},{"author":"Luiz França Dos Santos","comment":"Paulo, no curso do Cursera o Sedrick melhorou Java, usando herenca, generics...."},{"author":"Paulo Silveira","comment":"eu nem sabia que tinha o curso dele lá! entao melhorou MUITO, pois era array pra todo lado."},{"author":"Maurício Linhares","comment":"O Paulo é hater do Sedgwick, nem adianta."},{"author":"Sebastião Relson Reis da Luz","comment":"Ta aí um episódio q pegou na minha memória afetiva, assim como a Roberta comecei ler o Java como programar na faculdade o da capa amarela, e comprei da capa azul (li de capa a capa).Quando falaram da série use a cabeça lembrei também dos livros \"Estudo Dirigido\" que tenho vários :D, sem contar as séries de livros gigantes como a Bíblia (tenho do VB6) e as da wrox Professional (tenho de .net, também li de capa a capa).Colocava tudo lá no skoob, bom até pra saber de alguns q emprestei e nunca mais voltaram :( meu link de usuário lá https://www.skoob.com.br/us...Nem precisa mas vou dizer, ótimo episódio []s"},{"author":"Tiago Faustino","comment":"Gosto demais de ler livros técnicos. Creio que leio muito menos do que preciso!Alguns eu já tinha lido. Mas outros já estão na minha nova prateleira no Goodreads rs: https://www.goodreads.com/r..."},{"author":"Thais Diniz","comment":"Espera também ver alguns livros mais recente neste podcast, além de excelentes livros sobre metodologia ágil, ou desafios das equipes de alta performance e não só sobre programação, achei que ficou muito restrito o leque de livros mensionados. Parabéns ótima escolha do tema."},{"author":"Maurício Linhares","comment":"O maior problema deles é que termina por ser muita modinha, então essas coisas variam muito, ainda pensei em indicar o \"The Mythical Man Month\" mas o tempo é curto :D"},{"author":"Diego Saouda","comment":"Olá, bom dia!Para mim o que ajudou muito foi a apostila FJ11 da Caelum. Muita boa!!! Tão boa que nem senti a necessidade de fazer o curso presencial. (Desculpe a sinceridade, foi um elogio. rs)"},{"author":"Paulo Silveira","comment":"eu poderia ter lembrado desse jaba!"},{"author":"Robert Resende","comment":"Bom dia,como linhares meu primeiro livro de programação que comprei e li de cabo a rabo foi o Deitel - Java Como Programar. Quando eu li ele sinceramente não entendi muito de qual era  a dele, mas uns anos depois eu entendi e passei a respeitá-lo muito. Ele é feito para quem não sabe programar literalmente e faz isso ensinando pedaços do Java e quem consegue ler/fazer exercícios até o fim consegue aprender a programar e aprender os conceitos da linguagem até conceitos intermediários. Segundo não é de programacao, foi Sistemas Operacionais Modernos do Tanenbaum. Esse livro para mim um abrir de cabeça relacionado a conceitos computacionais. Agora sobre programação o livro que mais gosto de longe é o Java Head First, segundo foi Clean Code e terceiro design patterns do GOF. Tenho alguns famosos mas que nunca li ainda... mas estão no meu TODO-List que são DDD, O Programador Apaixonado... Abs Robert L Resende."},{"author":"Thiago Ramos","comment":"Putz, esse foi um dos primeiros livros que li quando comecei em Java e depois reli pra fazer a certificacao. Excelente livro."},{"author":"Maurício Linhares","comment":"Deitel & Deitel mais uma vez aí hahahaha!"}]}