{"title":"Scrum e Agile para além de Tecnologia – Hipsters #115","releaseDate":"25/09/2018","tags":["agilidade","Podcast"],"people":["Paulo Silveira","Alexandre Magno","Lucas Takeshi"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1915%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1915&t_u=https%3A%2F%2Fhipsters.tech%2Fscrum-e-agile-para-alem-de-tecnologia-hipsters-115%2F&t_e=Scrum%20e%20Agile%20para%20al%C3%A9m%20de%20Tecnologia%20%E2%80%93%20Hipsters%20%23115&t_d=Scrum%20e%20Agile%20para%20al%C3%A9m%20de%20Tecnologia%20-%20Hipsters%20%23115%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Scrum%20e%20Agile%20para%20al%C3%A9m%20de%20Tecnologia%20%E2%80%93%20Hipsters%20%23115&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Luiz Pansarini","comment":"Adorei esse episódio, como o primeiro sobre Scrum!Eu vivo um problema na empresa, pois trabalhando na área de Infraestrutura/Service Desk, nós temos muitos processos, e soluções que são vinculados a profissionais, além do velho “medo de perder o emprego”Às vezes eu fico com dúvidas se colocar metodologias ageis ou algum outro tipo de Framework ajudaria a criar novos processsos, corrigir os antigos ou desvincular a pessoas.Alguém conhece algo parecido com isso pra me ajudar?"},{"author":"Alain Oliveira","comment":"Olá Luiz! No meu ponto de vista ajudaria sim, inclusive te ajudaria a enxergar melhor esses gargalos gerados pelos próprios colaboradores resistentes e uma gestão mais assertiva para sua área. Como sugestão, dê uma pesquisada sobre o Lean pensando na gestão do seu ambiente de trabalho e sobre Kanban para gerenciar as entregas. Acredito que seja um \"grande\" primeiro passo. Espero ter ajudado. Abraços!"},{"author":"Luiz Pansarini","comment":"Valeu, obrigado Alain!"},{"author":"Wesley ","comment":"Não sei o porque, não sei se é ignorância minha ou falta de conhecimento mais aprofundado, mas pra mim Scrum, Agile, UX e etc, são so desculpas de um nome bonitinho pra ganhar grana com cursos e treinamento e gestão e etc.Acho que são coisas que ja existem a tanto tempo, mas não tinham nome antes, ou pelo menos eram técnicas que estavam misturadas em Marketing, Design, Gestão de Equipe etc etc etc. e alguem pegou juntou e deu um nome legal e boa. e coloueu leio e aprendo sobre o assunto e tento me atualizar sempre, claro, mas em muitos detalhes não vejo algo de realmente novo e/ou revolucionário.\"acho que no estado que moro (MG) tbm não se tem muita oportunidade de trabalhar com isso, o que deve dificultar minha compreensão sobre o assunto\""},{"author":"Alain Oliveira","comment":"Bom episódio! Vivo esta realidade aqui na empresa.O que tenho percebido é que, assim como no hype das linguagens de programação onde existiam os \"evangelistas\" (aquela galera que só pregava uma linguagem e o resto era lixo(eu fui um deles... rs)), tenho visto e ouvido muito disso em torno do Agile: \"que ele vai mudar o mundo\", \"curar o câncer\", etc., o que pode até acabar gerando essa forçada de barra que comentaram. Acho que o legal, e talvez o ideal, para um gestor de times que não trabalham com desenvolvimento(ou não só desenvolvimento) é abrir um pouco mais a cabeça, ler e conhecer diversas filosofias/metodologias diferentes e entendê-las como uma garagem cheia de ferramentas para então usar a ferramenta certa para cada necessidade.Aqui no Time de Processos usamos Lean, Scrum, Kanban e OKRs. Funciona e muito bem, os resultados do time mostram isso. Tiramos o que cada uma das metodologias/filosofias tem de melhor e hoje temos um time multidisciplinar caminhando muito rápido para alta performance, aprendizado e melhoria contínua e que entregam grandes objetivos em pouco tempo.A gestão da mudança cultural \"sempre\" fará toda a diferença no final!Abraços!"},{"author":"André Kauling Justi","comment":"Pessoal episódio bacaba, acho que seria interessante ter mais episódios de programação como de go, koltin etc...Talvez fazer algo como é feito na alura para sugestões do que o pessoal quer ver"},{"author":"Fernanda","comment":"Vocês poderiam colocar no player do site uma opção para ouvir o áudio em diferentes velocidades, como 1.25, 1.50 e 2.00, semelhante ao que tem no youtube? Obrigada!"},{"author":"Daniel Carlos Souza","comment":"Enquanto eles ainda não colocam esta opção... eu faço assim...mySnd=document.getElementById(\"audio-1915-1\"); // vi o id no codigo fonte...mySnd.playbackRate=1.5;no console do navegador... hehehe.."},{"author":"Fernanda","comment":"Muito obrigada Daniel!!! Ficou show demais! :D"}]}