{"title":"Softwares de Defesa – Hipsters #116","releaseDate":"02/10/2018","tags":["Podcast","programação"],"people":["Paulo Silveira","Rafael Odoni","Mauro do Santo Júnior","Maurício “Balboa” Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1932%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1932&t_u=https%3A%2F%2Fhipsters.tech%2Fsoftwares-de-defesa-hipsters-116%2F&t_e=Softwares%20de%20Defesa%20%E2%80%93%20Hipsters%20%23116&t_d=Softwares%20de%20Defesa%20-%20Hipsters%20%23116%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Softwares%20de%20Defesa%20%E2%80%93%20Hipsters%20%23116&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Láyro Zahaila","comment":"Tô estudando Ada e essa linguagem é uma paixão desde a faculdade."},{"author":"Nathan Tomaz","comment":"eu pensei q tinha q fazer concurso da área de TI do exercito para trabalhar com defesa, mas pelo jeito pela iniciativa privada tb da."},{"author":"Fernando Boaglio","comment":"Lembro das propagandas do Oracle Lite 8 (versão minificada do Personal Oracle 8) em que o pessoal de vendas comentava que cada helicóptero Apache e cada soldado americano tinha uma instance do Oracle Lite, e existia um certo controle para avisar se algum soldado em campo poderia ser machucado por uma arma disparada pelo helicóptero. Vi isso em um evento em 1998."},{"author":"Matheus Catarino","comment":"Eu pensava que usava-se Assembly para programar todo o sistema. Embora eu conheça um amigo que desenvolve um sistema de simulador de voo usando C++ com Qt.Acredito que talvez tentem usar o Rust em certas abordagens substituindo o C gradativamente."},{"author":"Danilo Cândido","comment":"- \"No meu helicóptero funciona\""},{"author":"Maurício Linhares","comment":"Maneira mais segura de garantir a qualidade do software é levar o desenvolvedor responsável no helicóptero também."},{"author":"Ednilson Campos","comment":"Gostaria de sugerir um assunto para episódio, vocês poderiam falar sobre a linguagem mais adequada para um certo problema, por exemplo: preciso desenvolver uma aplicação web qual stack/pilha poderia utilizar? R. Para o front end tem duas ótimas opções Angular ou React; para o back end poderia ser Java, alguém poderia sugerir PrimeFaces + Java, e ai o que escolher? Outro problema poderia ser: preciso desenvolver uma aplicação que tenha alta performance: R. Golang seria uma boa opção devido a facilidade de trabalhar com concorrência. A linguagem Rust é adequada para aplicações web? Poderia utilizar Datomic sempre em vez de outros bancos de dados? Preciso criar uma API Rest, vou usar Java, Golang, Rust, NodeJs? Acho que seria um tema interessante."},{"author":"Maurício Linhares","comment":"Tecnologias são muito diversas, dá pra usar muita coisa e todas elas vão dar certo, depende muito mais da equipe, das ferramentas que a equipe está acostumada a usar e o interesse em aprender coisas novas.Mas tem um caso especial, em 2018 PrimeFaces e qualquer coisa relacionada a JSF vai ser sempre a escolha errada."},{"author":"Ednilson Campos","comment":"Sim..sim.. o problema é que geralmente a \"ferramenta\" que a pessoa domina é utilizada para resolver qualquer problema, quem sabe banco de dados vai utilizá-lo para tudo que puder, de regra de negócio a envio de email."},{"author":"igor genuino","comment":"Ep muito bom. É legal ver como que a área de defesa precisa de desenvolvedores de várias áreas. Não é preciso de desenvolvedores de outro mundo haha. E os projetos são bem diferentes e legais."},{"author":"Juliano Soares","comment":"Mais um ótimo ep!"},{"author":"Mauro Santo Jr.","comment":"Faltou o meu contato no LinkedIn :-)https://www.linkedin.com/in..."},{"author":"Marcelo Custódio","comment":"Episódio delicioso. Lembrou-me da minha época de Mestrado em Sistemas Embarcados."},{"author":"Gabs Ferreira","comment":"Opa Mauro! Corrigido :)"}]}