{"title":"Mainframe e desenvolvimento raiz – Hipsters #118","releaseDate":"16/10/2018","tags":["Podcast","programação"],"people":["Paulo Silveira","André Breves","Anne Jhackelini","Roberta Arcoverde","Maurício “Balboa” Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1948%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1948&t_u=https%3A%2F%2Fhipsters.tech%2Fmainframe-e-desenvolvimento-raiz-hipsters-118%2F&t_e=Mainframe%20e%20desenvolvimento%20raiz%20%E2%80%93%20Hipsters%20%23118&t_d=Mainframe%20e%20desenvolvimento%20raiz%20-%20Hipsters%20%23118%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Mainframe%20e%20desenvolvimento%20raiz%20%E2%80%93%20Hipsters%20%23118&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Tiago Aguiar Moreira","comment":"Não sei o que é mais estranho pra mim... o Linhares mandar cheque por correio ou ter que usar cheque rs"},{"author":"Jonathan Costa","comment":"Estudo Sistemas de Informação em Jampa, e fiquei curioso quando um senhor de idade sentou ao meu lado no Bus e me falou da Linguagem Cobol...achei que seria um time da NFL...hahaha, hj eu entendo a importância das linguage s Fortran e Cobol. 😅😎"},{"author":"Alberto Carneiro","comment":"Pessoal, muito obrigado e parabéns pelo episódio!Trabalho em uma instituição financeira como DBA (DB2 z/OS) e conheço e utilizo (ou utilizei) algumas das ferramentas mencionadas no podcast, assim como já programei em COBOL, CSP e ASM (pouco). Atualmente utilizo o REXX para os script de automação e, claro, JCL (!!!). Sou ouvinte antigo do podcast mas confesso que dessa vez deu uma certa emoção ao ver o trabalho do pessoal da \"alta\" como assunto principal. Em verdade, acho que existe uma \"cultura\" um tanto diferente que talvez tenha algo a acrescentar para quem não é da área.Divulguei o link para os colegas \"dinossauros\".Grande abraço!"},{"author":"MarceloPires","comment":"Obrigado e Parabéns pelo programa. Viajei no tempo. Trabalhei entre 1984 e 1992 com Mainframe IBM 4341/4381 com CICS, VM/CMS,REXX ( não citado). Tantos termos que a muito não ouvia. Legal saber que tudo continua vivo. Para mim nada disso mais existia. Vou muito legal ouvir. Abraços."},{"author":"Philipe dos Santos Pompeu","comment":"Agora que vocês fizeram um programa sobre Mainframe, poderiam fazer sobre a Totvs e o seu mundo de desenvolvimento(Advpl e o Protheus), é uma tecnologia comum aqui no Brasil e muita gente não conhece..."},{"author":"Henrique Bierwagen","comment":"Em se tratando de análise de Hardware, um convidado confunde repetidamente os conceitos de resilience e reliability, o conceito de resilience não se aplica a mainframes e sim extreme reliability"},{"author":"Paulo Silveira","comment":"mas a primeira frase da IBM é justo essa aqui bierwagen: \"IBM Z delivers offers a high level of resiliency you can count on with resilient mainframe servers and software for non-stop enterprises.\""},{"author":"Henrique Bierwagen","comment":"Quem sou eu pra discutir com a IBM, mas deve ser um vocabulário consagrado, diferente do significado denotativo. Em aviação e automotive, não existe resiliency, é sempre reliability."},{"author":"Andre Elidio","comment":"Trabalhei com a Anne com PL/1 nesse referido banco. (hehehehehe)Linguagem muito mais simples do que o Cobol.Como outros colegas disseram, existem outras linguagens, como Assembler e outras não citadas como Natural e Easytrieve.Diferente da \"baixa plataforma\" onde são gerados \"executáveis\" pelo compilador, os módulos gerados no Mainframe ainda precisam de uma outra linguagem chamada JCL pra executar esses módulos e dizer ao Mainframe quais são os recursos necessários para ele, exemplo, arquivos de entrada, saida, banco de dados e parâmetros.Hoje ainda trabalho em instituição financeira que utiliza Mainframe, porém devido as compras e vendas de bancos esse mercado que já foi vasto para contratações no Brasil infelizmente está cada vez mais escasso."},{"author":"Anne Jhackelini Dalmonico Alde","comment":"Saudades de vc André Elídio!!"},{"author":"Buga","comment":"Algumas imprecisões nas falas, mas tá valendo. Cito o lance das 80 colunas que é devido historicamente aos cartões perfurados utilizados no censo alemão pre segunda guerra, quando a IBM ainda fazia computacao pré eletrônica! Adoro Roscoe prefiro ao TSO... Mas hoje em dia não precisa mais gente, por favor, usem alguma IDE visual, tem várias disponíveis hoje em dia, o eclipse pro mainframe que vocês disseram aí chama IDz. O PL/1 é muito, mas muito mais nova ( uns 5 anos! ) e fácil de usar que o Cobol.Podiam ter chamado alguém da IBM pra participar dessa conversa. Falta mudar a cabeça da galera pra fazer o mainframe voltar a ser \"dev sec ops\" igual sempre foi antes da nutelizacao  imposta as TIs de mainframe sabe-se lá porque e como deixaram isso acontecer mas começou lá  nos anos 2000 e precisa acabar com todas essas amarras! Eu truco que onde esses caras que falaram sobre mainframe tenha um ambiente de homologação funcional de verdade!  Desconheço o nível de conhecimento técnico da galera que participou mas deixou a desejar. Nem citaram o Master the Mainframe pro pessoal que quiser aprender/conhecer é a melhor e uma das únicas formas de acessar um mainframe hoje em dia."},{"author":"Anne Jhackelini Dalmonico Alde","comment":"Onde eu trabalho tem ambiente de homologação magnífico, tanto para Mainframe como Baixa...A tal \"nutelizacao\" que vc se refere, ocorreu globalmente pois simplesmente a demanda de Ti cresceu exponencialmente e sem controles fica complicado..."},{"author":"Buga","comment":"No Santander é diferente, concordo que é muito bom o ambiente.... mas acho que teve mais a ver com a diretriz que veio lá da Espanha de equalizar todos os ambientes no mundo, e consequentemente não teve muito como fugir disso, mas o Pampa por exemplo tem a parte de homologação de cartões semestral das bandeiras feitas em desenvolvimento. O controle não necessariamente precisa vir acompanhada de burocracia e cargos. Mas é uma discussão boa de ser levada pra uma mesa!"},{"author":"Paulo Silveira","comment":"Valeu o complemento buga! Nao achei a referencia para o censo alemao da segunda guerra. Achei para o censo de 1880 americano, 1890, etc, pelo Hollerith. Seria até entao de antes?http://www.columbia.edu/cu/...https://ethw.org/Early_Punc...Mas, de qualquer maneira, acho que como o assunto era mainframe, foi mais interessante mostrar que veio daí. De onde veio as colunas do punchcard, qual foi o primeiro, etc, não era bem o tópico do programa e vira problema de ovo e galinha né.Sobre o nivel tecnico, não sei seu nome mas você está convidadissimo também a aparecer no proximo episodio se quiser! Ainda nao tenho datas, mas dado o sucesso do episodio certamente teremos um outro."},{"author":"Buga","comment":"Me chamo Buga mesmo, muito prazer. sobre o pelo em ovo, foi só de bobeira porque é algo que vem antes do proprio mainframe! Pela sua pesquisa com certeza veio antes do censo que me referi ! Sentirei muito orgulho em poder participar do bate papo."},{"author":"João Menighin","comment":"Deve ser uma vida dificil se chamar Buga e ser profissional de TI... Ja to imaginando todas as piadas... hahaha"},{"author":"Buga","comment":"hoje em dia até que esta mais tranquilo!"},{"author":"iraecio","comment":"Caramba que episodio :D"},{"author":"João Menighin","comment":"Faz programador de Vim parar de se achar hipster: \n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n"},{"author":"Buga","comment":"Esse programa ai é do meu TCC !!!!"},{"author":"Buga","comment":"Só de curiosidade pegou a imagem donde ?"},{"author":"João Menighin","comment":"Opa, digitei \"Roscoe mainframe\" no google n_n'Era uma das primeiras"},{"author":"Paulo Silveira","comment":"assustador"},{"author":"Eduardo Paixão","comment":"A empresa Iron Mountain, onde já trabalhei, guarda fitas de backup no Brasil rsrsrs' Existe depósitos só para guardar essas fitas, ou seja, ainda há muitas fitas pelo mundão ainda."},{"author":"Joao Victor","comment":"Trabalhei 3 anos com Assembler, desenvolvi uma plataforma transacional, concorrente do CICS, porém caseiro.. filho de um certo banco por aí heheBons tempos de otimização de código, programação multi Task roots!Pena que não tem muito mercado, agora só conecto os dois mundos, alta e baixa plataforma (C#)."},{"author":"Buga","comment":"O GRI / GRBE realmente é uma solução fascinante! Parabéns por ter trabalhado com ele, sinta-se um cara que fez parte de uma história tão grandiosa e facinante mas que infelizmente ninguém conhece!"},{"author":"Joao Victor","comment":"Oloco... me acharam! heheheRealmente é uma solução muito robusta!Decorei o POP por causa dele, meu foco era otimização e performance. Tentei trazer as instruções relativas pro dia a dia do pessoal kkk (Adeus estouro de base)Pena que não tem campo para \"Assembleiros\", fui pra baixa com medo de não ficar aderente ao mercado."},{"author":"Filipe Tagliatti","comment":"Galera que tiver curiosa para ver o vídeo do robô fazendo backup em fita tem esses visos:\n\n\nReproduzir\n\n\n Ocultar\n\n\n\n\n\n\n\nReproduzir\n\n\n Ocultar\n\n\n\n\nse escrever Tape Library no youtube acha bastante coisa legal. =D"},{"author":"Paulo Silveira","comment":"excelente!"},{"author":"Alexandre Manoel Silva","comment":"Trabalhei 5 anos com cobol, entre banco e telecom. DB2, CICS, VSAM, ADABAS e por ai vai ... Utilizei muito o TSO (emulador terminal 3270), no primeiro momento fiquei completamente perdido, mas com o tempo você acostuma... A como era legal montar malhas utilizando JCL para rodar as rotinas batchs kkkHoje estou com node.js, react.js, angular e por ai vai (em questão de evolução tecnica é muito mais legal)"},{"author":"Rodrigo Tognin","comment":"Eu trabalho com Cobol a 9 anos, porém utilizamos uma IDE para desenvolvimento para Windows! Nunca vi mainframe... ou seja, embora programe em Cobol, não sou desses programadores \"baixa plataforma\"."},{"author":"Joao Silva","comment":"Na grade da Fatec Zl tem programação para Mainframe Cobol por isso sei que não é lenda que ainda existam programadores mainframe Jovens kkkkk   vários colegas de curso  trabalham com mainframe, como a Carina Midori que acabou de comentar."},{"author":"Hermes Passer","comment":"Opa, agora fiquei curioso. Talvez aqui na Fatec Zs tenha também."},{"author":"Sebastião Relson Reis da Luz","comment":"Como sempre  ótimo episódio, e já fica a deixa pra um episódio de upsizing e downsizing"},{"author":"Carina Midori","comment":"Eu trabalho com isso rs, estou no inicio da carreira. Mainframes são fascinantes :D Ia ser muito legal ter cursos na Alura com linguagens de alta plataforma. Obrigado por abordarem o assunto."},{"author":"William Fachineti","comment":"Comecei minha carreira trabalhando em um Banco com Mainframe, programei em ALGOL, COBOL, ASSEMBLER, REXX, CICS, DB2, TSO, bons tempos. Quando chegou o primeiro PC na minha equipe, resolvi aprender esta nova \"tecnologia\" e mudei para \"baixa plataforma\" . Hoje trabalho com Linux, desenvolvo em Javascript, PHP, HTML, CSS, vários frameworks, etc....Excelente episódio, fiquei com saudades..."}]}