{"title":"Java EE e Jakarta EE – Hipsters #119","releaseDate":"23/10/2018","tags":["Podcast","programação"],"people":["Paulo Silveira","Bruno “Javaman” Souza","Otávio Santana","Maurício “Balboa” Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1956%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1956&t_u=https%3A%2F%2Fhipsters.tech%2Fjava-ee-e-jakarta-ee-hipsters-119%2F&t_e=Java%20EE%20e%20Jakarta%20EE%20%E2%80%93%20Hipsters%20%23119&t_d=Java%20EE%20e%20Jakarta%20EE%20-%20Hipsters%20%23119%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Java%20EE%20e%20Jakarta%20EE%20%E2%80%93%20Hipsters%20%23119&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Leonardo Mendonça","comment":"Que tal um podcast sobre Flutter e Dart?"},{"author":"Marcelo Custódio","comment":"Por mim, chamariam o Otávio a cada trimestre, até pra checar como anda a especificação e outras novidades."},{"author":"Matheus Darós Fernandes","comment":"Paulo, já ouviram falar no novo framework web Blazor, que roda C# e Razor no Browser?? Imagina programar front-end com C# em vez de JS?? Acho que seria um tema legal, incluindo a discussão sobre WebAssembly como o futuro do desenvolvimento web."},{"author":"Joao Silva","comment":"Paulo um tema legal seria Serverless computing :)  ( pois não entendo nada kkk)"},{"author":"Paulo Silveira","comment":"teremos!"},{"author":"Ronaldo Prates","comment":"Isso foi um curso online praticamente!! Vou até por no cv isto!! Parabéns!!"},{"author":"Black Power Dog","comment":"Que sopa de letrinhas... JEE, J2EE, JFUDE... Tá doido, prefiro continuar no meu PHP ! :D"},{"author":"Desv","comment":"Ou .NET. Java realmente é coisa de louco."},{"author":"Paulo Silveira","comment":"é, nunca foi simples esse mundo java hehe"},{"author":"Fernando Boaglio","comment":"Parabéns pelo podcast, a comunidade Java tem muita gente boa para falar!"},{"author":"Sebastião Relson Reis da Luz","comment":"Como assim \"Antes\" todo mundo tinha o seu próprio framework.Me lembrou eu lendo o livro j2ee em 21 dias, avancei os primeiros dias e questão de horas, quando parei no ldap foi mais de 1 semana no mesmo cap."},{"author":"Sergio Rodrigo","comment":"Finalmente JAVA  <3"},{"author":"Vou me embora pra Pasárgada","comment":"O Otávio Santana parecer consultor da Oracle vendendo produtos pra empresas rsrs. A Oracle teve algumas decisões acertadas porém tardias e anunciadas de forma atabalhoada. Mas fica a esperança nas mudanças. Com relação as inovações. Teria q existir uma divisão de pesquisas de inovações pois, sempre está um passo atrás do mercado,  mesmo sendo passos seguros é sempre um passo atrás. Desculpa mas é o q eu acho. Adimiro muito o trabalho de vcs :)"},{"author":"Danilo Vieira","comment":"Ótimo Podcast, muito obrigado. Comecei a programar com Java Web, depois me tornei desenvolvedor Android. Após ser anunciado o Kotlin como linguagem oficial do Android, praticamente deixei de programar em Java. A minha sensação era que Java estivesse ficando só para código de legado. Ótimo saber que está havendo avanços (apesar de lentos). Atualmente estou estudando Python por conta própria e estou muito entusiasmado com a linguagem. Estou esperando ansiosamente por um podcast sobre Python. Abraços."},{"author":"Ray da Costa","comment":"Oi Bruno Souza, tudo bem? Gostaria de agradecer você e o Otávio Otávio Gonçalves de Santana pela participação no Podcast Hipsters.... Kra, na moral, o Java estava precisando muito destas explicações, desta aparição, deste SINAL DE VIDA. MUITO obrigado. E na boa... precisamos de mais aparições deste tipo. Bruno, vc poderia agendar outra com o Paulo Silveira para falar do OpenJDK!"},{"author":"Ednilson Campos","comment":"e sobre licença da Oracle"}]}