{"title":"Desenvolvimento iOS com Swift – Hipsters #120","releaseDate":"30/10/2018","tags":["mobile","Podcast","programação"],"people":["Paulo Silveira","Guilherme Rambo","Thiago Bisewski","Orlando Amorim","Felipe Torres","Tais Batuira"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1966%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1966&t_u=https%3A%2F%2Fhipsters.tech%2Fdesenvolvimento-ios-com-swift-hipsters-120%2F&t_e=Desenvolvimento%20iOS%20com%20Swift%20%E2%80%93%20Hipsters%20%23120&t_d=Desenvolvimento%20iOS%20com%20Swift%20-%20Hipsters%20%23120%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Desenvolvimento%20iOS%20com%20Swift%20%E2%80%93%20Hipsters%20%23120&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Fred Oliveira","comment":"Correção, é possível enviar para a Apple Store usando um Hackintosh"},{"author":"Samuel Botelho","comment":"Fala Fred, você pode me dar uma mão com o tal do hackintosh?Pode me contatar por: https://www.linkedin.com/in...https://www.facebook.com/sa...Obrigado!!"},{"author":"Fred Oliveira","comment":"me manda mensagem lá que continuamos"},{"author":"Frederico Pierami","comment":"Não estão mais no Spotify?!"},{"author":"Caio Filipe de Moraes Rodrigue","comment":"Notei isso também, deve ter ocorrido algum problema na publicação."},{"author":"Italo Amorim","comment":"Quanto ao que foi dito sobre o review lembro o primeiro jogo que publicamos na empresa, o jogo explodia um garoto que comia até explodir, o design era fantástico mas tivemos que colocar um bigode no menino por infringir as regras... Levamos 1 mês para conseguir publicar"},{"author":"Felipe Torres","comment":"Sei beeeem como é esse perrengue pra publicar. O que eu fiquei curioso é qual o guideline que vc infringiu. Vc lembra?"},{"author":"Italo Amorim","comment":"Foi uma relacionada com violência com crianças. Vou procurar o email deles e passo certinho .."},{"author":"Éverton","comment":"Muito feliz em saber que eu não sou o único a usar um Iphone pequeno (5C 8Gb) :D"},{"author":"Romulo Assis","comment":"Não sou desenvolvedor IOS, trabalho com WEB e/ou Android (Kotlin) e Nativescript. Tenho um MAC Mini Late 2012, i5 e fiz um baita upgrade de RAM e SSD. E sinceramente, não tenho nada a reclamar, hoje só troco se for para um MAC mais recente. O emulador da uma engasgada, mas nada que atrapalha o meu dia a dia"},{"author":"Felipe Torres","comment":"Esses Mac Mini são beeeem legais, principalmente com mais SSD e RAM. É bem isso mesmo: se pra Android dá pra programar de boa, pra iOS rola tb, e se essas engasgadas se tornarem um problema (ou incomodarem), ai é trocar pra um MacBook ou algo do tipo.Só uma coisa a ficar de olho: as atualizações do OS. Como o Xcode depende da versão do sistema operacional e os updates dependem da data do Mac, talvez o Late 2012 fique fora das últimas atualizações."},{"author":"Paulo Silveira","comment":"e acabou de sair um novo :)"},{"author":"Romulo Assis","comment":"Bom, ainda estou dentro desse update kkkkkkkEspero que atualizem ainda por um tempo, pois não to com coragem($$$$) para trocar agora não! kkkkkkkkkk"},{"author":"Adriano","comment":"Parabéns pelo podcast foda, escuto todos episódios ! Tem como deixar uma sugestão de episódio? Tem né? Bom minha sugestao seria um podcast falando sobre a carreira de T.I na polícia federal, como é, o que eles fazem, do que se alimentam... Kkkkkk abraço, continuem com esse podcast porque é o que eu faço todo dia no ônibus indo pra faculdade, é ouvir ele."}]}