{"title":"Eventos de Tecnologia – Hipsters #121","releaseDate":"06/11/2018","tags":["carreira","front-end","Podcast","programação"],"people":["Paulo Silveira","Leandro Guimarães","Tiago Baeta","Jaydson Gomes"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=1982%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D1982&t_u=https%3A%2F%2Fhipsters.tech%2Feventos-de-tecnologia-hipsters-121%2F&t_e=Eventos%20de%20Tecnologia%20%E2%80%93%20Hipsters%20%23121&t_d=Eventos%20de%20Tecnologia%20-%20Hipsters%20%23121%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Eventos%20de%20Tecnologia%20%E2%80%93%20Hipsters%20%23121&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Daniel Salis","comment":"Episódio sensacional!Estou no segundo ano de Ciência da Computação, mas já trabalho com desenvolvimento web há um tempo. Nunca tinha parado para pensar o quão importante podem ser esses eventos para o desenvolvimento profissional de uma pessoa.Gostaria de saber se vocês poderiam recomendar conferências, eventos, palestras (ou até mesmo grupos em redes sociais) na região do Vale do Paraíba e de São Paulo, pois realmente planejo em ir no máximo possível este ano.Agradeço desde já."},{"author":"Daniel Dias","comment":"que episodio massa em.eu sou um dos Jug Leader do SouJava-Rio (https://www.meetup.com/pt-B... / (https://soujava-rio.github.io) .Geralmente temos eventos 2 vezes no mês com conteúdo não somente de Java, mais misturamos dois temas, uma palestra técnica envolvendo Java(cloud,microservices,etc) e uma voltada para carreira, agil, empreendorimos.Para quem tiver interesse em participar, ajudar nos meetups, palestrar ou patrocinar o evento, serão bem vindos .é uma pena aqui no Rio não ter conferencias grandes como Qcon, TDC, mais entendo que o custo aqui é alto, sem contar conseguir um espaço para realizar o mesmo. Pois eu sofro com isso quanto tento realizar no nosso .São poucas empresa que veem valor das comunidades, pelo menos é o que eu vejo no Rio.{  },s"},{"author":"Alex","comment":"Gostaria de dar os parabéns ao pessoal que promove os eventos, tem que ter muita paixão pelo que faz. Esses eventos são como balões de oxigênio pra mim, ajudam muito a ver outra possibilidades, ou mesmo ver que as praticas usadas por mim não ficam longe do mercado, as vezes com outros nomes, mas a ideia é a mesma.Além disso, sobre inclusão, diversidade, etc, eu nunca vi um indígena apresentar alguma coisa na área de tecnologia, vcs já viram?"},{"author":"Leandro Guimarães","comment":"Oi, Alex! Obrigado pela mensagem. Nunca vi um indígena apresentar algo relacionado ao desenvolvimento de software. Você já viu? Fui até pesquisar no InfoQ pra ver se tinha algo, mas achei só uma palestra falando sobre a criação de um app para a população indígena (https://www.infoq.com/br/pr...."},{"author":"Alex","comment":"Opa Leandro, blz? Então, nunca vi..hehehe, acho que é uma parte da nossa população com pouca representatividade (em software). Eu não sou exatamente indígena, mas tenho sangue, meus pais tiveram um pouco mais de contato com a etnia, mas vieram para SP há muito tempo, então eu nasci e cresci longe da cultura."},{"author":"Romualdo Costa","comment":"Faço parte da organização do JS Day http://fsa.jsday.com.br/ e estamos na luta para manter a qualidade e inclusão nos eventos. Dá muito trabalho, mas só de ouvir as opiniões da galera, já vale a pena."},{"author":"Leandro Guimarães","comment":"Que legal, Romualdo! De fato, é um intenso trabalho. Mas, como dito por você, a troca de opiniões e experiências é algo preciosíssimo."},{"author":"Rodolfo Souza","comment":"Ótimo episódio !Também estamos desenvolvendo nosso primeiro evento, o Innovation Summit, com foco no empreendedorismo e em tecnologia, a primeira edição do evento irá acontecer em Tubarão-SC. Convido a todos a visitar e saber um pouco mais do projeto https://isummit.com.br ."},{"author":"Tainã Andrade","comment":"Muito bacana o episódio e oportunidade divulgar os nossos eventos.A Jornada de TI Hospitalar ( encurtador.com.br/fkqN5 )  é um evento integrador promovido pelo departamento de TI do Hospital Ernesto Dornelles, abrindo o espaço para o encontro, o debate e imersão em temas sobre novas tecnologias, tendências, processos e serviços de TI, com objetivo de contribuir para transformação digital dos hospitais e outras organizações na área da saúde, além de outras áreas que contam com departamentos de TI para suportar seus processos de negócio. Nesta primeira Jornada, serão abordados temas relevantes da transformação digital nas organizações que perpassam a Inovação, a Segurança da Informação e o Gamification, Business Intelligence (BI), Inteligência Artificial (IA) e outros."},{"author":"Leandro Guimarães","comment":"Que legal mesmo, Tainã! Vou encaminhar o evento para um amigo meu que atua nessa área. Que tudo dê super certo por aí!"},{"author":"Leandro Guimarães","comment":"Parece que o link que você enviou, do encurtador, está quebrado. Achei esse link aqui sobre o evento: https://www.sympla.com.br/1..."},{"author":"Paulo Silveira","comment":"wow! surpreendente!"},{"author":"Tainã Andrade","comment":"Confesso que me senti muito feliz com essa curtida. Esse é um projeto pioneiro no RS. Fica o convite. Grande Abraço"},{"author":"Perceu Bertoletti","comment":"Opa! Galera vou deixar aqui nosso grupo de Caxias do sul - RS, nos organizamos:Rede Neural  - http://redeneural.github.io/,pyCaxias - https://pycaxias.org/Quem for da região e quiser trocar uma ideia pode nos encontrar no telegram também t.me/redeneuralParabéns pelo episodio, nos deu varias ideias para os eventos que organizamos, acho que vale citar tb a python-brasil, e eventos isolados de empreendedorismo e de jogos como as jams que acontecem em varios locais, esses eventos são a maneira de nos mudarmos o nosso cenário, e melhorar a economia das nossas regiões não pensando somente em nos mas na comunidade no geral! parabéns a todos os organizadores tamo junto !!!"},{"author":"Emanuel Rodrigues","comment":"Ótimo episódio como sempre. E achei muito bacana a questão levantada pelo Linhares sobre a nossa região(falo assim pois sou do interior do Ceará) que é muito difícil por várias questões comparecer nesses eventos grandes de tecnologia que devem ser muito bacanas. Valeu!"},{"author":"Fernando Boaglio","comment":"Os meetups podem começar na sua faculdade ou empresa e depois se quiserem, expandir para o público de fora. A minha dica é usar o site meetup.com para participar dos meetups ou montar o seu. Eu ajudo no \"São Paulo Java Meetup\" , quem quiser participar ou alguma ajuda na coordenação pode falar com a gente em https://www.meetup.com/Sao-..."},{"author":"Daniel Filho","comment":"que episódio lindo. parabéns, de novo! (exceto pelo fato que o Jaydson gravou dentro de uma caixa de madeira com o microfone do meu primeiro gravador da gradiente, mas tá valendo. hauhauhua :D)"},{"author":"Paulo Silveira","comment":"só a gente de podcast percebe isso daniel.... :)"},{"author":"Lucas Marciano","comment":"O evento no interior de Minas é o Hacktown e ocorre em Santa Rita do Sapucaí.http://hacktown.com.br/"},{"author":"Leandro Guimarães","comment":"Muitíssimo obrigado por trazer as informações do Hacktown, Lucas!"},{"author":"Julio Borges","comment":"Ótimo podcast, especialmente pra mim, faço parte da organização do Connection Day (https://connectionday.tech), que é um evento do interior de minas (Divinópolis/MG). Estamos com a segunda edição já marcada para 04/05/2019. É um grande desafio organizar um evento no interior e o planejamento é super decisivo. Além do evento principal, estamos organizando alguns meetups sempre buscando trazer conteúdo de qualidade para o interior."},{"author":"Fernando Boaglio","comment":"Esse comentário foi apagado."},{"author":"Fernando Boaglio","comment":"Faça... você vai se surpreender com a quantidade de pessoas que se interessam, principalmente de outras áreas."}]}