{"title":"Histórias de Black Friday – Hipsters #123","releaseDate":"20/11/2018","tags":["infraestrutura","Podcast","programação"],"people":["Paulo Silveira","André Nobre","Diego Bassani","Roberta Arcoverde","Mauricio Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=2003%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D2003&t_u=https%3A%2F%2Fhipsters.tech%2Fhistorias-de-black-friday-hipsters-123%2F&t_e=Hist%C3%B3rias%20de%20Black%20Friday%20%E2%80%93%20Hipsters%20%23123&t_d=Hist%C3%B3rias%20de%20Black%20Friday%20-%20Hipsters%20%23123%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Hist%C3%B3rias%20de%20Black%20Friday%20%E2%80%93%20Hipsters%20%23123&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Adriano","comment":"O episódio foi bom, ouvi hoje, mas o engraçado é que eu estava olhando um fogão nas Casas Bahia e deixei a aba aberta desde ontem. Hoje está R$ 100 mais caro. Ah, coincidência, questão normal de mercado né....."},{"author":"Leonardo","comment":"Vou confessar que não esperava grande coisa quando vi o tema do episódio. Quebrei a cara! Muito bom! Muitas dicas valiosas para ambientes que requerem alta disponibilidade! Fiquei curioso sobre a \"sala de espera\". O André Nobre ou qualquer outro participante poderia dar maiores detalhes \"baixo nível\"?! Mais uma vez, parabéns pelo episódio!"},{"author":"Maurício Linhares","comment":"Você deixa o cara numa tela estática, com uma mensagem de \"jajá o sistema volta\", que de vez em quando chama o serviço, pra verificar se ele tá disponível de novo, quando ele fica disponível manda o cara de volta pro site normal."},{"author":"Sebastião Relson Reis da Luz","comment":"Esse episódio me lembrou de quando trabalhava numa varejista de calçados e em um natal (nessa época ainda não tinha black friday no brasil) precisamos colocar os servidores debaixo do braço e ir pra outra filial por conta de uma queda de energia. Tenso"},{"author":"Paulo Silveira","comment":"sensacional"},{"author":"Ednilson Campos","comment":"Esse pessoal pode voltar no pós Black Friday, próxima terça, para falar como que foi durante o evento"},{"author":"Andre Nobre","comment":"Ótima ideia!"},{"author":"Juliano Soares","comment":"Vocês poderiam fazer um programa mostrando como esse pessoal de e-commerce lida com segurança."},{"author":"Juliano Soares","comment":"Só eu percebi o gorillaz no fundo?"},{"author":"Filipe Reis","comment":"Muito interessante o podcast, verifiquei que está com o código 123 porem não tem o 122 tem ligação com a black ser no dia 23 ?"},{"author":"Roberta Arcoverde","comment":"Hm, o 122 é o de Python: https://hipsters.tech/pytho.... Acho que só falta atualizar na sidebar de últimos podcasts :)"},{"author":"Diego França","comment":"Muito bom o podcast! Realmente eu tinha uma curiosoidade muito grande em saber como era o comportamento do sistem para receber uma grande quantidade de acesso."},{"author":"Marcelo Velasquez","comment":"Achei muito dez o podcast, e conhecimento de algumas coisas que rolam em backend, mas fiquei curioso mesmo de como funciona o acesso offline , isto é o cache de até 3 horas"},{"author":"Gabriel Maia","comment":"Muito bom o episódio, saber como os sistemas reagem a esses acessos absurdos era uma das minhas curiosidades! Uma dica, toda vez que quero repassar algo que foi falado eu tento clicar na barra de progresso mas o áudio volta alguns minutos. Será que vcs não poderiam colocar um botão de voltar 10, 15 segundos?"},{"author":"Maurício Linhares","comment":"O pocketcasts faz isso heim, tira o escorpião do bolso :D"},{"author":"Lúcio Assis","comment":"Pelo o que eu conheço de players para podcast, esse que eles utilizam, o PowerPress by Blubrry não possui essa funcionalidade ainda..."}]}