{"title":"Mais produtividade – Hipsters #125","releaseDate":"04/12/2018","tags":["carreira","Podcast"],"people":["Paulo Silveira","Willlian “PotHix” Molinari","Átila Iamarino","Roberta Arcoverde","Mauricio “Balboa” Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=2024%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D2024&t_u=https%3A%2F%2Fhipsters.tech%2Fmais-produtividade-hipsters-125%2F&t_e=Mais%20produtividade%20%E2%80%93%20Hipsters%20%23125&t_d=Mais%20produtividade%20-%20Hipsters%20%23125%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Mais%20produtividade%20%E2%80%93%20Hipsters%20%23125&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Matheus Henrique Silva Felix","comment":"nos 16.53  , esse lance que a Roberta  falou de se enganar , eu super faço isso. Digo a mim mesmo fulano não faz , porque eu vou fazer ."},{"author":"Bruno Guimarães Carneiro","comment":"Por que o React está superando o Angular na seguinte pesquisa?https://2018.stateofjs.com/..."},{"author":"Juliano Giambastiani Rech","comment":"Quando teremos um lindo podcast sobre Rust e Webassembly! ^^"},{"author":"Elías","comment":"Olá, mais uma: como vocês se organizam nas férias (vocês tem férias?) : se desligam completamente do trabalho, estudo, etc, diminuem a frequência? E como explicam / organizam isso com amigos, familiares etc?"},{"author":"Maurício Linhares","comment":"O melhor é desligar tudo. Eu levo o computador mas só uso se for alguma emergência de empresa falindo ou coisa do tipo. Nas férias estou de férias."},{"author":"Elías","comment":"\"Empresa falindo ou coisa do tipo\". Hahaha!Imagina a situação (praticamente o fim do mundo da empresa)..."},{"author":"Elías","comment":"Mais um ótimo episódio, parabéns!Como vocês fazem para gerenciar o vosso tempo, quando algumas pessoas dependem de vocês (dúvida, opinião), cada uma delas com assuntos diferentes e que a estimativa de tempo necessário é 10, 15 minutos, sendo que vocês já tem um programação para o dia, mas a continuação do trabalho delas depende da vossa opinião?Para mim esta é uma das \"interrupções\" mais complicadas, cumprir a tua programação e deixar as pessoas esperando por você, atender algumas, atender todas, inclusive porque se você negar, um dos principais pensamentos será \"ele tem o dia inteiro para as atividades dele, o que são 10, 15 minutos\"?"},{"author":"Maurício Linhares","comment":"Primeiro é descobrir porque tem tanta interrupção. Será que tem um problema de processo? Tem um problema nos sistemas? A pessoa é um gargalo de conhecimento da empresa?Depois de descobrir qual é o problema que causa tanta interrupção e tentar diminuir ele atacando direto na fonte, outra coisa boa é simplesmente colocar pedaços de tempo que indicam que você está de \"portas abertas\" pra receber pessoas e discutir essas coisas.Sem colocar controle e resolver o problema que causa o excesso de interrupção não tem o que fazer."},{"author":"Roberta Arcoverde","comment":"Boa pergunta. A primeira coisa pra mim é entender que ajudar as pessoas com essas opiniões/dúvidas é também parte do meu trabalho (e até mais importante do que as tarefas que faço sozinha). Dito isso, como trabalho de casa, é fácil me 'isolar' em determinados horários do dia quando não quero ser interrompida: fecho a aba do chat se precisar. Dependendo do nível de urgência (e do tempo que vai tomar), eu peço pra pessoa achar um horário no Calendar e crio um evento lá. Também já pedi pra escreverem a dúvida/pergunta e me mandarem por chat ou email. Mas eu nunca me nego a atender ninguém, desbloquear as pessoas é vital pro time andar."},{"author":"Joe Santos","comment":"Bom momento senhores, excelente episódio!Não encontrei o nerdologia que o Paulo citou, alguem poderia por gentileza disponibilizar o link?#paz"},{"author":"Paulo Silveira","comment":"acho que é esse! \n\n\nReproduzir\n\n\n Ocultar\n\n\n\n\n"},{"author":"Joe Santos","comment":"Obrigado Paulo!"},{"author":"disqus_Llivz2ArBY","comment":"disqus_8ngDGiiOvo but"},{"author":"Paulo","comment":"\n\n\nReproduzir\n\n\n Ocultar\n\n\n\n\n"},{"author":"Adriano","comment":"Que sensação otima abrir o episódio e ver que tem 1 hora. A propósito fica uma dica de tema: computação forense.Espero que esse podcast não acabe nunca!"},{"author":"Joao Silva","comment":"Paulo, Estou produtivo em postergar meu trabalho de ingles ouvindo o podcast (Y)"}]}