{"title":"Música e tecnologia – Hipsters #126","releaseDate":"11/12/2018","tags":["Podcast"],"people":["Paulo Silveira","Gabriel Ferreira","Pedro Lopes","Raul Mendes"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=2034%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D2034&t_u=https%3A%2F%2Fhipsters.tech%2Fmusica-e-tecnologia-hipsters-126%2F&t_e=M%C3%BAsica%20e%20tecnologia%20%E2%80%93%20Hipsters%20%23126&t_d=M%C3%BAsica%20e%20tecnologia%20-%20Hipsters%20%23126%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=M%C3%BAsica%20e%20tecnologia%20%E2%80%93%20Hipsters%20%23126&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Andre Luis","comment":"Não faltam softwares para gravação e composição no Windows: FL Studio, Reaper, Ableton Live, Studio One... FL Studio, um dos mais usados para EDM e Hip Hop, custa a partir de 99 doletas."},{"author":"Andre Luis","comment":"Só um detalhe: instrumentos eletrônicos podem gerar som ou reproduzir e manipular sons prontos (samples) . Sintetizadores digitais também geram som a partir do nada."},{"author":"Andre Luis","comment":"midi = json, sacou ?midi é só um padrão de comunicação, um arquivo txt cheio de comandos. O hardware (placa de som, sintetizador, sequenciador) interpreta esse comandos e produz o som."},{"author":"Atila Augusto","comment":"Paulo sobre sua dúvida com relação a autorização de uso da música aconselho entrar em contato com a Ubem ela trabalha com as principais editoras do mercado e tem diversos convênios http://www.ubem.mus.brVai te economizar um bom tempo na próxima.Sugestão de episódio:Funcionamento tecnológico para remuneração do compositor de música na era digital. Muita gente não faz ideia de como tecnologias como YouTube e Spotify fazem para pagar o autor de uma música e tão pouco o que essas empresas fazem para tornar isso viável(como o Ecad faz).Abraço e ótimo EP."},{"author":"Fernando Boaglio","comment":"O MIDI (Musical Instrument Digital Interface) não passa de um padrão de comunicação entre um teclado analógico e um reprodutor de áudio. Quando ele foi criado nos anos 80, era possível conectar um teclado musical em um computador da linha MSX (aqui no Brasil era o modelo HotBit vendido pela Sharp e o Expert vendido pela Gradiente). Naquela época também esse computador tinha alguns MIDI players . Na era GeoCities no começo da Internet também os arquivos MIDIs eram usados para fazer a \"musiquinha\" nos sites.   Anos depois da criação do MIDI veio a linha dos micros Amiga com quatro canais de som e surgiram os arquivos MOD, e outros formatos mais modernos que suportam mais canais de som. Desde essa época surgiu um estilo de música nesse esquema chamado Chiptune, com gente fazendo até show com isso, como por exemplo a ComputeHer."},{"author":"Rafael Felipe","comment":"Fala aí pessoal, sou desenvolvedor de software (motivo de acompanhar o hipsters) mas também fui músico profissional (tecladista) e conheço bem essas tecnologias desde 1998, vou tentar contribuir um pouco.MIDI é um protocolo serial de mensageria (literalmente), literalmente você envia pacotes de mensagens (poucos bytes, acredito que são 3 por mensagens normalmente). É um protocolo extensível, quase como um HTTP, pois sobre ele é possível criar outros protocolos.Um arquivo MIDI nada mais é do que um LOG de mensagens midi, que pode ser reproduzido por qualquer instrumento MIDI (desde as placas de som mais antigas, passando por sintetizadores em hardware até sintetizadores por software)Diferente do que foi dito, MIDI já aceita velocidade (sensibilidade) desde o início, o que ocorre é que no passado a maioria das pessoas produzia músicas midi escrevendo diretamente numa partitura que era convertida pra midi, e a partitura não te dá tantas nuances de sensibilidade quanto tocar de verdade (além do fato dos editores antigos também não te ajudarem). OU então as placas de som mais antigas não aceitavam os comandos de velocidade.Pra complementar outra informação, ao contrário do que foi dito, não é raro hoje em dia pessoas com instrumentos totalmente analógicos e modernos (eu mesmo possuo 2), é uma tendência de nicho como o vinil, mas entre músicos profissionais isso vem numa crescente nos últimos 10 anos (por causa do barateamento dos componentes).Outro ponto é que alguns dos instrumentos citados como o orgão hammond não são apenas analógicos eletronicamente como também são mecânicos (sim, há partes móveis dentro do instrumento).E pra fechar, com o avanço da velocidade de processamento e memória e também de chips DSP (digital signal processor) os computadores ficaram cada vez mais capazes de processar em realtime simulações do funcionamento de instrumentos (começou com as teclas mas há outros). Isso é um conceito antigo (uns 20 anos) chamado modelagem física, há vários instrumentos (e apps para iPad) que aplicam esse conceito, com base normalmente em mensagens midi, eles simulam o funcionamento mecânico, eletrônica analógica, física do sopro entre outros, de instrumentos reais. Criando uma fidelidade surpreendente, muitas vezes melhor do que o sampler (os primeiros instrumentos digitais eram todos baseados em sampler).Espero que tenha contribuído um pouco."},{"author":"Ednilson Campos","comment":"O MIDI é interpretado e o outro e compilado"},{"author":"Paulo Silveira","comment":"boa analogia"},{"author":"Otavio Reis Perkles","comment":"Seria legal ouvir vcs falando sobre o VRaptor :) Aqui na empresa onde eu estagio usamos ele para desenvolver pra web.Acompanho o podcast a muito tempo e sempre ouvi pouco sobre o assunto mesmo sendo um produto desenvolvido por vocês.Forte abraço"},{"author":"Bruno Santos","comment":"Ótimo episódio, eu não tenho amplificador de Guitarra/Baixo há tempos e em casa o Guitar Rig tem me atendido perfeitamente (basta ligar ao computador com um cabo P10 para P2). Também tive um controlador MIDI que eu usava no FL Studio e me divertia criando umas batidas hip-hop ou eletrônicas. Passei um tempo parado na música por falta de tempo mas estou retornando recentemente."}]}