{"title":"Começo de carreira – Hipsters #128","releaseDate":"25/12/2018","tags":["carreira","Podcast","programação"],"people":["Paulo Silveira","William Oliveira","Gabs Ferreira"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=2049%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D2049&t_u=https%3A%2F%2Fhipsters.tech%2Fcomeco-de-carreira%2F&t_e=Come%C3%A7o%20de%20carreira%20%E2%80%93%20Hipsters%20%23128&t_d=Come%C3%A7o%20de%20carreira%20-%20Hipsters%20%23128%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Come%C3%A7o%20de%20carreira%20%E2%80%93%20Hipsters%20%23128&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Rafael Peres","comment":"Tibia >>>>Melhor podcast"},{"author":"Jonas Sena","comment":"Bom dia/boa tade/boa noite sou novo no meio da tecnologia mas estou realmente interessado em me especializar nessa area, por gentileza amigos, me ajudem a participar de uma comunidade ativa de desenvolvedores, meu numero de celular é 71 997329821"},{"author":"kuwanger","comment":"Pode não precisar de graduação para programar, e isso eu concordo totalmente, entretanto para entrar no mercado de trabalho, um diploma faz falta sim. Pode ver que a grande maiora das vagas de desenvolvimento em Linkedin e outros portais exigem graduação. Na área de Big Data então, coloca até mestrado ou doutorado como diferenciais."},{"author":"Wanderson Silva","comment":"Cara que papo bom!"},{"author":"Gabriel Mendonça","comment":"Muito bom, inciei minha vida de programador depois de aprender muito basicamente javascript. Na época que iniciei, não tinha a mínima noção do que eu estava fazendo, mas o javascript me facilitou muito, exatamente por que eu conseguia executar no navegador de forma muito simples. Nessa época javascript nem era considerada linguagem de programação e sim somente uma linguagem de scripts. Eu rodei um primeiro programinha no windows 95, num pentium 133 \"internet explorer\". Computador da minha avó!"},{"author":"Luis Antonio","comment":"Muito bom quebrar esses mitos de que precisa de faculdade para trabalhar na área, mas acredito que vale a pena recomendar pois na faculdade tem muitos desafios a serem batidos e que fazem uma pessoa evoluir, principalmente na reta final com os trabalhos de conclusão de curso, estágios e etc.Me identifiquei bastante principalmente por que já comecei \"tarde\" na área já tinha feito outros cursos e aprendi programar meio que sozinho porem era  ruim como programador,  (ainda me acho ruim, pois sempre se tem um desafio novo e sempre tem onde melhorar).Acredito o que cabe melhor para essa profissão e regra de Pareto - \"Você precisa aprender aqueles 20% para resolver 80% dos problemas \" sendo que os 20% são logica de programação/ estrutura de dados e estatística, os melhores programadores que eu vi tinha esses pilares bem fortes e sabiam desenvolver qualquer coisa na área deles."},{"author":"Rafael Felipe","comment":"Tô colocando os podcasts em dia por conta do final do ano.Só uma colaboração, eu entendo que o Paulo Silveira gosta muito da ideia de incentivar as pessoas a começarem com javascript, e apesar de eu não discordar também acho que as barreiras iniciais das outras linguagens (como instalar um compilador e um editor de código) são tão simples, mas tão simples, que é uma barreira gostosa de transpor, e transpor barreiras ajuda no aprendizado. Logo, tem a pessoa que quer se sentir o Neo (de matrix) usando um editor de tela preta e executando código que acabou de aprender numa linguagem considerada difícil.Outra coisa interessante pra começar são as plataformas móveis (Android pois é mais acessível, mas se vc tem como começar direto com iOS parabéns, você é abastado), ver o que você está escrevendo se materializar diretamente no seu celular e ainda mostrar pros amigos e pra família depois é um baita de um incentivo a se aprimorar.O mesmo incentivo que os scripts em lua para o tíbia proporcionavam ao William."},{"author":"Marcelino","comment":"Ta faltando um episodio de LUA em Paulo!!!!"},{"author":"Fausto de Lima","comment":"Pow! legal o mano brow ter participado do podcast."},{"author":"Alexandre Silva","comment":"Fantástico o podcast, pessoal. Parabéns ao Hispters pelo excelente trabalho e ao William e companhia. Iniciar é sempre complicado, mas seguimos estudando :)"},{"author":"ronyhl2","comment":"Muito legal ver a participação do meu colega de Loggi William em um podcast que acompanho há muito tempo."},{"author":"Mário Lemanski Filho","comment":"Muito bom! Tô nos primeiros cursos e me sinto burro. Essa conversa deu uma animada.!"},{"author":"Douglas Felipe","comment":"Não esqueça de praticar! Sem pratica você não consegue aperfeiçoar seu raciocínio lógico"},{"author":"iraecio","comment":"Feliz natal ao melhor podcast da net"},{"author":"Paulo Silveira","comment":"valeu :)"},{"author":"Felipe Maia","comment":"Legal esse . Uma dica de podcast poderia ser sobre o mercado de TI nas diferentes regiões do Brasil. Muitos como eu vem pra SP pelo mercado melhor.Seria legal chamar alguém de cada região pra falar um pouco"},{"author":"Sebastião Relson Reis da Luz","comment":"Antes de trabalhar li vários livros de capa a capa e certamente tudo mudou quando tive experiência prática."},{"author":"Dejair Sisconeto","comment":"- Lógica de Programação- C- Estrutura de dados e Algoritmos - Orientação a Objetos com (Java, C#, PHP)- Diagrama de Classes da UML- Banco de Dados- HTML, CSS e Javascript- Frameworks- Código Limpo- TDD"},{"author":"Shinodu","comment":"Stackoverflow, a bilbia do programador"},{"author":"André Ricardo","comment":"Excelente Podcast! Realmente um presentão de Natal. Comecei na área de tecnologia no segundo semestre de 2010. Tinha finalizado o ensino médio há muito tempo e não dei continuidade nos estudos, pois, morava em uma cidade do interior de Goiás de 8 mil habitantes. Depois me mudei para Jataí-Goiás e fiz o vestibular do Instituto Federal de Goiás - Campus Jataí e consegui ser aprovado. Iniciei o Curso de Tecnologia em Sistemas de Informação em 2010/2. Me apaixonei pela área de tecnologia. Em 2011 tive a oportunidade de trabalhar em uma empresa de software de automação comercial local, como Suporte Técnico. Desde então trabalhei em várias empresas da cidade. Trabalhei com desenvolvimento PHP por dois anos. E atualmente sou servidor público federal na mesma cidade (UFG - Universidade Federal de Goiás - Regional Jataí). Graças a Deus ainda atuando na área. Parabéns pelo projeto do Hipster Ponto Tech e um excelente 2019 para todos. Feliz Natal! Lembrando que cada um tem seu tempo. Ninguém está atrasado ou adiantado. Abraço galera. Que a força esteja com vocês!"}]}