{"title":"Qualidade e Software no Itaú – Hipsters #131","releaseDate":"15/01/2019","tags":["Podcast","programação"],"people":["Paulo Silveira","João Paulo Surian","João Bezerra","Adriano Almeida"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=2074%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D2074&t_u=https%3A%2F%2Fhipsters.tech%2Fqualidade-e-software-no-itau-hipsters-131%2F&t_e=Qualidade%20e%20Software%20no%20Ita%C3%BA%20%E2%80%93%20Hipsters%20%23131&t_d=Qualidade%20e%20Software%20no%20Ita%C3%BA%20-%20Hipsters%20%23131%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Qualidade%20e%20Software%20no%20Ita%C3%BA%20%E2%80%93%20Hipsters%20%23131&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Antonio Maniero","comment":"O que achei curioso é que o app principal do Itaú não é bem acessível nem pra quem não tem dificuldades específicas. Tem uma quantidade absurda de problemas de UX. Mas eles estão seguindo todas metodologias da moda. Só falta isto trazer resultados. Desculpem o desabafo, mas não aguento mais ter tantos problemas com um app tão importante e ter que ouvir que eles estão fazendo um trabalho maravilhoso. Pelo menos podiam reconhecer que o trabalho não está bom, aí começaria melhorar. Onde está bom não vai melhorar. Chega ter \"index out of range\" em algo banal por meses, você reclama e nada é feito. Até na agência eles dizem que o TI não os ouvem."},{"author":"Luciano Soares","comment":"Ele usou vários termos de metodologias agile que gostaria de ler escritos pois não os conheço."},{"author":"Giorgio","comment":"...."},{"author":"Ana Carolina Toledo","comment":"Muito bom o papo. Porém um papo sobre acessibilidade deveria no mínimo, ser acessível e ter transcrição pelo menos, poxa :/"},{"author":"Willian","comment":"Achei o papo interessante, mas foi 90% sobre acessibilidade. Não sou contra esse assunto, mas poderiam fazer um novo papo futuramente focando a conversa em qualidade no desenvolvimento(cobertura de testes, quais tipos de testes automatizados usam, métricas de bugs, etc)Parabéns pelo trabalho, podcast de qualidade!"},{"author":"igorsantos07","comment":"Esse comentário foi apagado."},{"author":"igorsantos07","comment":"Eles falam bastante de qualidade mesmo, mas é divertido ouvir \"#zeroErro\", sobre a atenção com batch systems e mainframes e tudo mais, ao mesmo tempo que tô discutindo com o banco um problema que já tive 3 vezes nos últimos meses, espaçadamente: lançamentos agendados ou débito automático que some do extrato em dias aleatórios, que some no dia como se não fosse pago, mas aparece no dia seguinte como pago, etc.Inconsistência no extrato bancário é o OPOSTO a qualidade e estabilidade num sistema bancário!"},{"author":"Paulo Silveira","comment":"acho que vale a pena ouvir! eles falam de problemas desse tipo, de atingir a todos e todos dispositivos. mas sem duvida esse de dispositivos é um desafio de toda empresa. a gente sofre bastante aqui tambem :)"}]}