{"title":"Lua, Brasil e Games – Hipsters #132","releaseDate":"22/01/2019","tags":["Podcast","programação"],"people":["Paulo Silveira","Etiene Dalcol","Maurício “Balboa” Linhares","Roberta Arcoverde"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=2082%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D2082&t_u=https%3A%2F%2Fhipsters.tech%2Flua-brasil-e-games-hipsters-132%2F&t_e=Lua%2C%20Brasil%20e%20Games%20%E2%80%93%20Hipsters%20%23132&t_d=Lua%2C%20Brasil%20e%20Games%20-%20Hipsters%20%23132%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Lua%2C%20Brasil%20e%20Games%20%E2%80%93%20Hipsters%20%23132&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"mejingjard","comment":"AEEEEEEEE RAGNAROKKK !!!!!! joguei ragnarok por uns 8 anos :)  e tbm usei LUA enquanto joguei o jogo pra scrips dos homunculus e bots"},{"author":"Lazarone Santana","comment":"Opa beleza.Sobre LUA é interessante dar uma olhada em uma plataforma que ainda está em versão beta porem muito poderosa que é CharonPlatform!https://github.com/charonpl...Da para programar script, desktop, web e etc."},{"author":"Jonatan Dutra","comment":"O link do \"Maurício “Balboa” Linhares\" e da \"Roberta Arcoverde\" estão direcionando para os perfis de pessoas que participaram em um episódio anterior (sobre acessibilidade se não me engano). Será que o \"Copy & Paste\" atacou novamente ?  Do mais, parabéns pelo trabalho.  Abs"},{"author":"Gabs Ferreira","comment":"Opa, atacou mesmo!Corrigimos aqui Jonatan ;)"},{"author":"Marcelino","comment":"Tem uma serie no Grock Podcast (das antigas) com o professor Roberto Ierusalimschy sobre Lua.http://www.grokpodcast.com...."},{"author":"Roberta Arcoverde","comment":"Eu curtia muito as aulas dele. Tinha uma reputação de ser um professor muito exigente (e era mesmo). Fiz todas as disciplinas no mestrado que ele oferecia, e lembro duma saia justa em que me coloquei quando fui avisá-lo que iria faltar 3 semanas de aula pq ia viajar de férias. Ele ficou abismado - \"Como assim férias, no meio do semestre???\". Os problemas de ser aluna de tempo parcial :D"},{"author":"Marcelino","comment":"A referencia que tenho dele e só essa serie do Grock mesmo, mas sempre lembro da uma frase dele no ultimo episódio eu acho, na qual ele disse “que não acreditava em linguagem de propósito geral”, e isso na época me esclareceu muito, ainda mais que nesse tempo rolava muito \"flame war\" de linguagem e etc, admiro muito Lua e toda a historia do projeto, apensar se nunca ter tido a necessidade de usa-la.Mas agora me deu uma duvida, o Stack Overflow usa Lua em algo? No que acha daria pra usar lá?"},{"author":"Roberta Arcoverde","comment":"Não usamos! Imagino que poderia ser útil pra scriptar algumas coisas de infra (talvez uma extensao do Redis), mas o pessoal de DevOps/SRE já tem suas linguagens e ferramentas favoritas, como Go."},{"author":"disqus_sqqi4eQHeA","comment":"Eu ia sugerir um podcast sobre lua, mas como já fizeram, valeu."},{"author":"Mario Souto","comment":"Tô so esperando citarem Tibia haha"},{"author":"Andre Leonardo","comment":"sim"},{"author":"Maurício Linhares","comment":"\n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n"}]}