{"title":"Primeiros Passos em Data Science: Do Excel e BI ao Python – Hipsters #134","releaseDate":"05/02/2019","tags":["Podcast"],"people":["Paulo Silveira","Leticia Portella","Paulo Vasconcellos","Guilherme Silveira","Maurício “Balboa” Linhares","Roberta Arcoverde"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=2112%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D2112&t_u=https%3A%2F%2Fhipsters.tech%2Fprimeiros-passos-em-data-science-do-excel-e-bi-ao-python-hipsters-134%2F&t_e=Primeiros%20Passos%20em%20Data%20Science%3A%20Do%20Excel%20e%20BI%20ao%20Python%20%E2%80%93%20Hipsters%20%23134&t_d=Primeiros%20Passos%20em%20Data%20Science%3A%20Do%20Excel%20e%20BI%20ao%20Python%20-%20Hipsters%20%23134%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Primeiros%20Passos%20em%20Data%20Science%3A%20Do%20Excel%20e%20BI%20ao%20Python%20%E2%80%93%20Hipsters%20%23134&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Elizeu Castro","comment":"Encontrei aqui os passos para criar um gráfico de pizza perfeito.\n\n\nVisualizar\n\n\n Ocultar\n\n\n\n"},{"author":"Murilo Rodrigues Moreira","comment":"Data visualization - https://www.ibpad.com.br/bl...\n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n\n"},{"author":"Marco Tulio Venturelli Nascime","comment":"Essa é a versão em português do Storytelling With Data, da Cole Nussbaumer Knaflic: https://books.google.com.br..."},{"author":"Ricardo Grego","comment":"Acho que faltou o link do Storytelling With Data, da Cole Nussbaumer Knaflic: http://www.storytellingwith..."},{"author":"Fernando Boaglio","comment":"depois de escutar esse podcast já sei o que vou jantar hoje! #vaigordinho"},{"author":"Paulo Silveira","comment":"Legal que todo mundo curtiu :). Vem mais por aí!"},{"author":"Breno Valadares","comment":"Com certeza o melhor episódio dos Hipsters, amei, pfvr mais episódio sobre o tema!!!!"},{"author":"Leonardo Rodrigues Lima de Sou","comment":"Muito boa discussão, e cabe ainda dizer que muitas das vezes o cliente não tem dado, e nós não encontramos as respostas que ele gostaria de encontrar e quer ver uma magia acontecendo. Ser cientista de dados é lidar com esse hype também, e prováveis frustações dos clientes."},{"author":"Walter","comment":"Uoww, o site do Data Hackers é lindo."},{"author":"Walter","comment":"Orange é uma opção melhor ao Weka, por mais que acredite que ambas as ferramentas ferram com teu flow. Meta Learn parece bem legal, Auto ML do Google tá com tudo nesse campo. R está sumindo, Julia surgiu e desapareceu bem rápido... Python <2, ha ha."},{"author":"Leonardo Rodrigues Lima de Sou","comment":"R desaparecendo, onde ? Tem muita gente que usa. Comunidade enorme."},{"author":"Walter","comment":"Há dois anos atrás todos da faculdade em que estudo utilizavam R em Mineração de Dados, Deep Learn, Tratamento e Análise de Dados, etc; hoje migraram para Python. Uma grande quantidade de frameworks vem possibilitando a criação de redes mais complexas, tais como Sonet, PyTorch, Keras, Fast AI, etc; em competições do Kaggle uma grande maioria utiliza Python... pessoalmente não vejo R a meses. Fora que o Python (assim como o R provavelemnte) tem bind do R para Python."},{"author":"Roberta Arcoverde","comment":"Aqui na Stack, os data scientists só usam R :)"},{"author":"Walter","comment":"Legal, por que ? Eles tem uma pegada mais estatística pura ? (caramba tu é diferente do que imaginava, imaginava parecida com ela \n\n\nReproduzir\n\n\n Ocultar\n\n\n\n\n kkk)"},{"author":"Roberta Arcoverde","comment":"Bem, eles certamente são bem versados em estatística :) A Julia (nossa atual cientista-chefe) é PhD em astrofísica e autora do TidyText (tanto a biblioteca quanto o livro): https://www.tidytextmining.... Já o David Robinson, que é co-autor e foi quem fundou nossa área de Data Science, hoje é Chief Data Scientist na DataCamp e tbm tem um PhD em biologia computacional. Diga-se de passagem que a comunidade de R lá fora parece ser bem ativa. Quanto às minhas similaridades com a Fabiane: acho que ela é mais alta. xD"},{"author":"Paulo Silveira","comment":"sei que nao foi sua intencao, mas isso sim foi uma bela carteirada hein Roberta?  hehe. isso sim é uma boa host de podcast"},{"author":"Marco","comment":"Esse comentário foi apagado."},{"author":"Marco","comment":"\"No USA, o uso de software open-source gera muita desconfiança, o R é mais usado por causa disto\"Acho que isso ta meio estranho, não entendi bem o que vc quis dizer, pq o R é open source, assim como o Python (ou de forma bem parecida)"},{"author":"Walter","comment":"PhD everywhere, parece o Kaggle. Acho que tu se parece com ela pois tu demonstra uma carga de conhecimento insana e fala de forma calma que nem ela, kkkk."},{"author":"Kemel Zaidan","comment":"Qual é o nome do livro de data storytelling? Não achei um nome exato, mas alguns títulos semelhantes. Por acaso é o \"Storytelling with Data\", da Cole Nussbaumer Knaflic?"},{"author":"andre","comment":"Isso! E tem em português, sim!https://www.amazon.com.br/S..."},{"author":"Leonardo Rodrigues Lima de Sou","comment":"Esse é a referência na minha opinião."},{"author":"Marcio","comment":"Fico feliz em saber que tem um nome a minha atividade profissional. Sou cientista de dados! Faço praticamente todos os processos e análises que citaram, para chegar à conclusões e respostas, incluo também o geoprocessamento. Até hoje eu venho dizendo que sou pesquisador, o que é muito vago e as pessoas continuavam sem entender o que faço."},{"author":"Welton Vaz de Souza","comment":"Olha a sincronização, comecei a ler \"Python para análise de dados -Tratamento de dados com Pandas, NumPy e IPython do autor: Wes McKinney. É no meu podcast preferido de tecnologia o tema é: Primeiros Passos em Data Science: Do Excel e BI ao Python – Hipsters #134 Obrigado @paulo_caelum @mauriciojr @rla4 vcs são demais!"}]}