{"title":"Carros Elétricos e Programação – Hipsters #135","releaseDate":"12/02/2019","tags":["Podcast","programação"],"people":["Paulo Silveira","Henrique Bierwagen","André Breves","Roberta Arcoverde","Maurício “Balboa” Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=2124%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D2124&t_u=https%3A%2F%2Fhipsters.tech%2Fcarros-eletricos-e-programacao-hipsters-135%2F&t_e=Carros%20El%C3%A9tricos%20e%20Programa%C3%A7%C3%A3o%20%E2%80%93%20Hipsters%20%23135&t_d=Carros%20El%C3%A9tricos%20e%20Programa%C3%A7%C3%A3o%20-%20Hipsters%20%23135%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Carros%20El%C3%A9tricos%20e%20Programa%C3%A7%C3%A3o%20%E2%80%93%20Hipsters%20%23135&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Bob","comment":"Muito obrigado pessoal, o assunto é por demais estimulante para estudarmos!"},{"author":"Tiago Aguiar Moreira","comment":"Muito legal. É um mercado que está crescendo e se tornando mais real a cada dia. Imagino que este mercado no Brasil não esteja caminhando na mesma velocidade que outros países, mas queria saber saber como estamos."},{"author":"Rodrigo Medeiros","comment":"Episódio fantástico. Fui criado na autoelétrica de meu pai, hoje trabalho como programador full stack e tenho como passatempo projetos IoT. O episódio cai como músicas aos meus ouvidos. Hahaha."},{"author":"Italo Sampaio","comment":"Sensacional esse episódio. Trabalho com sistemas embarcados e escuto o podcast mais pra ficar a par do mercado de software em geral, mas é muito bom ver vocês abrindo espaço pra setores \"menos conhecidos\" do mercado. Acredito que muita gente tenha interesse em estudar a parte de sistemas embarcados, sistemas de tempo real, brincar com microcontrolador e estudar as entranhas de um SO, mas não saiba por onde começar. Um episódio desse ajuda a galera a ter pelo menos um caminho pra começar.good job!"},{"author":"Evandro Teixeira","comment":"Italo Sampaio  vamos fazer um campanha para que tenha um episodio sobre e Sistemas Embarcados. Convencer o @Mauricio Linhares e @Paulo Silveira."},{"author":"Maurício Linhares","comment":"hahaha, a gente quer fazer um sim sobre o assunto, vai acontecer :D"},{"author":"Evandro Teixeira","comment":"Legal!!!Maurício Linhares como eu disse o Portal Embarcados tem pessoal que maja bastante do assunto, também gostaria de sugerir o Sergio Prado, pois possui muito conhecimento na área em especial em aplicação com Linux Embarcado.https://sergioprado.org/"},{"author":"Marcus Vinícius","comment":"Sensacional o conteúdo, bem diferente da realidade da maioria dos programadores tradicionais. Aproveito para sugerir um podcast de tecnologia e aviação, já que são dois temas diretamente relacionados (inclusive citado no decorrer do podcast). Além do fato de possuirmos aqui no Brasil a terceira maior empresa de aviação do mundo, a Embraer (que até por sinal estava contratando recentemente desenvolvedor C, para trabalhar nos sistemas de radares aeronáuticos). Parabéns pelo conteúdo!!!"},{"author":"Maurício Linhares","comment":"Esse já saiu viu https://hipsters.tech/softw..."},{"author":"Marcus Vinícius","comment":"Rapaz como eu pulei esse episódio!!!!!!!!! Irei escutar hoje mesmo. Valeu, abraço."},{"author":"Evandro Teixeira","comment":"Excelente episodio, Parabéns.Aproveitando que nesse episodio falou bastante de Sistema Embarcados, Linguagem C e Hardware, gostaria de sugerir de sugerir um episodio sobre Sistemas Embarcado. Poderia convidar o pessoal do portal Embarcado https://www.embarcados.com.br/ ."}]}