{"title":"Tecnologias no Banco BTG – Hipsters #136","releaseDate":"19/02/2019","tags":["Podcast","programação"],"people":["Paulo Silveira","Gustavo Roxo","Maurício “Balboa” Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=2146%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D2146&t_u=https%3A%2F%2Fhipsters.tech%2Ftecnologias-no-banco-btg-hipsters-136%2F&t_e=Tecnologias%20no%20Banco%20BTG%20%E2%80%93%20Hipsters%20%23136&t_d=Tecnologias%20no%20Banco%20BTG%20-%20Hipsters%20%23136%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Tecnologias%20no%20Banco%20BTG%20%E2%80%93%20Hipsters%20%23136&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Tiago Aguiar Moreira","comment":"Se tratando de banco e sabendo da disponibilidade que eles precisam, o importante é saber se pagam hora extra, porque com certeza serão necessárias haha"},{"author":"Walter","comment":"26:00 Engraçado pois é justamente os bancos (junto aos políticos) que causam inflação, mas deu a entender que eles são o salvadores, unhum sei ( ͡° ͜ʖ ͡°)."},{"author":"Walter","comment":"O ruim desses podcasts é que mencionam os itens: nuvem, segurança, etc; mas não como realmente funciona - em código, arquiteturalmente, etc (cliche)."},{"author":"Olavo de Carvalho","comment":"Parabéns pelo Podcasts. Mais eu conheço a BTG de outra maneira , pra quem é trader a BTG bate forte no pessoal. quando você pensa que ta ganhando ela boleta no day trade e mata seu lucro kkk.Podem procurar UBS BTG"},{"author":"IVONILSON","comment":"Paulo, boa noite! Admiro muito seu trabalho e sou ouvinte assíduo do podcast (Hipsters). Você tá devendo nesse ano um episódio onde falaria sobre as tendências que se concretizaram em 2018, as quais foram abordadas no ep. 077. Abraço ao Linhares, a Roberta, ao Sérgio e a todos. Sempre que posso estou recomendando este maravilhoso podcast a todos. Valeu!!!   Ivonilson - Planaltina GO."},{"author":"jurandir neto","comment":"A do Pagseguro ficou pra quando ? tantas coisas legais rolando aqui."},{"author":"James Kamradt Jr.","comment":"É claro que ele não gosta de blockchain,  a ideia dela e do bitcoin é descentralizar, tchau tchau banco :) apoiar a ideia de blockchain é apoiar o fim dos bancos."},{"author":"Welton Vaz de Souza","comment":"Os Bancos não tem medo do blockchain ou das criptomoedas. Eles sim, tem medo da Amazon ou Google lançarem um moeda mundial!"},{"author":"James Kamradt Jr.","comment":"verdade ;)"},{"author":"Maurício Linhares","comment":"Ainda tem gente que acredita que bitcoin é descentralizado em 2019? Acho que precisamos de outro hipsters sobre isso hahahaha."},{"author":"James Kamradt Jr.","comment":"ok vamos dizer que na Venezuela hoje as pessoas comecem a usar bitcoin, a padaria, o posto de combustivel, o mercado, a farmacia  comece a usar Bitcoin, as pessoas usem bitcoin, quem seria responsavel sobre essas movimentações? qual banco? a volatilidade da moeda ainda seria um problema,  mas o povo teria seu proprio poder economico, se isso não é ser descentralizado, não sei mais o que é, vou estudar mais sobre isso, inclusive escutar esse podcast que indicou, obrigado."},{"author":"Maurício Linhares","comment":"O custo de transações é muito alto, os blocos de mineradores, especialmente os chineses, já comprovaram que existe centralização e que no fim das contas eles é quem mandam na coisa toda, é impossível lidar com roubo e rodar um minerador pra manter a blockchain local é caríssimo pra maior parte das pessoas. E hoje bitcoin é só pump & dump, se houve alguma esperança de servir pra alguma coisa alem de especulação ela morreu."},{"author":"Paulo Silveira","comment":"Esse comentário foi apagado."},{"author":"Paulo Silveira","comment":"manda a lista dos livros!!"}]}