{"title":"Desafios em Machine Learning – Hipsters #137","releaseDate":"26/02/2019","tags":["Podcast","programação"],"people":["Paulo Silveira","Mariana Jó","Luis Moneda","Guilherme Silveira","Roberta Arcoverde","Maurício “Balboa” Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=2171%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D2171&t_u=https%3A%2F%2Fhipsters.tech%2Fdesafios-em-machine-learning-hipsters-137%2F&t_e=Desafios%20em%20Machine%20Learning%20%E2%80%93%20Hipsters%20%23137&t_d=Desafios%20em%20Machine%20Learning%20-%20Hipsters%20%23137%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Desafios%20em%20Machine%20Learning%20%E2%80%93%20Hipsters%20%23137&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"darlanl","comment":"Oque não me entra na cabeça e brigar com os dados sendo que eles refletem a realidade. Se temos uma realidade ruim e discriminatória mudar a amostra vai piorar a qualidade do produto. Exemplo recomendações ruins da netiflix que a  cada dia está pior.Entendo que o impacto da informação gera um ciclo recursivo na sociedade, mas não deve ser vista como o dado sendo o problema e sim as nossa atitudes perante aos dados. Muitas pessoas da área de humanas tem dificuldade de ter discernimento para analisar a situação usando fatos. Tendo os fatos em mãos, como podemos melhorar? Se a violência e criminalidade é maior entre negros, o que julgaria relevante como ponderação seria, a existência de falhas ou injustiças nos julgamentos, sob penalização das confiança dos julgamentos.A ponderação em fatos de ponderação e ações... Se não estamos nos enganando!"},{"author":"Danilo","comment":"Gostei muito desse podcast sobre luta de classes, aliás, sobre machine learning."},{"author":"Bernardo Costa","comment":"psolista hardcore essa mulher."},{"author":"Junior Osho","comment":"Maurício “Balboa” Linhares.. Como sempre argumentos fantastic...!!!"},{"author":"Thiago Benevides","comment":"Esse episódio foi um dos que ficou na minha cabeça por alguns dias depois de ouvi-lo, fiquei pensando nos problemas apresentados por vocês e como eu resolveria.No caso da Netflix o que pensei foi em usar o tempo que uma pessoa leva para assistir uma série para indicar outras, por exemplo digamos que uma pessoa não seja um hard user da plataforma mais goste muito de uma determinada série, pelo menos uma vez por ano ela vai se comportar como um hard user fazendo maratonas, então usaria o tempo que a pessoa demorou para assistir uma série como peso para fazer futuras indicações.No caso da alura sobre indicação de cursos, pensei em várias hipóteses uma delas é pelo hype da tecnologia, por exemplo, machine learning está em um hype muito forte, então é natural que exista uma demanda grande por essa área, desta forma tentaria fazer um cluster das pessoas pelo hype e ver quantas pessoas são levadas pelo hype, desta forma poderia predizer qual será o próximo hype e preparar cursos e indicações sobre este tema. Outra coisa que pensei em usar é um carrossel para indicar cursos, desta forma acredito que poderia usar o um modelo matemático chamado, andar do bêbado assim consigo ver a probabilidade de um usuário ir para um curso ou outro.No caso da Nubank o que pensei é definir o que é um consumidor compulsivo desta forma consigo fazer um cluster com esse tipo de usuário e com isso testar a seguinte hipótese. Será que consumidores compulsivos têm um risco de crédito maior? Se a hipótese for comprovada como real consigo criar iniciativas para ajudar essas pessoas, por exemplo, fazer uma extrapolação numérica para ver quando a pessoa ficará sem dinheiro, assim posso disparar um alerta do tipo “ei se você continuar gastando desta forma ficará sem dinheiro em tantos dias”."},{"author":"Eduardo P Montenegro","comment":"Sensacional o episódio e acredito que estamos vivenciando um momento que terá uma relevância e um impacto histórico gigantesco.Como uma provocação filosófica, pois entendo que a parte técnica e científica será resolvida, o grande desafio será a avaliação, ou a reavaliação, do que significa sermos humanos...O capítulo deste PDF que fala sobre \"God AI\", é uma leitura bem interessante, bastante provocativa...https://www.goodreads.com/b...(O documento é público e não é difícil achar na internet)"},{"author":"Elías","comment":"Mais um ótimo podcast!Em relação, por ex., à utilização de machine learning para reincidência em crime (ou outras questões sociais), ficou a dúvida/questionamento de até que ponto apenas algumas pessoas devem ser responsáveis por algo tão importante como isso, que influencia a toda uma sociedade. Soa estranho, mas parece que nestes casos também deveria haver uma espécie de \"Judiciário/STF\" (obs: não burocrático/imparcial) para os resultados do machine learning."},{"author":"Juliano Soares","comment":"Como é a proporção entre python e scala? O pessoal fala de scala em datascience, mas olhando no github o eu percebi uma utilização de c++ muito superior que scala."},{"author":"DarkElf","comment":"Para onde essa conversa foi indo?"},{"author":"Yuri Müller","comment":"Muito interessante. Estou terminando meu doutorado e quero entrar no mercado, realmente estou passando pela adaptação descrita por vocês."},{"author":"Lucas Vieira","comment":"Gosto muito do trabalho de vocês, não perco nenhum, vocês tem os melhores podcast de TI. Mas, esta abordagem de viés ideológico neste episódio foi chata. Estragou o Podcast!"},{"author":"Lys' Ace T.","comment":"Ué, viés ideológico? Eles só falaram de um problema muito grave em machine learning. Se é um problema, tem que ser tratado e falado com o público, não ficar ignorando isso. Pesquise por isso:https://en.wikipedia.org/wi..."},{"author":"Geison Santos","comment":"Correto. A questão de viés nos dados é tão relevante que há pesquisas sobre o tema. Um bom artigo sobre foi publicado na InfoQ"},{"author":"Bruno Guimarães Carneiro","comment":"Em resumo: \"se a realidade e os dados não correspondem a minha visão de mundo, os dados e a realidade estão errados.\""},{"author":"Bernardo Costa","comment":"Bizarro isso. O cara do nubank foi mais sensato, da do exemplo do erro muito diferente te para brancos e negros. Mas a mulher é muito enviesada, foi triste"},{"author":"Paulo Silveira","comment":"esqueci de falar outra máxima: \"é inteligencia artificial ou machine learning? se é em python é machine learning. se é em powerpoint é inteligencia artificial. ahhahaha\""},{"author":"Matheus Alves","comment":"hahahahaha"},{"author":"Olavo de Carvalho","comment":"Cara muito bom o podcast. E eu me encaixo no data Science mais ainda por viabilidade de slário fico no Analista de BI e CRM. Isso é o que mata.E realmente o Python é um novo excel cara, chega no limite da ferramenta que no python ou studioR é mais fácil de trabalhar. Depois você pode disponibilizar no Power BI Tableu QlikView"}]}