{"title":"Automação residencial – Hipsters #140","releaseDate":"19/03/2019","tags":["Podcast","programação"],"people":["Paulo Silveira","João Carlos","Jose Peleteiro","Ricardo Merces","Maurício “Balboa” Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=2211%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D2211&t_u=https%3A%2F%2Fhipsters.tech%2Fautomacao-residencial-hipsters-140%2F&t_e=Automa%C3%A7%C3%A3o%20residencial%20%E2%80%93%20Hipsters%20%23140&t_d=Automa%C3%A7%C3%A3o%20residencial%20-%20Hipsters%20%23140%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Automa%C3%A7%C3%A3o%20residencial%20%E2%80%93%20Hipsters%20%23140&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"nandexxx","comment":"Esse foi o primeiro podcast  hipsters.tech que eu achei muito ruim! Automação residencial é muito mais do que foi discutido e os convidados “experts” mal conseguiram explicar a parte maker da coisa toda."},{"author":"Seulunga@Azralon","comment":"Amperagem e voltagem?É tensão e corrente porra! Pqp.."},{"author":"nandexxx","comment":"Pois é"},{"author":"Seulunga@Azralon","comment":"Segundo a própria Rasp foundation mais de 6 milhões de unidades são usadas na indústria.Então essa de dizer que não vai usar Rasp direto tá meio mal."},{"author":"Evandro Teixeira","comment":"Muito legal esse episódio. Mas precisa urgentemente um episódio sobre Sistemas Embarcados, pois o Host @Paulo Silveira acha que hardware se resume a Arduino e Raspberry Pi e pior, o código desenvolvido para esses sistemas se resume a um grande bloco de código cheio de if e else. E Não leva em conta que existe engenharia extrema complexa por trás desses sistemas."},{"author":"Antonio Campos","comment":"Paulo Silveira tava de boa pq ele queria respostas, e deixou claro q ele não entendia. O pior foram as respostas que ele conseguiu dos convidados... Tipo: Paulo perguntou sobre a estrutura de desenvolvimento de loop infinito \"While True\" - e o cara veio me responder sobre Home assistant e Hubs de automação, mudou totalmente de assunto. E Linhares ainda tentou ajudar dizendo: \"mas e no dispositivo, vc não tem que implementar um loop pra ficar escutando as requisições para ele!?\" ai o entrevistado: \"Não\" ... Acredito que eles queriam resposta do tipo: se vc quiser implementar uma solução mais robusta em microcontroladores vc pode utilizar interrupções e tal... Esse podcast foi bom mas ficou meio embaralhado"},{"author":"Paulo Silveira","comment":"hahha. pior que me descreveu bem!"},{"author":"Evandro Teixeira","comment":"Bora fazer um episódio sobre sistema embarcado falar de microcontrolador a FPGA (hardware de maneira geral), e de desenvolvimento software baremetal, RTOS e Linux Embarcado."},{"author":"Antonio Campos","comment":"Convida o Pessoal do www.embarcados.com.br"},{"author":"Evandro Teixeira","comment":"Sim, Eu já sugeri em outra oportunidade de convidar o pessoal do Portal Embarcados. Inclusive já contribui algumas vezes com site, segue o link para meu artigos:https://www.embarcados.com...."},{"author":"peleteiro","comment":"Eu digo que vejo o Arduino mais como prototipagem e não como algo que eu usaria no final, com o produto pronto e de forma profissional. Estava errado, estudando mais descobri que para coisas que usam baterias ou pilhas o controle de consumo do Arduino (hardware) é bem melhor que o do Esp8832.Então para esses casos estou experimentando Arduino com radio 2.4ghz. No link abaixo tem um experimento/explicação bem bacana sobre isso.https://www.mysensors.org/b..."},{"author":"Joallyson Castro","comment":"Muito bom esse episódio Silveira, IoT é um assunto que tem me interessado bastante. Ainda não conhecia o Home Assistant e o OpenHab, obrigado pelas dicas. Só um detalhe, o áudio dos entrevistados não tava muito legal. Abraço!!"},{"author":"Renato","comment":"Muito bacana o episodio, tenho um amigo de trabalho que está se formando em engenharia de controle e automação e sempre está usando Arduíno para n projetos !Pena que essas soluções (tomada inteligente, etc)  não são de custo baixo para pessoas com um poder aquisitivo baixo, pois a economia de custo e tempo utilizando essas ferramentas as vezes é gritante."},{"author":"Paulo Roberto Franco Pinto","comment":"O audio do convidado ficou muito ruim."}]}