{"title":"ERPs, Arquiteturas e TOTVS – Hipsters Ponto Tech #141","releaseDate":"26/03/2019","tags":["business","Podcast","programação"],"people":["Paulo Silveira","Angela Gheller Telles","Felipe Jacob","Fabio Rocha","Adriano Almeida"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=2220%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D2220&t_u=https%3A%2F%2Fhipsters.tech%2Ferps-arquiteturas-e-totvs-hipsters-ponto-tech-141%2F&t_e=ERPs%2C%20Arquiteturas%20e%20TOTVS%20%E2%80%93%20Hipsters%20Ponto%20Tech%20%23141&t_d=ERPs%2C%20Arquiteturas%20e%20TOTVS%20-%20Hipsters%20Ponto%20Tech%20%23141%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=ERPs%2C%20Arquiteturas%20e%20TOTVS%20%E2%80%93%20Hipsters%20Ponto%20Tech%20%23141&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Bruno Xavier Melo","comment":"Poderia colocar no player para aumentar a velocidade. Melhor podcast <3"},{"author":"Silvair L. Soares","comment":"Se estiver utilizando o Google Chrome Desktop execute os seguintes passos:1 - Pressione F12;2 - Na janela \"DevTools\", vá para a aba \"Concole\";3 - Copie e cole as duas linhas abaixo:var vid = document.getElementById(\"audio-2220-1\");vid.playbackRate = 1.5;Obs.: Altere o valor da propriedade \"playbackRate\" para a velocidade que você desejar."},{"author":"Everton Souza","comment":"Ola amigos do Hipsters! Excelente Episodio, sou Analista de Sistemas, já trabalhei na implementação de dois ERP´s em empresas e uma delas tem sistemas em Clipper.  Episodio voltado para o mundo REAL. parabéns ShoW"},{"author":"Marcelo Mota Ribeiro","comment":"Muito eufemismo usado para substituir a palavra \"gambiarra\"."},{"author":"Batata Batata Batata","comment":"Sobre o nome TOTVS, temos que ter muito, mas muito cuidado quando falamos sobre o que não entendemos.Lá em 2009 deram um puxão de orelha no tal \"latim\" dessa galera.http://observatoriodaimpren...(O trecho abaixo fala sobre o anúncio impresso que a empresa fez no Valor Econômico) E na página dois, um anúncio tolo explica que TOTVS em latim significa tudo, todos, e em latim não se usa o ‘u’.É justamente o contrário: no latim clássico e puro (época de Cícero, século I, A.C.) não se usava o ‘V’ e, sim, o ‘U’. O mesmo acontecia com o ‘J’ substituído pelo ‘I’. A partir do século XVI, por força do latim eclesial, as duas consoantes integraram-se ao alfabeto romano (até então com 21 letras). As pronúncias equivaliam-se, portanto trata-se de meras variações gráficas. Em nenhum dicionário de latim ou repertório de expressões latinas encontra-se o ‘v’ substituindo o ‘u’. Excepcionalmente pode usar-se o ‘V’ quando a palavra está em maiúsculas (‘FORVM’, em minúsculas, ‘Forum’) No substantivo próprio que a empresa escolheu para si, na grafia estilizada, de certo modo está bem (dando um desconto bem grande pro problema de semiótica gerado, sobre o fato que \"U\" e \"V\" eram uníssonos, não existiam as duas coisas como é agora. Hoje ambos existem e significam coisas diferentes. Pra época, seria mais ou menos como chegar hoje e fazer um site usando uma tipografia descolada do nosso abecedário que imitam os katakanas japoneses, mas a pronúncia das letras descoladas continuam sendo \"a\", \"b\", \"c\"… como se usássemos esta fonte aqui: https://www.dafont.com/japa...Ok, escusemos tudo isso).O problema é que nem nas regras da época que remetem eles jogaram… Como o nome da empresa é TOTVS, decidiram que na capa do jornal todas as palavras com a letra ‘u’ seriam grafadas com um ‘v’ em seu lugar. O presidente Lula saiu como Lvla, ‘disputa’ resultou em dispvta etc. etc. E em qualquer momento que TOTVS for para a escrita minúscula nas letras subsequentes ao caractere inicial, pela regra do idioma deve-se ir para Totus. Pois é, o negócio aqui lembra um case-sensitive. Se não for assim, a \"linguagem\" não contempla. Vai dar erro. =PDeveriam ter consultado um filólogo pra não derrapar dessa forma. ¯\\_(ツ)_/¯Se consultaram e eu estou enganado com a minha referência, eu gostaria do contraponto dialético.Obrigado. =)---Já por parte do Hipsters ponto Tech, excelente episódio. Os programas seguem com pautas bem interessantes."},{"author":"Daniel Fernandes","comment":"Ouvi esse podcast hoje enquanto corria e fiquei muito feliz! hehe... Posso afirmar (como ex membro da comunidade TOTVS - dev customizador de uma franquia no Sul de Minas) que a empresa está acompanhando o mercado e evoluindo muito.Fico \"de cara\" com as pivotadas que empresas do tamanho da TOTVS são capazes de dar. Magazine Luiza, o MercadoLivre, a TOTVS, etc, são empresas gigantescas que conseguem pivotar rápido e inovar... Mas que tempos maravilhosos para se estar vivo, hein!"},{"author":"Batata Batata Batata","comment":"Em tempo: Se querem um latim impecável, um bom começo pra TOTVS seria aprender com os romanos de \"A Vida de Brian\"\n\n\nReproduzir\n\n\n Ocultar\n\n\n\n\nhauhuahauhauhauhauahuahauhuahauhauhauhauahua"},{"author":"Saulo Morais","comment":"Nostálgico. rsrs Sou desenvolvedor há mais de 20 anos e passei por quase tudo dito no episódio. Também estou no processo de levar um ERP para nuvem."},{"author":"Adriano Henrique de Almeida","comment":"Já pensou se um dia tiver um episódio de Dataflex, Clipper, Visual Basic e afins? Vai ser louco."},{"author":"Fabio Henrique","comment":"Achei que faltou comentar sobre um dos \"grande cases de sucesso da TOTVS\" .O HIS, o ERP hospitalar que foi desenvolvido em implantado em um grande hospital de São Paulo.Sem mais."},{"author":"Fernando Boaglio","comment":"Dica para os novos hipsters do mercado: não critiquem tecnologia antiga A ou B, mas ao contrário, aprendam pelo menos o básico dela... o mercado evolui e quando as empresas precisarem migrar para novas tecnologias, não será o cara que só reclama que receberá a proposta =D"},{"author":"Paulo Silveira","comment":"eu achei mesmo muito interessante todas as tecnologias antigas agora expostas como API. adoro gravar episodios assim."},{"author":"Daniel Fernandes","comment":"Cara, como uma pessoa que já trabalhou em customizações de sistemas TOTVS (Protheus especificamente), posso garantir que eu era um dos reclamões, mas hoje, eu admiro demais a TOTVS cara. Eles evoluem a passos largos e crescem inovando e se aproximando cada dia mais da realidade do mundo, conciliando o que há de melhor na tecnologia com o que realmente funciona (e muitas vezes é legado).A sacada das APIs foi genial... CTO da TOTVS e equipe de desenvolvimento que está liderando essa pivotada aí está de parabéns! Ganharam um pontinho no meu ranking de empresas FODAS... hehe."},{"author":"DarkElf","comment":"Ta aí um episódio foda... Soluções que vão evoluindo e se adaptando as novas necessidades."},{"author":"Adriano Henrique de Almeida","comment":"Essa foi a parte mais legal mesmo, DarkElf. E além disso, ele foi se adaptando não só às novas necessidades, mas também as novas tecnologias que foram surgindo. Imagino o tamanho do problema que é evoluir, mas ainda ter que manter um pé no passado porque é impossível migrar todos os clientes."},{"author":"Rodrigo Corsi","comment":"Utilizamos o Protheus desde 2005, e hoje basicamente é um sistema legado gigante sem controle de versão, dependências e principalmente testes. As manutenções são feitas a base de patches de correção tudo de forma manual. Realmente como cliente manter um sistema destes funcionando está cada vez mais difícil."},{"author":"Adriano Henrique de Almeida","comment":"Rodrigo Corsi e hoje se você colocar em contraste com a facilidade que é atualizar a versão de um aplicativo Android ou iOS, a comparação soa até surreal. Manter essa retrocompatibilidade é um negócio maluco, mas necessário."},{"author":"Fausto Blanco","comment":"vamos lá, ver mais um ep FODA do hipsters"}]}