{"title":"Angular vs React – Hipsters #142","releaseDate":"02/04/2019","tags":["front-end","Podcast","programação"],"people":["Paulo Silveira","Flávio Almeida","Mário Souto","Roberta Arcoverde","Maurício “Balboa” Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=2227%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D2227&t_u=https%3A%2F%2Fhipsters.tech%2Fangular-vs-react-hipsters-142%2F&t_e=Angular%20vs%20React%20%E2%80%93%20Hipsters%20%23142&t_d=Angular%20vs%20React%20-%20Hipsters%20%23142%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Angular%20vs%20React%20%E2%80%93%20Hipsters%20%23142&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Cesar Devesa","comment":"Angular é Angular! A partir de uma distribuições Linux, agregando com IONIC, faço de tudo não preciso comprar o carí$$imo Mac Apple. Faço de tudo, apps para Android, iOS, web sites, apps para desktop pro Windows, pra Mac e pra Linux --- isso tudo com crossCode, o mesmo código, várias plataformas ---IONIC gera dentro do seu ecossistema os apps para Android e iOS. Pra quem usa o React com React Native pra criar apps de iOS, ou compra um Mac pra gerar apps pra iOS, ou paga um serviço de terceiros (e envia o código fonte pra eles tá !!!) pra gerar apps pra iOS. Mas vc pode virar escravo de sistema operacional e ficar preso no macOS.Eu prefiro usar Angula+Ionic e ser livre e versátil. O mercado está focando (na contratação) a versatilidade de profissional multi plataforma. até pq é meio ridículo esse auto-aprisionamento em qualquer tipo de OS. Até nas mais diversas distros linux, com o advento dos SNAPS (software em containers), ninguém está mais preso em nenhuma distro, seus software funciona igual em qualquer distro."},{"author":"Lucas Riechelmann","comment":"Indo para Dublin final de ano, e arrumar um trabalho com DEV em 2020 :D"},{"author":"Jilles Ragonha","comment":"fala gente... bora falar sobre flutter ou dart :D"},{"author":"Raphael Pena Cavalcanti","comment":"Ótimo podcast, mas gostaria de tirar uma dúvida... Vou trabalhar da reestruturação de um site de notícias, e pra mim já está claro que usar Angular ou React puros não seria a solução, pois SPA não é a melhor solução para esse caso. Mas, então, qual é a melhor solução? Não basta fazer o SSR? Algo como Next.js, que funciona em cima do React, é uma boa alternativa? Obrigado!"},{"author":"Abraao Ribeiro","comment":"Esperando o hipsters sobre Ionic 4 vs React native ."},{"author":"Black Power Dog","comment":"Cruzes, vou continuar no jquery mesmo"},{"author":"Tardelli Aguiar","comment":"Saudades JSF + PrimeFaces! kkkkkkkk"},{"author":"Robson Passos","comment":"Na empresa que trabalho ainda é utilizado."},{"author":"Maurício Linhares","comment":"\n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n"},{"author":"João Eudes Lima","comment":"Aguardando o \"VueJs S2 vs React\" agora kkkkk"},{"author":"DarkElf","comment":"Vue é melhor que esses tudo. hahahhahahhahaMassa, tem bastante informação aí que eu não sabia."},{"author":"Thiago Bomfim","comment":"Falem sobre flutter também =D"},{"author":"Andre Nunes","comment":"Parabéns pelo Hipsters foi fantástico. REACT top d+"},{"author":"Paulo Jorge Nascimento","comment":"Faltou falar do VueJs"},{"author":"Ciro Batista","comment":"Falem sobre flutter vs react native"},{"author":"André Carvalho","comment":"uma dica: coloquem a opção de velocidade 2x no player"},{"author":"Daniel Carlos Souza","comment":"Pois é, eu também sinto falta, mas enquanto eles não fazem...mySnd=document.getElementById('audio-2227-1_html5'); // vi o id no codigo fonte...mySnd.playbackRate=1.5;no console do navegador já me adianta....  se quer 2x troca o 1.5 por 2"},{"author":"Alex Sandro","comment":"Falem do vue.js também, por favor :("},{"author":"Gustavo","comment":"boa!"},{"author":"Eridani Campos","comment":"Muito bom.. vcs me ajudaram a decidir!Vou voltar para os web forms  \n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n"},{"author":"Maurício Linhares","comment":"Ou JSF com PrimeFaces."},{"author":"João P. Vanzuita","comment":"massa demais!! conversa super inteligente, inclusiva, divertida sem ser boba, vocês são demais!"},{"author":"Vinícius Dias","comment":"Pra ativar o ChangeDetectionStrategy.OnPush no Angular eu preciso colocar essa opção em todos os componentes? Não consigo fazer global, ou por módulo?"},{"author":"Flávio Almeida","comment":"Por componente"},{"author":"Felipe Gabriel Caparelli","comment":"Esse papo de um contra o outro é tão importante quanto querer saber qual empresa de quadrinhos é melhor: Marvel ou DC? Se vc está querendo trabalhar com Angular, boa sorte, vai de cabeça... se gosta mais de React, show... só não perde a vida tentando achar sempre a bala de prata, o framework perfeito... cada um tem seus pontos positivos, os dois tem comunidades fortes, muito conteúdo pra te auxiliar, componentes e bibliotecas ricas que vão fazer muito do trabalho sujo. Sempre rola esses conteúdos pra gerar um buzz (Java x .Net, Python x R, etc)... se vc achava que o mundo de desenvolvimento era tudo 0 ou 1, sinto em te informar mas é muito mais que isso... no final, vc tem que escolher, ganha de um lado e perde do outro."},{"author":"Rodolfo Gomes","comment":"A caraaaaaaa, Vai falar isso p tia do cafe caraaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa, me fala ai cara quantos projetos rodando vc tem caraaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa"},{"author":"Neemias Júnior","comment":"Essa pergunta React vs Angular é mais filosófica do que parece. Achei bem feliz o comentário do Flávio dizendo que se você tem experiência com OO e está satisfeito, vá com Angular, e se você tem experiência ou quer aprender conceitos novos de programar em torno de funções, vá com React e aprenda programação funcional"},{"author":"Rodrigo Tognin","comment":"Muito interessante! Apesar de eu estar bem longe de realmente entender os conceitos que foram passados, acredito que ouvindo com mais calma eu possa pegar um pouco mais.Agora deixa eu voltar aqui para o meu Cobol..."},{"author":"Sérgio Paulo Samaan Filho","comment":"Poderiam me ajudar em uma decisão?Na empresa onde trabalho temos uma área responsável pela definição da arquitetura e a construção de componentes corporativos (inclusive o site principal, autenticação etc).As outras areas são responsáveis por usar os componentes e criar seus módulos, vinculando ao site principal.Numa arquitetura SPA, porque utilizar react ou porque utilizar angular?Quais seriam os benefícios na escolha de uma destas duas opções?Desde já agradeço pelo apoio."},{"author":"Mario Souto","comment":"Cara, vai muito da experiência do time igual comentamos ao longo do Podcast. Vai de sentar, ver as habilidades de todo mundo, se quem não manja de OO conseguiria lidar bem ou rolaria um processo de capacitação da galera pra trabalhar com Angular por ex. No caso do React tem o lance de ver o que precisaria ser feito, fazer uma pesquisa interna se o pessoal consegue se acostumar ...Na prática o lance da componentozação que acaba sendo o core dos dois eles vão atender super bem :)"},{"author":"Sérgio Paulo Samaan Filho","comment":"Consegue me ajudar com a criação desta arquitetura de referência? Estou com bastante dificuldade de encontrar desenvolvedores experientes pra essa tarefa. Pode ser freela se for o caso."},{"author":"Fausto Blanco","comment":"gostei bastante de terem visto os 2 lados, mas pra manter a treta, Angular é melhor, Xau!!!"},{"author":"Maurício Linhares","comment":"\n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n"},{"author":"Gabriel DS","comment":"#FogoNoParquinho"},{"author":"Ednilson Campos","comment":"Uma analogia com sql seria mais ou menos assim:Rest = select * from GraphQL = select id, name from"},{"author":"Silvair L. Soares","comment":"Rest = select * from => Rest+OData = select id, name from (where, group by, skip/top, order by, etc)GraphQL = select id, name from"}]}