{"title":"Tecnologias no Nubank – Hipsters #01","releaseDate":"19/07/2016","tags":["Podcast","programação","startup"],"people":["Paulo Silveira","Ed Wible","Lucas Cavalcanti"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=223%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D223&t_u=https%3A%2F%2Fhipsters.tech%2Ftecnologias-no-nubank-hipsters-01%2F&t_e=Tecnologias%20no%20Nubank%20%E2%80%93%20Hipsters%20%2301&t_d=Tecnologias%20no%20Nubank%20-%20Hipsters%20%2301%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Tecnologias%20no%20Nubank%20%E2%80%93%20Hipsters%20%2301&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Rogério Queiroz","comment":"Rachei o bico a partir do minuto 35, Angular + CoffeeScript. hahahahha"},{"author":"Maison","comment":"Excelente podcast, as perguntas feitas foram bem elaboradas. Foi bom conhecer as tecnologias de uma empresa em crescimento. A curva de aprendizado das linguagens funcionais é realmente maior ? Ou é só o impacto da quebra de paradigmas ?"},{"author":"Isac Moura","comment":"Esse episódio piloto ficou muito bom. Inclusive tô voltando aqui pra rever os comentários sobre as tecnologias utilizadas pelo Nubank"},{"author":"Nathan Tomaz","comment":"Gostaria de dizer q o algoritmo de crédito do Nubank é uma verdadeira merda, os cara aprovam gente sem emprego e sem comprovação financeira nenhuma e reprovam qm já trabalha a anos e é negado automaticamente... Imagina o tanto de calote q eles n levam com esse \"bot\" mto espertinho kk"},{"author":"Ricardo Martins","comment":"Falou de reactivex no fim. Será que tem reactivex nos apps também? RxSwift por exemplo."},{"author":"Daniel Araújo","comment":"Achei o podcast bacana não só pelas tecnologias, mas principalmente pela forma de pensar dos participantes. Contratar pessoas com facilidade de aprendizado, em vez de especialistas na tecnologia, estudar qual a melhor ferramenta para se resolver um problema, em vez de se utilizar o que já se domina, entre outras."},{"author":"Felipe Souza","comment":"Parabéns Turma! Muito Foda!"},{"author":"Matheus Andreatta","comment":"Muito bom o/"},{"author":"Vinícius Campitelli","comment":"Comecei a ouvir agora, achei muito bom! Parabéns a todos ;)"},{"author":"Jose Cordeiro (Junior)","comment":"Fala Pessoal, tudo bem?E você, o que acha sobre Microsserviços?Responda minha pesquisa acadêmica e dê sua opinião:https://pt.surveymonkey.com...No final, você pode receber o resultado via e-mail.Obrigado!"},{"author":"Elias Flávio de Paiva","comment":"Gostei muito do programa. Estou ouvindo em maratona. Parabéns, muito interessante.Ainda tem muitos termos que não conheço, sou principiante, mas, estou gostando bastante."},{"author":"Caui Chagas","comment":"Muito bom! Extramamente esclarecedor, é positivo ver novos negócios se consolidando com a cultura de melhorar a experiência do usuário, utilizando tecnologias inovadoras para gerar valor real. Acredito em um futuro onde isso se tornará mais comum e amplamente utilizado. Infelizmente, aqui no Brasil essa é a realidade de poucas empresas. A maioria veem utilizando a tecnologia como forma de resolver os problemas que elas acham que tem, esquecendo de levar o usuário em consideração e ver o que realmente agrega valor a essas pessoas. Outro ponto muito interessante é a cultura desprovida do medo de errar, fornecendo o combustível necessário para que a inovação aconteça, o erro faz parte do processo, mas a forma como você lida com ele é o que difere. Em relação as tecnologias, achei interessante o mix que o Nubank veem utilizando, principalmente a ampla adoção dos microserviços, usando linguagens inovadoras e um ambiente voltado a escalabilidade, será com certeza algo que irei focar meus estudos à partir de agora. Para finalizar, fico feliz de ver exemplos que deram certo, sei que muitas das startups não passam dos primeiros anos de vida, espero que o futuro seja desburocratizado, com facilidade de acesso, que as pessoas tenham oportunidade de consumir serviços de qualidade por um preço justo, em todas às areas. Parabéns!"},{"author":"Rods","comment":"Muito, mas muito bom mesmo!Legal ver como a programação funcional afeta a forma com as pessoas pensam sobre / escolhem tecnologia.Por exemplo, enquanto a maioria que esta no mundo OO tende ao AngularJS e toda sua API gigantesca e complexa. A galera do Funcional, tende a simplicidade, por exemplo React com uma API minúscula e simplista."},{"author":"Bruno Oliveira de Alcântara","comment":"Muito bom! Embora já faça bastante tempo, eu estou chegando no Hipsters agora, conheci essa semana o site e essa entrevista com o Nubank foi ótima para conhecer algumas coisas. Gostei especialmente do bando Datomic."},{"author":"Vandemberg Silva Lima","comment":"As vezes quero voltar alguns minutos no eps e o player some!Existe alguma área para dar report desses bugs?Abraço, galera da Alura"},{"author":"Márcio Sancho","comment":"Show de bola! Cast muito bom. Parabéns Caelum/Alura/CasadoCódigo/etc... :D"},{"author":"Murilo","comment":"Muito bom presenciar o surgimento deste podcast! Comecei ouvindo o nerdcast lá no portal do Jovem Nerd e vim parar aqui. São trabalhos excelentes, lá com toques de humor e aqui com as discussões mais aprofundadas, com qualidade no conteúdo e em sua forma. Parabéns hipsters! Só uma sugestão, às vezes não consigo baixar o podcast devido às restrições de proxy e firewall, teria como disponibilizar em outros locais, ou de forma nativa como é o nerdcast. Obrigado!"},{"author":"Cristopher Jonas","comment":"Já ouvi muitos podcasts mas nunca vi um cast tão bem feito, digo pela qualidade do audio, arranjo, volume etc. E também pela qualidade de conteúdo, os entrevistadores sabem MUITO do tema, conhecem bem os entrevistados, o q garante essa qualidade impecável... Parabéns a todos."},{"author":"Jonas Schumacher","comment":"Ouvir do CTO e cofundador da empresa que \"os nossos engenheiros não gostam muito de prazos\" como se fosse algo comum e de menos importância é fantástico... heheO podcast está d+, parabéns!"},{"author":"tiagocesar","comment":"É o tipo de coisa que todo engenheiro sempre quis dizer e jamais pôde."},{"author":"Diego Rosa dos Santos","comment":"karalho, muito bom, parabéns!"},{"author":"Super Suporte","comment":"3:15 \"até gringo fala C-T-O, ao inves de SI-TI-OU...\" 3:25 \"temos muito para conversar com SI-TI-OU...\"kkkkkk"},{"author":"Luiz Gustavo Ribeiro","comment":"Caraca muito bom, ótimo podcast. Assuntos bem interessantes para os curiosos da área. Parabéns galera"},{"author":"Michelly Sabatiny","comment":"Amei ...Maravilhoso ,queremos mais o/"},{"author":"Silas Vasconcelos","comment":"Parabéns, muito bom mesmo, adicionado a lista de podcasts!"},{"author":"Marcelo Henrique Burlin","comment":"Escutei do ultimo para o primeiro, e gostaria de dizer que está muito bom! Mas lembrar o Paulo que #WeAreThe2%"},{"author":"Paulo Silveira","comment":"Já to com medo desses 2%!!! :P"},{"author":"Carlos Carvalho","comment":"demorei pra ouvir o primeiro, mas mesmo assim achei Sensacional! ouvirei os próximos, tipo, agora!"},{"author":"Thiago Dos Santos","comment":"Ouvindo aqui direto do Xbox."},{"author":"Paulo Silveira","comment":"olha só! esse sim é hipster"},{"author":"Thiago Dos Santos","comment":"Sempre às ordens rs"},{"author":"Fred Oliveira","comment":"Muito bom, já tenho um novo podcast para acompanhar."},{"author":"Victor Menegusso","comment":"Muito bom, é bem interessante saber com oque outras empresas trabalham, apresentando as vantagens e desvantagens das tecnologias. Muitos saem de faculdades/cursos com as ferramentas padrões e ficam fechados só nelas, com o podcast, ajuda o pessoal abrir mais a mente para outras tecnologias."},{"author":"patrick menezes","comment":"Ótimo"},{"author":"didaevag","comment":"Muito Bom!"},{"author":"Erick Carvalho Campos","comment":"Começaram muito bem!!"},{"author":"JP","comment":"N PAREM"},{"author":"Márcio Rosa","comment":"Começaram muito bem! Parabéns!"},{"author":"Abel Aguiar","comment":"Show de bola, excelente podcast, adicionar aos favoritos.. "},{"author":"Sebastião Relson Reis da Luz","comment":"Quando morava \"a trabalho\" em SP fui nos meetups de datascience, muito bacana"},{"author":"Felipe Tavares","comment":"Excelente episódio, parabéns galera.Sugestão de tema: carreiras front e back-end."},{"author":"Rodolfo de Paula","comment":"Excelente ! Todos temos só a ganhar aprendendo Clojure. Eu só aproveito pra ressaltar aos tiozões Java (como  eu) que imutabilidade _pode_ existir em uma linguagem OO, como Java. Só que somos forçados a usar remendos como Lombok, Autovalue ou Immutables. Ou migrar pra outra linguagem, como Clojure ou mesmo Scala ou Kotlin, se tipagem estática é importante pro seu caso de uso e gosto pessoal. Pessoalmente, acho lamentável que o Java 9 tenha módulos nativos da linguagem mas não algo como case classes do Scala. Hoje é possível dar uma pitada funcional ao Java usando javaslang ou cyclops-react, inclusive com pattern matching e collections imutáveis e persistentes, como Clojure implementa. Com o diferencial que você aprende um pouco sobre Monads na prática, por exemplo implementando um http://www.javaslang.io/jav... . E quanto ao Datomic, o escopo dele é maior mas só pra ficar no contexto desta entrevista , onde foi dada ênsafe a imutabilidade do banco de dados, aos eventos...humm.. isto pode ser alcançado com Java usando-se Event Sourcing / CQRS. Quer ser Hipster mesmo ? Então implemente seu próprio journal de eventos para append only e um eventstore readonly, de preferência em cima de um storage que você e sua empresa conheça bem: um RDBMS. Dica: Postgresql e Mysql recentes suportam JSON nativamente...E finalmente: como o Lucas disse, o importante é o negócio. Então foque na sua Ubiquitous Language, seus comandos e eventos  e implemente usando ES / CQRS que seu código será naturalmente (e conceitualmente) funcional. Ahh, e apenas depois disso desista de vez do Java :)"},{"author":"Paulo Silveira","comment":"Excelente adição e aprofundamento do conteúdo Rodolfo de Paula ! Eu nao diria que criar seu proprio journal é hipster, e sim suicídio hahaha :)."},{"author":"Rodolfo de Paula","comment":"Só passando pra divulgar o https://crabzilla.github.io... que explora um pouco do que comentei aqui há um ano atrás. O \"journal\" (log, eventstore, etc) usa MYSQL como storage mas poderia ser qualquer banco de dados com interface JDBC. Commandos e eventos são classes imutáveis. Usando Java 8. E a implementação usando Vert.x. E ainda estou vivo! :)"},{"author":"Leonardo Lobo","comment":"Parabéns!!! Muito bom."},{"author":"Vagner Araújo","comment":"top"},{"author":"Francisco Prestes","comment":"Muito legal! Alura sempre com novidades."},{"author":"Marcos","comment":"Só tenho que dar meus parabéns haha"},{"author":"DuShin","comment":"Gente o podcast foi bem legal, muitas informações interessantes, só que eu achei ele muito overproduced. Seria legal um papo mais informal, sem muitas edições, pra deixar a conversa mais fluida. Só uma opinião. Forte abraço."},{"author":"Lucas Maia","comment":"Gostei das perguntas! Diretas conseguindo deixar o pod bem rápido! Parabéns!"},{"author":"Erick Figueredo","comment":"Sensacional!!! Parabéns!"},{"author":"Frederico A. Camargo","comment":"Sugestão: Algum podcast sobre cultura organizacional em alguma startup fodona ;)"},{"author":"Paulo Silveira","comment":"boa! a gente ta querendo fazer um de squads do spotify"},{"author":"Frederico A. Camargo","comment":"Ótimo assunto, algo que na teoria não é simples de entender!"},{"author":"Frederico A. Camargo","comment":"Parabéns, ótimo podcast e sem papas na língua!"},{"author":"Neuber Oliveira","comment":"seria legal fazer um desse com as tecnologias do whatsapp"},{"author":"Luiz Faias","comment":"Eu já ouvia esse podcast antes de virar modinha! HahahaParabéns Paulo e equipe da Alura 😉"},{"author":"Paulo Silveira","comment":"Bom ver voce aqui Luiz :)"},{"author":"Ricardo Cavalcante","comment":"Será que so eu ri quando li \"Cobol\" ? E ri mais ainda quando vi o \"(ha!)\""},{"author":"Thom","comment":"Ótimo! Só falta disponibilizar em Zip :)"},{"author":"Paulo Silveira","comment":"está nos planos :)"},{"author":"Valdir Viana","comment":"Ficou muito bom, parabens."},{"author":"João Cardoso","comment":"Podcast sinistramente BOM!!!! Parabéns."},{"author":"Super Suporte","comment":"Gratidão! Alura de coração <3"},{"author":"vedovelli","comment":"Excelente podcast! Parabens!!"},{"author":"Abraão Borges Neves","comment":"Vedovelli, acompanho seus videos no youtube e já estou sentindo falta em =D !!"},{"author":"vedovelli","comment":"Eu tb Abraão, eu tb.... =D Forte abraço!"},{"author":"Paulo Silveira","comment":"o louco! a podosfera e a youtbosfera é pequena mesmo!"},{"author":"Abraão Borges Neves","comment":"Com toda a certeza! Falando nisso, Paulo ótimo trabalho, como sempre o pessoal ai mandando ver respeito ++ pra vocês =P"},{"author":"João Veríssimo","comment":"Showwwww de bola!!!! Parabéns!!!"},{"author":"ande","comment":"Existe algum link alternativo para download? A china brasileira bloqueou aqui. ¯\\_(ツ)_/¯"},{"author":"ande","comment":"Já saí da China Brasileira™ e estou em casa são e salvo. Listening. ;-)"},{"author":"Gabs Ferreira","comment":"Aeeeeeeeeee!"},{"author":"Paulo Silveira","comment":"não rola através de uma proxy?"},{"author":"Gabs Ferreira","comment":"Infelizmente não :("},{"author":"Ricardo Portela da Silva","comment":"Nossa falaram de COBOL, eu amo COBOL! Muito dez! Vou aprender essa tal de Clojure!"},{"author":"Paulo Silveira","comment":"sabia que ia ter coboleiro ouvindo :)"},{"author":"Ricardo Portela da Silva","comment":"o bom e velho COBOL, ainda resiste ao tempo. Porém com cara nova!. Produtos da Microfocus como o Visual COBOL, trabalhando com Visual Studio e utilizando o .NET. E tambem podemos compilar o código COBOL como uma .class e executá-lo na JVM. Isso ajuda bastante em processos de modernizacão!"},{"author":"Fábio Rogério SJ","comment":"Começaram muito bem em! show"},{"author":"Lucian Dalla Nora","comment":"Excelente podcast! Seguindo desde já."},{"author":"Jonas Martins","comment":"Eu já assinei."},{"author":"Marquinhus Goncalves","comment":"Aeeeee até que enfim, parabéns pelo novo projeto, realmente estava faltando para o grupo Caelum um podcast, toda terça estarei aguardando... Sucesso"},{"author":"Henrique Güttler Morbin","comment":"Muito bom!!"},{"author":"Eduardo Medeiros Pereira","comment":"faltou o link do Kafka ai galëre http://kafka.apache.org/"},{"author":"Eduardo Medeiros Pereira","comment":"Apenas comecei a escutar e já tenho que elogiar. Parabéns pela iniciativa!"},{"author":"Moisés Meirelles","comment":"Muito bom!!! Parabéns, vou acompanhar com certeza!"},{"author":"William R. Fernandes","comment":"Muito bom! Parabéns!"},{"author":"Diego Brocanelli","comment":"Excelente podcast, começando com qualidade profissional já no primeiro episódio!!!A escolha do primeiro tema foi fantástico, com certeza cabe outros episódios para abordar mais sobre o assunto, parabéns pela escolha dos convidados.Parabéns pelo projeto!"},{"author":"Luis H. Moreno","comment":"Excelente podcast! Parabéns."},{"author":"Marcelo Melo","comment":"Cara que da hora! Tô bem feliz que será semanalmente! Por onde será possível enviar sugestões de temas?"},{"author":"Paulo Silveira","comment":"será semanal sim Marcelo! Pode mandar ideias aqui mesmo :)"},{"author":"Fabiano França","comment":"Muito bom o episódio. E esse formato de trazer gente que tem usado a tecnologia para falar dela foi acertado.No aguardo do próximo episódio."},{"author":"julio shinoda","comment":"Parabéns pelo podcast!"},{"author":"Lincoln Luiz","comment":"Show de bola! muito bom, parabéns Hipsters"},{"author":"Claudenir Freitas","comment":"Parabéns pelo podcast, muito manero mesmo! Bacana ver a visão do Nubank, muito massa"},{"author":"Ronaldo Cesar Paggi","comment":"Poxa qual o problema com o Cobol, trabalho com Cobol e gosto, claro que é uma tecnologia antiga, mas  é muito usada nos sistemas financeiros e bancários :("},{"author":"Gabs Ferreira","comment":"Fala Ronaldo, beleza?Não temos problema nenhum com Cobol! Inclusive teremos um podcast específico sobre tecnologias um pouco mais antigas, como o Cobol nos bancos :)"},{"author":"Ronaldo Cesar Paggi","comment":"Opa! Vou aguardar este ai então, que é a minha \"praia\" Abraços!"},{"author":"Glauber Nóbrega","comment":"Parabéns pessoal pelo podcast... Show de bola!"},{"author":"Gilberto Silveira","comment":"Show esse primeiro podcast! Ficarei aguardando pelos próximos"},{"author":"Lucas Cardoso","comment":"Senhores, meus parabéns! Esse era o podcast que faltava pra quem é da área. Continuem o bom trabalho! Abraço!"},{"author":"Ronaldo Reis","comment":"Boa galera, parabéns!!!"},{"author":"Fabiano Góes","comment":"Pessoal, muito show de bola o podcast, fiquei com um duvida: quando o Lucas diz sobre uma tecnologia(Front-end Web) que talvez eles não deveriam ter escolhido ele está dizendo \"AngularJS\" ? :O"},{"author":"Lucas Cavalcanti","comment":"É isso mesmo Fabiano. Mas não necessariamente por ser o AngularJS. É que alguns meses depois saiu o React e os wrappers em ClojureScript que eram bem melhores para o que a gente estava fazendo. Daí hj pouca gente quer mexer no código em Angular e ele ficou meio pra trás."},{"author":"Fabiano Góes","comment":"Entendi, cara em um projeto pensando no front-end desplugado do Backend(Java Spring Rest) integrado via API Rest, utilizando no frontend Material Designer com AngularJS você vê algum problema ou pontos negativos?"},{"author":"Lucas Cavalcanti","comment":"Desde que vc organize bem o código e consiga escrever testes unitários pros seus arquivos javascript, sem problemas."},{"author":"Fabiano Góes","comment":"kkkk este é exatamente o problema que estamos tentando resolver hoje com AngularJS e Javascript no geral, obrigado pela atenção e parabéns pelo projeto!!!"},{"author":"Phil Calçado","comment":"Excelente conteúdo. É inspirador ver empresas como o Nubank no Brasil, saindo da mesmice tecnológica e investindo pesado em inovação. E inovação num ramo complicado e necessitado, nada de criar mais uma rede social pra gatos."},{"author":"Leonardo","comment":"Ótimo conteúdo."},{"author":"Rafael dos Anjos","comment":"Parabéns excelente cast, já venho acompanhando os podcasts da alura com joven nerd são igualmente bons mas este aqui ficou sensacional. Para próximo ou dentro dos próximos gostaria de ouvir sobre o Elixir com Jose Valim, ele já participou de outros podcasts que acompanho, seria bacana alem de falar da linguagem, perguntar os pros e contras e diferenças comparando com Closure, e se existem projetos opensource para novatos praticarem!"},{"author":"Paulo Silveira","comment":"Rafael, o Jose Valim está na nossa mira!!!"},{"author":"Chrystiano De Castro","comment":"Excelente!"},{"author":"Ricardo Hofstetter","comment":"Fantástico! Ótima ideia aprofundar a parte técnica. Vou acompanhar os próximos."},{"author":"Adler Coelho Santos","comment":"Muito bom, nunca tinha escutado o nome das tecnologias, o legal que no final tem os links ainda. Parabéns!"},{"author":"Priscila Carvalho","comment":"Toooop! Nubank rocks...."},{"author":"André Luis Gomes","comment":"bem legal"},{"author":"extqy","comment":"Parabéns pelo Podcast, ficou muito bom !"},{"author":"Palmer ","comment":"Ótima entrevista, esses caras da Nu Bank são demais...primeiramente o serviço prestado ao usuário, e a inovação por traz de tudo."},{"author":"Osmar Cavalcante","comment":"Muito bom o podcast! Queria saber qual a lib Scala que eles mencionam como parser de binário..."},{"author":"Paulo Silveira","comment":"Tá na mão Osmar! https://github.com/scodec/s..."},{"author":"Osmar Cavalcante","comment":"Valeu demais! ;)"},{"author":"Alan Oliveira","comment":"Sensacional o podcast, tudo bem que não entendi muitos termos que vocês utilizaram kkkk"},{"author":"Guilherme Pontes","comment":"Botão de share, cadê? :D Necessito compartilhar!"},{"author":"Paulo Silveira","comment":"Casa de ferreiro, espeto de pau! Estamos ainda ajustando o layout do site!"},{"author":"Bruno Roberto Gonçalves","comment":"Curti bastante o podcast, estou estudando Clojure e entender as motivações para a escolhas das tecnologias é algo importante pra mim. Achei muito legal também o \"Datomic\", uma alternativa para desenvolver sistemas transacionais que com certeza resolveria grande parte de problemas que já passei."},{"author":"Fabiano Silva","comment":"sensacional! muito bom sr's!"},{"author":"Dan Jesus","comment":"Muito bom!"},{"author":"cpappen","comment":"Muito bom!O jeito é avisar a rapaziada que tem um novo podcast no ar!"},{"author":"Paulo Silveira","comment":"Contamos com isso!"},{"author":"Wendell Albino","comment":"Muito bom.Sugiro que seja mostrado o tempo que começa cada parte do podcast. Obrigado."},{"author":"Rafael Pereira","comment":"NewBank.. que burro sempre achei que fosse nubank...bela sacada do nome hahahaha"},{"author":"Paulo Silveira","comment":"Pior que acho que o burro sou eu! Eu sempre falei New e não tenho certeza se é assim mesmo."},{"author":"Lúcio Ferreira da Silva","comment":"Muito bacana, parabéns!Ótima iniciativa."},{"author":"Maruan Soares","comment":"Muito bom =)"},{"author":"Daniel Nazario de Oliveira","comment":"Caraca... já curto os nerdcasts da alura.. e já sei que vou gostar desse também... Ouvindo em 3...2...1..."},{"author":"Lucas Trevisan","comment":"Muito bom cara! :D"},{"author":"Renan Lima","comment":"Nem ouvi ainda, mas já garantiram minha avaliação positiva no itunes pela bela iniciativa!"},{"author":"Mauricio R. Duarte","comment":"Parabéns, vou escutar ! Show de bola."},{"author":"Paulo Silveira","comment":"Depois deixe a opinião, Mauricio"},{"author":"bassirenata","comment":"como não amar? Caelum/Alura <3"},{"author":"Diego Ferreira da Silva","comment":"Excelente !!"},{"author":"Cássio Almeida","comment":"O que dizer de algo que nem ouvi e já considero pacas? hahaha"},{"author":"Paulo Silveira","comment":"Depois de ouvir pode descer a lenha Cassio :)"},{"author":"Cássio Almeida","comment":"Cê loco. Ficou bom pra c**. Parabéns!"},{"author":"Fernando Guedes","comment":"Muito bom, irado!"},{"author":"Lucas Alencar","comment":"Parabéns!!! =]"},{"author":"Daniel Nazario de Oliveira","comment":"hahaha ri muito.. ia compartilhar no whats se não estivesse bloqueado..."}]}