{"title":"Canais de Tecnologia no Youtube – Hipsters #143","releaseDate":"09/04/2019","tags":["Podcast","programação"],"people":["Paulo Silveira","Filipe Deschamps","Gabriel Fróes","Vanessa Weber Fróes","Roberta Arcoverde","Maurício “Balboa” Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=2234%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D2234&t_u=https%3A%2F%2Fhipsters.tech%2Fcanais-de-tecnologia-no-youtube-hipsters-143%2F&t_e=Canais%20de%20Tecnologia%20no%20Youtube%20%E2%80%93%20Hipsters%20%23143&t_d=Canais%20de%20Tecnologia%20no%20Youtube%20-%20Hipsters%20%23143%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Canais%20de%20Tecnologia%20no%20Youtube%20%E2%80%93%20Hipsters%20%23143&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Vinicius","comment":"Pow que triste vcs não mencionaram o Curso em Video do nosso grande Gustavo Guanabara um dos cara que provavelmente mais fomentou aprendizagem nas áreas de TI, Menção honrosa ai galera... rsrs"},{"author":"Genivaldo","comment":"Recomendo também o canal \"O Programador\" apresentado pelo Sr. Rildo. Fico sabendo de algumas modinhas lá também. Parabéns pelo Podcast."},{"author":"Welton Vaz de Souza","comment":"Mais um excelente episódio do Hipsters. Fantástica conversa com o CDF TV, casal nota 1000, e o inigualável Filipe Dechamps. Agora achei tímida a participação do Mauricio \"Treta\" Linhares."},{"author":"Paulo Silveira","comment":"Linhares ta com inveja que estamos no Youtube e ele nao"},{"author":"Welton Vaz de Souza","comment":"HUAHHHHHAAA"},{"author":"Bruno Tomé","comment":"Canal do Fábio Akita, monstro!!!"},{"author":"Genivaldo","comment":"Valeu pela dica, também não conhecia."},{"author":"edzera","comment":"Obrigado por comentar sobre esse canal, não conhecia :D"},{"author":"Paulo Silveira","comment":"affff, comida de bola TOTAL nao te-lo citado. estava na colinha da pauta"},{"author":"Aldo Henrique Dias Mendes","comment":"Aplicativo de assuntos de tecnologia e programação (algoritmos, Java, HTML, CSS, JavaScript)Material disponível em curso EAD, Podcast, Slides e vídeos.https://play.google.com/sto...É bem legal."},{"author":"Aldo Henrique Dias Mendes","comment":"Para quem está começando na área de TI, Sistemas de informação ou outros.Se inscreva nesse canal, tem muitas aulas básicas de programação.https://www.youtube.com/por...Curso de Algoritmos (com portugol), Orientação a objetos (com java), cursos rápidos de HTML, CSS e Java.Além de cursos para criar seu primeiro jogo simples (com apenas HTML, CSS e Java) e dicas da área de Tecnologia.O foco é justamente ajudar quem está começando.Valeu."},{"author":"Rodrigo Jacinto","comment":"O Paulo falou que o maior canal de programação no youtube é código fonte tv, só que esqueceu de citar o canal do Guanabara do curso em vídeo, que é o primeiro canal de aulas de programação no youtube Brasileiro, que está perto de chegar a marcar de 1 milhão de escritos."},{"author":"Paulo Silveira","comment":"realmente. alguem mais citou o guanabara ai embaixo e falei. e nao ta escrito a quantidade de vezes que tentei trazer o Guanabara para a empresa aqui eheheh. é sem duvida pioneiro nao so no youtube como em podcast"},{"author":"Welton Vaz de Souza","comment":"O problema do canal Curso em Vídeo, virou seita religiosa! Se vc faz qualquer comentário criticando algum aspecto, vem uma enxurrada de chorume e ameaça dos fanboys, que NÃO condiz com fala do Professor Gustavo Guanabara!"},{"author":"Cleiton Dantas","comment":"Esse podcast foi muito FULLL DOPAMINA kkkTenho acompanhado cadas vez mais os podcasts de tecnologia e os programadores youtubers e é muito bacana como esses conteúdos se acrescentam um ao outro.E é realmente inspirador pra comunidade ter essas pessoas que trazem uma energia a mais, falando de conteúdo que você gostaria de escutar falar mais que as vezes a pessoa do seu lado não se liga muito no assunto. Sucesso pra toda galera,"},{"author":"Claudson Oliveira","comment":"Sempre inspirador ouvir/ver as histórias dos youtubers (vamo resignificar essa palavra vestindo a camisa? haha) com mais expriência. Mesmo com todos os problemas que a plataforma causa, acho que hoje é a forma mais eficaz para compartilhar conteúdo e experiências, entrei nessa brincadeira há alguns meses e to tentando não surtar antes do primeiro 1k risos.http://youtube.com/queroser..."},{"author":"Rodrigo Tognin","comment":"MUITO interessante! É sempre bom conhecer canais sobre isso.Recomendo o canal do Benikely Lacerda, muito interessante também, e o canal Curso em Vídeo, do Guanabara, que também é ótimo.Valeu!"},{"author":"Paulo Silveira","comment":"Guanabara comecou Youtube e Podcast quando tudo isso aqui era mato :)."},{"author":"Não há nada a TEMER","comment":"Pessoal, O link para as redes sociais da Roberta está apontando para o Twitter da Vanessa."},{"author":"Gabs Ferreira","comment":"Ops! Corrigido ;)"}]}