{"title":"Tendências em Tecnologia pra 2020 – Hipsters #144","releaseDate":"16/04/2019","tags":["Podcast","programação"],"people":["Paulo Silveira","Roberta Arcoverde","Maurício “Balboa” Linhares","Guilherme Silveira","Sérgio Lopes"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=2254%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D2254&t_u=https%3A%2F%2Fhipsters.tech%2Ftendencias-em-tecnologia-pra-2020-hipsters-144%2F&t_e=Tend%C3%AAncias%20em%20Tecnologia%20pra%202020%20%E2%80%93%20Hipsters%20%23144&t_d=Tend%C3%AAncias%20em%20Tecnologia%20pra%202020%20-%20Hipsters%20%23144%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Tend%C3%AAncias%20em%20Tecnologia%20pra%202020%20%E2%80%93%20Hipsters%20%23144&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Renato Dinhani","comment":"Eu sou da turma que usa e prefere NetBeans para trabalhar faz uns 5 anos.Troquei fácil o Eclipse por ele, já tentei o IntelliJ várias vezes, mas não dá."},{"author":"Junior Osho","comment":"Rust e fantastica !!"},{"author":"Cézar Antonio de Souza","comment":"Excelente cast. Vim aqui só para defender o Notepad++. Adoro o Vs Code,mas até ele abrir eu já fiz todo o serviço no Notepad++.E acreditem, dependendo do aperto no rolê até o notepad do Windows entra na brincadeira..kkkkPs: Galera acha que por que se tem piada... a informação perde a validade...vai entender"},{"author":"Cesar Devesa","comment":"Angular é Angular! A partir de uma distribuições Linux, agregando com IONIC, faço de tudo não preciso comprar o carí$$imo Mac Apple. Faço de tudo, apps para Android, iOS, web sites, apps para desktop pro Windows, pra Mac e pra Linux --- isso tudo com crossCode, o mesmo código, várias plataformas ---IONIC gera dentro do seu ecossistema os apps para Android e iOS. Pra quem usa o React com React Native pra criar apps de iOS, ou compra um Mac pra gerar apps pra iOS, ou paga um serviço de terceiros (e envia o código fonte pra eles tá !!!) pra gerar apps pra iOS. Mas vc pode virar escravo de sistema operacional e ficar preso no macOS.Eu prefiro usar Angula+Ionic e ser livre e versátil. O mercado está focando (na contratação) a versatilidade de profissional multi plataforma. até pq é meio ridículo esse auto-aprisionamento em qualquer tipo de OS. Até nas mais diversas distros linux, com o advento dos SNAPS (software em containers), ninguém está mais preso em nenhuma distro, seus software funciona igual em qualquer distro."},{"author":"Adriano Hardtke","comment":"Caras, não sei como alguém pode não ter gostado desse episódio... Eu já ouvi todos, alguns até mais de uma vez, e esse sem dúvidas é o melhor, eu não costumo vir aqui comentar, geralmente eu baixo e escuto durante o trajeto da faculdade, mas sinceramente, tive de voltar aqui para dizer o quanto foi descontraído e divertido. Parabéns pessoal pelo trabalho, por mais episódios para quebrar o clima tecnicista de sempre, valeu! ;)"},{"author":"Diego Saouda","comment":"Já que digital ocean não foi citado na pesquisa, será que não vale um episódio do podcast sobre? Eu curto a empresa, gostaria de saber mais. O que acham?"},{"author":"Olavo de Carvalho","comment":"ow mano eu uso notepad++ kkkkkkkkkkkAcho que ele é o mais simples. Sempre em curso de BI aparece esse figura kkkk"},{"author":"Olavo de Carvalho","comment":"pessoal passem o link da cafeteria quero ouvir tbm  =D"},{"author":"Paulo Silveira","comment":"ta na mao https://coffitivity.com/"},{"author":"Olavo de Carvalho","comment":"Não sou Dev mais adoro o trabalho de vocês mano."},{"author":"Paullo Estevam","comment":"A música citada em 47:00 é For the love of a princess do filme Braveheart (Coração Valente)."},{"author":"Joow Ramos","comment":"Muita piada, muita risada forçada. Chatão. Até tento ouvir, mas passo mais tempo avançando esses momentos chatos que de fato ouvindo e absorvendo conteúdo. Flw, podem me xingar."},{"author":"Paulo Silveira","comment":"xingamos nao :). foi uma tentativa de fazer um episodio diferente. parece que quem tava acostumado com o padrao mais serio nao curtiu muito mesmo. point taken"},{"author":"marcelokohl","comment":"Uma hora cheguei a pensar que as risadas eram efeitos de edição."},{"author":"jallisson jallis oliveira band","comment":"Uso Netbeans com Java Swing em 2019 kkkkk, mais estou migrando para Python com Django. O banco é mysql"},{"author":"Bruno Guimarães Carneiro","comment":"Uso notepad++ para fazer replace quando tenho um código muito repetitivo.Também não gosto de música, mas as vezes isso música instrumental para abafar o som ambiente. E eu já usei fone sem música para fingir que não ouvia as pessoas chamarem. Só atendia se a pessoa chamar três vezes."},{"author":"Rafael Felipe","comment":"Quem nunca usou fone desligado?"},{"author":"Mateus Rodrigues","comment":"O \"chato\" do rolê: acho que essas piadas com tecnologias já deu gente. Afirmar que x ou y é melhor só da boca pra fora, baseada só em percepção pessoal num faz bem a ninguém. A audiência de vocês é grande e querendo ou não exerce uma certa influência nas pessoas. De repente numa roda de conversa vai ter gente que NUNCA trabalhou com VBA e vai falar que é ruim. Isso não ajuda ninguém. E ainda pode ser desrespeitoso para quem trabalha com a tecnologia.E também o vocabulário galera. O que tem gente usando \"caras\" como referência pra pessoa ou grupo de pessoas é grande: \"o cara vai\", \"os caras da pesquisa\". E quando a referência é pejorativa vai um sujeito feminino: \"as viúvas do vue\". Pessoas desenvolvedoras não são só homens gente. E isso com 19:10 de podcast.Acho que seria interessante se o vocabulário do podcast fosse um pouco mais neutro. Eu sei que é difícil pra porra mudar esses comportamentos, mas acho que a longo prazo vale a pena pra deixar o ambiente mais convidativo pra outras pessoas."},{"author":"Paulo Silveira","comment":"de maneira alguma chato, Mateus. bons pontos:- sobre o genero: nos esforçamos bastante e voce pode ver que a maioria das citacoes nos episodios sao de programadores e programadoras, engenheiros e engenheiras, pessoas que programam, etc. mas ainda estamos longe de eliminar todos os vicios da minha geracao. estamos melhorando- sobre falar se x ou y é melhor, achamos que tinha ficado claro que era uma grande brincadeira. alias, acabamos brincando com todas as tecnologias e nao declarando alguma como vencedora ou melhor. mas entendo o perigo. ao mesmo tempo,  se tirarem uma unica frase nossa do podcast vai ter todo tipo de mensagem: \"usem sempre vba\" e \"nunca usem vba\". basta pegar o episodio de data science onde falamos do comeco em excel e vba e sua importancia. entendo que devamos tomar cuidado com essas frases, mas é importante conhecer a mensagem dos podcasts como um todo."},{"author":"Mateus Rodrigues","comment":"Esse comentário foi apagado."},{"author":"Mateus Rodrigues","comment":"Que bom que tu sabe o que o politicamente correto prega. Espero que tu já tenha parado pra entender um pouco o porque dele então para só depois ter concluído que é uma merda. Ninguém tá ganhando dinheiro \"pregando\" isso ou fazendo para passar tempo.\"Cada um fala como quiser\" é uma afirmação bem forte. Eu não conheço tua pessoa e não posso falar o que quiser sobre você por exemplo. E acho que o mesmo se extende pra certas expressões ou construções que usamos no dia a dia. Um exemplo meio louco, mas baseado no que tu disse eu poderia dizer \"as mães do bruno guimarães carneiro do vue\" ao invés de \"as viuvas do vue\". Claro que não ficaria bom de dizer isso no dia a dia, mas acho que tu pega a idéia. E acredito também que no podcast tu num seria encorajado a \"falar como quiser\".Não vou nem visualizar a próxima resposta (se houver), pq infelizmente é uma energia desnecessária que eu gasto quando venho e faço um comentário e recebo umas respostas vagas tipo a sua quando comparada a do Paulo."},{"author":"Sebastião Relson Reis da Luz","comment":"Fiquei na curiosidade de saber em que posição da fila está o ExtJS"},{"author":"Tiago Aguiar Moreira","comment":"Roberta, realmente é pouco a porcentagem de empresas que não escrevem testes, mas não me surpreendo. Na verdade fiquei surpreso com essa quantidade. Achei que seria ainda menor. Conhece um cara que dizia que testes não serviam pra nada. Legal, né?"},{"author":"Roberta Arcoverde","comment":"Assustador!"},{"author":"Rafael Felipe","comment":"A propósito, faltou comentarem sobre \"Families and IT support\" que foi uma das perguntas que não tinha ano passado e chorei de rir quando li."},{"author":"Rafael Felipe","comment":"Uso o notepad++ aqui, quando preciso editar um arquivo de properties, conf, ou algo sob demanda que não estou numa workspace. Porque? estou com os dois abertos aqui VSC (102mb de memória) e Notepad ++(6,5mb).Ele abre muito mais rápido e resolve meu problema muito mais rápido."},{"author":"Black Power Dog","comment":"By the way, eu uso Netbeans (e gosto muito) e ainda programo em Delphi. Sou uma espécie de hipster ao avesso"},{"author":"Black Power Dog","comment":"Esse episódio foi um dos melhores do hipsters. A quantidade de piadas e ironias por minuto foi um espetáculo, toda hora eu ria sozinho aqui kkkkk. Vocês são fodas :)"},{"author":"Sandro Lucas","comment":"Eu gosto muito do Pycharm, da Jetbrains, para Python, e o DataGrip para Databases."},{"author":"Fernando Padoan","comment":"Code e Atom são pesados se você precisar instalar e abrir em um ambiente muito antigo. Ainda tem desses por aí... Fora que vejo muita gente que não adere a editores em CLI tipo vim porque não curte mesmo."},{"author":"Fernando Boaglio","comment":"parem de xingar o MongoDB, só hoje na NASDAQ a MDB caiu 4%  !"},{"author":"Paulo Silveira","comment":"somos influencers"},{"author":"Danilo Vieira","comment":"Para o desenvolvimento mobile eu uso Android Studio tanto para Android nativo (Java/Kotlin) como para usar Flutter. Para IOS nativo uso XCode.Para desenvolver em Flutter pode ser usado o Android Studio ou o VS code."},{"author":"Aline Amaro","comment":"Sobre o notepad++.... Tente trabalhar em Banco tradicional em que qualquer solicitação de instalação de software é um parto. :(Uso o notepad++ ou o vi mesmo e pra qualquer linguagem, de Chef, Python, shell Script, SQL, PHP até um R pra análises pontuais."},{"author":"Rafael Oliveira","comment":"Utilizo geralmente PHPSTORM e WEBSTORM para desenvolvimento e o NOTEPAD++ pra edições rápidas de arquivos individuais, é rápido e conveniente."},{"author":"Vinícius","comment":"Faço o mesmo. A pesquisa perguntava sobre todas as ferramentas utilizadas e não \"marque apenas a ferramenta que você mais usa para desenvolvimento\", não entendi o estranhamento do pessoal do podcast."},{"author":"Sergio Ribeiro","comment":"Massa o podcast.Pensando numa carreia no exterior e focando em backend, será que vale a pena investir em Java ou Javascript? Quais dessas tecnologias de backend vale a pena investir?"},{"author":"Paulo Silveira","comment":"vai depender muito do tipo de empresa e pais que voce ta procurando. javascript tem uma busca um pouco maior ainda que java, no geral. mas acho que vale muito investir no que voce se encaixa melhor e gosta"},{"author":"Roberta Arcoverde","comment":"Faltou o link pra nossa ferramenta que compara a popularidade de tags diferentes ao longo do tempo: https://insights.stackoverf..."},{"author":"Elías","comment":"Eu não achei nada de forçado no episódio (obs: não estou sendo patrocinado), digo isso porque já acompanhei os participantes em outros episódios e, pra mim, esse é o comportamento normal de cada um.Se não gosta da risada / comentário / piada, etc, é só avançar 5, 10 seg. Já eu, que achei o comportamento de todos normal / engraçado, mais uma vez caio na gargalhada aqui desse lado heheheÓtimo episódio, valeu!"},{"author":"Rodrigo Tognin","comment":"Bem legal! Eu trabalho ouvindo tanto podcasts quanto músicas. E sobre vídeos no youtube, pelo menos no chrome tem o recurso do picture-in-picture, no qual apenas o vídeo fica sobre as outras janelas e posso movê-lo e redimensioná-lo, deixando ele no canto inferior direito.Sobre músicas prefiro as que forem mais \"agitadas\", tanto aquelas dance dos anos 90 quanto power metal/black/death/folk... enfim, das mais pesadas."},{"author":"Fábio Lucas","comment":"Melhor podcast!Amo, espero um dia conhecer vocês!Me proporcionam muitas risadas e momentos alegres!Valeu galera!"},{"author":"Rodrigo Tognin","comment":"Posso falar que uso o Notepad++ para Cobol, Php e HTML/CSS/JavaScript?Se bem que eu sou meio fora da curva...Ah, e estou usando o Eclipse para aprender Java também. VSCode aqui só às vezes..."},{"author":"Paulo Silveira","comment":"pessoal ta se revelando nesse podcast :)"},{"author":"Guilherme Nascimento","comment":"Tava no Spotify, mas tive que vim aqui pra comentar sobre o Notepad++. Sim essas pessoas existem e eu também não entendo. O cara trabalhava na mesma agência que eu a algum tempo, do nada criou uma empresa e ficou rico...anos depois, recentemente ele postou uma foto da sua mesa de trabalho, e na foto aparece o monitor dele, e la estava AINDA o notepad++ aberto kkkkkkkk"},{"author":"Paulo Silveira","comment":"esse é roots"},{"author":"Rafael Felipe","comment":"gente, como comentei lá em cima, ele ocupa 6mb de memória e abre super rápido, pra tarefas pontuais fora de uma workspace vai super bem."},{"author":"Roberta Arcoverde","comment":"Confesso que nunca tinha tido a curiosidade de olhar o consumo de memória do VSCode! Muito interessante, imaginava que era bem mais leve. Bem, pra quem trabalha com o Visual Studio normalmente, o Code é uma pluma. Legal a observação :)"},{"author":"Tiago","comment":"Por favor coloquem a opção para alterar a velocidade de reprodução do podcast."},{"author":"Paul Hanry Lime Tree","comment":"Eu aperto F12 > Console > document.querySelector(\"#audio-2254-1\").playbackRate = 2; > Enter♥ JavaScript."},{"author":"Rian Perassoli","comment":"Eu uso o Google Podcasts para ouvir. Lá tem a opção de aumentar ou diminuir a velocidade de reprodução."},{"author":"Vinícius","comment":"Eu faço download e ouço no VLC"},{"author":"Rafael Felipe","comment":"Isso sim é ser hipster, usar o VLC, hehehe"},{"author":"Gabriel Felix","comment":"A risada ta muito chata heim.  Mas o conteúdo ta ótimo."},{"author":"Black Power Dog","comment":"Why so serious ?"},{"author":"Rafael","comment":"Tenho sempre a impressão que a galera que faz esse podcast é um monte de javeiro que acha que a microsoft ainda é dirigida pelo steve balmer kkkkkk (zuera) . Ótimo podcast galera !"},{"author":"Roberta Arcoverde","comment":"Nasci no Java mas meu país é C# <3"},{"author":"Maurício Linhares","comment":"Javeiro presente!"},{"author":"Paulo Silveira","comment":"na verdade é um monte de javeiro que tem inveja da microsoft acertar TUDO hoje em dia :)"},{"author":"Luiz Massa","comment":"Concordo. kkkkk"},{"author":"Joe Santos","comment":"Só aguardando o curso de Rust na Alura..."},{"author":"Victor Ferreira","comment":"É verdade, cadê, vai sair quando?"},{"author":"Bernardo Trindade","comment":"Olá, bom dia!Estou fazendo o curso de \"JavaScript: Programando na linguagem da web\" da Alura e vi que, de acordo com a formação de \"Engenheiro Front-end\", a próxima etapa seriam os cursos \"jQuery: Domine a biblioteca mais popular do mercado parte 1\" e \"jQuery: Avance na biblioteca mais popular do mercado parte 2\". Vale a pena aprender JQuery no aprendizado da linguagem Javascript ?"},{"author":"Paulo Silveira","comment":"oi Bernanrdo. acho que para o aprendizado e para o mercado o jQuery ainda é essencial: vai te ensinar bastante de ajax, de dom e de alguns truques, sem contar que MUITO provavelmente, para muitos empregos, vai precisar colocar a mao no jQuery, por mais que o javascript/html/css modernos ja consigam fazer a maioria das features dele. foi uma decisao dificil deixar jquery ai."},{"author":"Bernardo Trindade","comment":"Obrigado Paulo!"},{"author":"Thiago Mendes","comment":"Edição, pega leve ai na risada do Mauricio. Estão spamando ela em tudo."},{"author":"Rodrigo Tognin","comment":"Eu ia comentar isso... acaba ficando forçado."},{"author":"ricardogobbo","comment":"Que episódio zuado. Galera achando que é comediante stand-up. Relevaram a pesquisa e focaram nas piadinhas. Um desrespeito com a convidada que estava querendo falar sério enquanto os \"piadistas\" depredando o podcast. Essas risadas o todo tempo... Enfim."},{"author":"Black Power Dog","comment":"'Depredando'? Não vi ninguém jogando pedra em ninguém..."},{"author":"Roberta Arcoverde","comment":"acho que como todo mundo já se conhecia, acabou que o episodio teve um tom mais descontraído mesmo. quisemos brincar um pouco com o conceito de \"Tendencias pra 2020\", aproveitando os resultados do survey. mas nao teve desrespeito - achei até que tinha contribuído com algumas piadinhas!agora tou achando que meu senso de humor é tão sutil ou sem graça que passou despercebido T_T"},{"author":"Paulo Silveira","comment":"a intencao era ser mais descontraido mesmo ricardo. inclusive pra roberta. mas tomamos nota!"},{"author":"Jardel Cavalcante","comment":"Não conseguir ouvir até o final, as gaitadas desse cara são insuportáveis, nada contra o Maurício porém me incomoda muito ouvir ele gargalhando o tempo todo no fone de ouvido."},{"author":"Guilherme Silveira","comment":"Eu tenho que parar de fazer piada sem graça pq aí so o Linhares ri por bondade"},{"author":"Paulo Silveira","comment":"edicao! segura a risada do linhares ai :)"},{"author":"Vinícius","comment":"Não sei por quê essa pesquisa tem tão poucas respostas do Brasil"},{"author":"ricardogobbo","comment":"Eu não respondi porque não vi ou recebi uma msg."},{"author":"Roberta Arcoverde","comment":"vou repassar o feedback pro marketing :) eu até tentei divulgar mais no Twitter. Acho que normalmente quando a gente tá programando e \"cai\" no Stack Overflow, tá tão concentrado pra achar soluções pros nossos problemas que nem prestamos atenção nos banners da página 😅"},{"author":"ricardogobbo","comment":"Foi por aí mesmo. rsrs"}]}