{"title":"Microsserviços na Caelum – Hipsters On The Road #6","releaseDate":"23/04/2019","tags":["Podcast","programação"],"people":["Gabs Ferreira","Alberto Souza","Alexandre Aquiles"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=2259%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D2259&t_u=https%3A%2F%2Fhipsters.tech%2Fmicrosservicos-na-caelum-hipsters-on-the-road-6%2F&t_e=Microsservi%C3%A7os%20na%20Caelum%20%E2%80%93%20Hipsters%20On%20The%20Road%20%236&t_d=Microsservi%C3%A7os%20na%20Caelum%20-%20Hipsters%20On%20The%20Road%20%236%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Microsservi%C3%A7os%20na%20Caelum%20%E2%80%93%20Hipsters%20On%20The%20Road%20%236&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Caio Favero","comment":"Como eu faço pra trazer o Hipsters on the Road pra minha empresa?"},{"author":"Ryan Padilha","comment":"Acho super válido o ponto de vista, mas esse podcast é um resumo superficial teórico sobre o website do Martin Fowler -- https://martinfowler.com/ar... .. Vale mais a pena ler os artigos publicados pelo MF."},{"author":"Alberto Luiz Souza","comment":"Oi Ryan, obrigado pelo ponto de vista. Não posso negar que o conteúdo relacionado a Martin Fowler é mais rico. Realmente nem teria como não ser. Estamos tentando ser o mais profundo que conseguimos dentro do intervalo de 1 hora, acho que ainda vamos melhorar. A parte boa é que podemos repetir vários do mesmo tema por aqui e aí criar uma coleção legal."},{"author":"Ronaldo Prates","comment":"Depois de ouvir vários (6 eu acho) podcast's sobre o tema, percebi que a galera no geral não desce muito para o nível de desenvolvimento. Qual seria um numero ideal de Domínios para a quebra de projetos, até aonde vale a pena usar o relacional baseado nessas quebras, até aonde vale ou não vale a pena usar CQRS e Mensageria. Cases reais mesmo não somente no nível de abstração ou infra/arquitetura mas no nível de desenvolvimento de código. Padrões de desenvolvimento já que não terei regras de constraint no banco (documentação e possíveis diagramas ou arquitetura c4 para demonstrar as regras), Como extrair por exemplo o maximo do java 8,9 + spring data para as \"consultas\" e por ai vai..."},{"author":"Alberto Luiz Souza","comment":"Oi Ronaldo, obrigado pela perspectiva. Nosso objetivo é tentar ir profundo no hipsters on the road, a partir de agora. Achamos que tinha ido mais hoje e vamos pegar essa sua observação e fazer outro falando disso!"},{"author":"Pedro Costa","comment":"Alexandre é muito didático, tem o conhecimento muito sólido! Grande mestre! Excelente podcast."},{"author":"Thiago Miranda","comment":"PELO AMOR DE DEUS. Façam um podcast de RUST."},{"author":"Davis Peixoto","comment":"Ótimo podcast como sempre, mas vale uma nota/comentário fora do conteúdo principal aqui, mais como curiosidade mesmo. A função dos fusíveis e disjuntores (circuit breakers), não é de proteger os equipamentos, mas sim a instalação/fiação. Aliás, esse é um dos maiores causadores de incendios prediais. Tipo, a fiação é preparada para 10A (ou 20A, ou 5A...), e colocam máquinas mais potentes - geladeiras, impressoras, tornos, qqr coisa que consuma mais... - o disjuntor começa a cair toda vez que a geladeira liga, ou você manda imprimir, depois de 10 minutos que determinada máquina está funcionando... Daí você chama um eletricista que vai lá e troca o disjuntor por um com maior tolerancia (de 10A para um de 20A), mas não troca a fiação (que não vai suportar os 20A)... Pode ser que você ainda opere por anos, com os fios aquecidos até um dia em que a fiação inicia um incendio."},{"author":"Alexandre Aquiles","comment":"Valeu pela aula, Davis! Muito bacana!Eu pensava que o disjuntor era pra proteger a geladeira e a máquina de lavar. :)A analogia talvez faça mais sentido ainda: ao invés de proteger apenas um serviço qualquer (eletrodoméstico), o que é protegida é a integração entre serviços (a fiação). E uma falha na integração pode afetar o sistema como um todo (um incêndio). Muito bom!"},{"author":"Alberto Luiz Souza","comment":"Caramba! Obrigado pela correção Davis! Vamos deixar os disjuntores quietos de uma próxima vez! E agora estou mais protegido em caso de necessidade de eletricista :). Ficamos felizes que tenha gostado do podcast no geral!"},{"author":"Fanime Fartoon","comment":"Há previsão de criar esse curso também na Alura?"},{"author":"Alberto Luiz Souza","comment":"Oi Fanime, está nos planos mas ainda sem estimativa. Ele vai sair primeiro na Caelum, em julho. Aí com o conteúdo já prontinho, vamos ter a chance de planejar certinho para a alura."},{"author":"Fernando Souza","comment":"Legal muitos dos pontos, mas eu tenho um ponto de vista um pouco diferente na questão de de como começar. Acredito que se for começar um sistema do zero você até pode considerar um monolito, mas se se tem algo que não for core e pode ser deixado como micro serviço eu já o faria. Exemplo enviar e-mail, sms ou notificação para usuários. :D"},{"author":"Alexandre Aquiles","comment":"Bom ponto, Fernando! Faz muito sentido. Inclusive, acabamos usando serviços de terceiros para algumas funcionalidades como as que você mencionou."},{"author":"Abraão Borges Neves","comment":"Muito bom, todos os dias entro nesse dilema, e sempre chego neste ponto de valer ou não a pena, e termino no monolito, mas adoraria a experiência de trabalhar de ponta a ponta em um projeto com esta arquitetura de forma completa, mas até o momento não tive muitos motivos e nem oportunidades para isso, claro que pudesse valer 100% a pena."},{"author":"Alexandre Aquiles","comment":"Resista, amigo! A tentação é grande... :DAlguns arquitetos e desenvolvedores fazem o \"Curriculum Driven Development\".Você tá fazendo o melhor para o projeto e mostra maturidade ao analisar os trade-offs. Arquitetura de verdade!Quando serviços são uma boa solução, o sofrimento do dia-a-dia faz a gente reconhecer."}]}