{"title":"Assistentes de voz: Futuro sem telas? – Hipsters Ponto Tech #146","releaseDate":"30/04/2019","tags":["Podcast","programação"],"people":["Paulo Silveira","Neto Marin","Roberta Arcoverde","Maurício “Balboa” Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=2289%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D2289&t_u=https%3A%2F%2Fhipsters.tech%2Fassistentes-de-voz-futuro-sem-telas-hipsters-ponto-tech-146%2F&t_e=Assistentes%20de%20voz%3A%20Futuro%20sem%20telas%3F%20%E2%80%93%20Hipsters%20Ponto%20Tech%20%23146&t_d=Assistentes%20de%20voz%3A%20Futuro%20sem%20telas%3F%20-%20Hipsters%20Ponto%20Tech%20%23146%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Assistentes%20de%20voz%3A%20Futuro%20sem%20telas%3F%20%E2%80%93%20Hipsters%20Ponto%20Tech%20%23146&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Samuel Oliveira","comment":"Uso o home e o mine e ja estou comprando o novo Hub Max, vou trocar minha tv Samsung por LG pq ja vem com GA. Em IOT ja coloquei lâmpadas e camaras em casa, agora vou colocar alarme, e cortina tudo integrado ao Google Assistente. Só falta a Google lancar modelo novo do  Google Home para rede Mesh pois onatualnesta ultrapassado. A TP-Link esta anos luz na frente. Deve tb procurar fazer acordo com a Samsung pois é uma das maiores fabricantes de equipamentos do mundo e muito forte no Brasil"},{"author":"Leandro Freire","comment":"O Assistente de voz da Salesforce é bem interessante também, ele ajuda com anotações sobre feedbacks de reuniões fazendo speech-to-text e inputando os insights no CRM"},{"author":"Black Power Dog","comment":"O que eu acho sobre assistentes virtuais : \n\n\nReproduzir\n\n\n Ocultar\n\n\n\n"},{"author":"Riyadh Levi","comment":"Muito bom, este tema sem dúvida alguma ainda terá sua era de ouro. Diferente das televisões 3D e da realidade aumentada, como foi falado no podcast, acredito que o tema em questão tenha ganhado maior notoriedade devido ao seu pilar primordial, a praticidade. Eu utilizo a Google Assistente a alguns meses e sinto que a minha produtividade aumentou muito. Espero que essas interfaces de voz continuem firmes no mercado e tão logo cheguem com maior força aqui no Brasil."},{"author":"Fernando Santana","comment":"tentei buscar a definição de QA em inglês no google assistent pelo celular, ele traduzia para o português. Para termos de outras linguagens não funciona ainda."},{"author":"Kaique de Miranda","comment":"Diferente dos nossos amados Co-Hosts eu já tinha interesse em comprar antes e o podcast me deixou com mais vontade!Sobre um tópico especifico do podcast que é sobre ficar ouvindo o tempo todo, nada me tira da cabeça que o microfone do celular fica ligado, porque há um tempo estava conversando (não pesquisando apenas conversando) sobre alianças PESSOALMENTE com a minha namorada e quando abri minhas redes sociais haviam links de lojas que vendiam, então nada me faz crer que esses assistentes estão de fato desligados e só ativam com o voice match.Ótimo assunto, excelente podcast e até o próximo <3"},{"author":"Neto Marin","comment":"Legal que gostou, Kaique! =)Sobre a questão do celular, realmente existe essa desconfiança de algumas pessoas. Mas, isso em geral seria facilmente detectável, pois seria necessária uma atividade acima do normal para enviar continuamente audio para a nuvem. E se o app decidisse fazer isso localmente, ia fritar a bateria. Além de outros detalhes mais específicos.Tem um nerdologia bem legal sobre o assunto\n\n\n\nReproduzir\n\n\n Ocultar\n\n\n\n\n, vale a pena assistir caso ainda tenha. :)AbraçosNeto"}]}