{"title":"Business Agility – Hipsters #147","releaseDate":"07/05/2019","tags":["agilidade","business","Podcast"],"people":["Paulo Silveira","Alexandre Magno","Adriano Almeida"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=2341%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D2341&t_u=https%3A%2F%2Fhipsters.tech%2Fbusiness-agility-hipsters-147%2F&t_e=Business%20Agility%20%E2%80%93%20Hipsters%20%23147&t_d=Business%20Agility%20-%20Hipsters%20%23147%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Business%20Agility%20%E2%80%93%20Hipsters%20%23147&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Luiz Massa","comment":"Um dos melhores podcast do Hipsters, sem dúvidas."},{"author":"wellington silva","comment":"O que acontece quando \"quebram\" as paredes é que transforma a vida dos desenvolvedores num inferno.Todo mundo tem liberdade de bater no seu ombro e falar: resolve isso aqui pra mim!Se não existir algo bem definido de como as coisas chegam e como será resolvido vai piorar mais do que melhorar."},{"author":"ab c","comment":"O papel estratégico do RH vai muito além de entender do negócio, como foi afirmado."},{"author":"Adriano Henrique de Almeida","comment":"Opa ab c, com certeza. É uma frase hiper resumida de um assunto que cabe até em outro episódio :).Mas quanto cada vez mais o RH entende do negócio, mais isso vai facilitar o próprio trabalho dele de entregar resultados para a empresa. E isso não é exclusivo pra RH não. Quanto mais os desenvolvedores, os vendedores, os contadores etc conhecerem do negócio, mais vai facilitar pra que eles enxerguem seu papel e como melhor podem contribuir com a entrega de resultados pro cliente e pro negócio."},{"author":"Davis Peixoto","comment":"Queria que a maioria dos CTOs, POs, e CEOs ouvissem esse podcast. Principalmente depois de cobrar mais agilidade do TI."},{"author":"Felipe M Andrada","comment":"Que aula...Tem meu voto para o pódio de melhores episódios!"}]}