{"title":"React Native – Hipsters #148","releaseDate":"14/05/2019","tags":["mobile","Podcast","programação"],"people":["Paulo Silveira","José Urbano","Paula Moura","Guilherme Varandas","Roberta Arcoverde","Maurício “Balboa” Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=2360%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D2360&t_u=https%3A%2F%2Fhipsters.tech%2Freact-native-hipsters-148%2F&t_e=React%20Native%20%E2%80%93%20Hipsters%20%23148&t_d=React%20Native%20-%20Hipsters%20%23148%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=React%20Native%20%E2%80%93%20Hipsters%20%23148&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"dev.easier","comment":"Quem quiser saber mais sobre como está o React Native em 2019 (e como ele está em relação ao Flutter): https://blog.rocketseat.com..."},{"author":"Rafa lima","comment":"Eu tenho uma duvida, caso eu queria iniciar na carreira de mobile, o que eu devo estudar qual o melhor caminho? já tenho uma conta na alura, porem são diversos caminhos que podem ser percorridos, grato."},{"author":"Edy Silva","comment":"Já consigo ver o Jacob do Flutterando participando em um episódio sobre Flutter"},{"author":"Murilo","comment":"E como faz  para conseguir pagar o IPVA  pelo aplicativo do BB? kkkkkkkkBrincadeiras a parte, fiquei com dúvida nessa engine que transforma JSON para interface nativa. Essa engine faz parte do Android e iOS e sempre esteve presente nesses sistemas operacionais? Ou é algo que faz parte da engine do ReactNative e é acoplado ao apk/ipa quando é feito o build da aplicação?"},{"author":"Maurício Linhares","comment":"É uma coisa nativa que eles escreveram pra fazer a transformação, aqui tem uma descrição sobre como funciona o negócio: https://hackernoon.com/unde..."},{"author":"Murilo","comment":"Show, então faz parte da plataforma do ReacNative mesmo.Interessante ver que a comunicação acontece por filas assincronas, acaba se alinhando ao padrão moderno de interfaces gráficas onde tudo deve ser assincrono para não ferrar com a interação do usuário."},{"author":"Paulo Pompeu","comment":"@MauricioAté pouco tempo atrás 90% dos códigos gerados nos bancos eram em cobol. O front não podia ter nenhuma regra de negócio, ou melhor, toda regra deveria estar no cobol. (No Brasil)Essa era a turma que fazia chover: tinha que adivinhar o que o cliente queria, trabalhando com escopo dinâmico (!!!); quando dava erro em algum ponto do processo, inclusive front, tinha que se virar para achar e corrigir; projetava, desenvolvia, testava e implantava; tinha que entender de BD mais que o DBA do banco; era obrigada a entender todas a tecnologias envolvidas numa requisição, que poderia ir do click numa página, análise de crédito por instituições externas até a efetivação da solicitação dentro do sistema de conta corrente (ex de solicitação de cartão de crédito).O Cobol por N motivos virou uma espécie de estigma, mas a verdade é que foi um povo bem roots e tinha que resolver num tempo que não tinha ctrl+espaço para ajudar.O curioso não é o coboleiro ser capaz de aprender react, é alguém que desenvolvia apenas o front e muitas vezes não tinha nem acesso à base de dados ter mais reconhecimento. Posso citar players grandes do mercado brasileiro que trabalham assim, onde se criar um grid numa página é mais valorizado que entender de logística e tributação.Acredito que não tem ciência mais inexata do que futurismo, mas com a extinção dos treinamentos em cobol, esse povo ficando velho e mudando de área, fico bem curioso pra ver como vão lidar com esse legado. O que ajuda um pouco é que o ritmo de desenvolvimento caiu muito depois da consolidação do número de bancos no Brasil. Só o tempo vai dizer se a gente ainda precisa desse tipo de profissional ou não.Sim, fui coboleiro mas já deixei de programar há uns anos. Não gosto quando não dão o devido crédito à esse pessoal #coboleirotambémégente."},{"author":"Maurício Linhares","comment":"Opa!Fiz um comentário chato né, foi vacilo, todo respeito aos coboleiros e a todo mundo que se atualiza no mercado :D"},{"author":"Paulo Pompeu","comment":"Você é o cara da treta! rsAté um tempo atrás não se escreviam regras fora do cobol, o que criava um mercado muito grande. Hoje, isso não é mais verdade e houve uma adaptação e reciclagem desses profissionais. Como a geração millenium tem um baixo comprometimento e um turnover beirando a estratosfera, principalmente na área mobile, há espaço e tempo para aqueles que queiram se atualizar.Além disso, coboleiro não é necessariamente uma pessoa velha. A IBM continua vendendo mainframes e treinando/certificando gente em cobol. ;)"},{"author":"Maurício Linhares","comment":"Rapaz, aproveite o turnover, melhor forma de aumentar o salário, a gente não sabe quanto tempo essa farra vai durar :D"},{"author":"Black Power Dog","comment":"Como dizia um Coboleiro que conheci há muitos anos... Cuidado ao zoar o Cobol, pois a nota fiscal do seu caixão pode ser impressa por um programa Cobol :p"},{"author":"Paulo Pompeu","comment":"Eu não seria tão drástico nem rápido assim... vender seus dados pessoais e ver o trabalho que dá limpar o nome é mais divertido e lento! ;)"},{"author":"Igor Carvalho de Paula","comment":"Nao tem o link da apresentacao sobre o app do branco do brasil, a construcao do bundle."},{"author":"Maurício Linhares","comment":"https://www.infoq.com/br/pr... tá aqui ó, vamos colocar lá."},{"author":"Igor Carvalho de Paula","comment":"Essa apresentação eu conheco, eu achei que tivesse algo que ensinasse o jabá de criar esse bundle e fazer o react native lê-lo."},{"author":"Lucas Breitembac̶h","comment":"Flutter é a evolução do react native, xamarin, Java etc... Ele pegou todos os pontos fracos e melhorou. Se tornando hoje em dia referência para desen. Mobile Nativo."},{"author":"Rafael Silva","comment":"pra que falar de react enquanto o flutter esta ai mil vezes superior ao react, em versão estavele futuramente gerando web de forma melhor e mais rapida que o velho react"},{"author":"Wagner","comment":"Não se fala /mobaiou/ e sim /môble/ (ou /môbou/). Não se pronuncia JSON como /jay son/ e sim Jason (como nome de pessoa mesmo, inclusive JSON é um trocadilho com o nome Jason, de sexta-feira 13).Outro ponto, Ionic nada mais é que uma webview que carrega um \"site\" (assets) local. O React Native trabalha de forma totalmente diferente, tendo um bundle que é utilizado pelo motor do React Native."},{"author":"Roberta Arcoverde","comment":"Se fala /mobaiou/ também em alguns lugares (no Reino Unido, por exemplo). Tenho alguns colegas de trabalho britânicos que só falam mobaiou :)"},{"author":"Wagner","comment":"Mas o inglês mais falado no mundo é o en_US, portando /môbou/ deveria ser usado e se não for, então substitua Center por Centre (os ingleses usam esse termo), entre outras diferenças do en_US pro en_GB"},{"author":"TiagoPeczenyj","comment":"O inglês mais falado do mundo provavelmente é o errado, uma vez que poucos países tem esse idioma como oficial, então a maioria usa como segunda língua e vamos ter variações na proficiência, além de sotaques locais, etc. Como não estamos falando de uma linguagem tonal, o interlocutor que usar /mobaiou/, /môble/ ou /môbou/ se fará entender na maior parte dos casos. O mesmo não se pode dizer do Mandarim."},{"author":"Vinicius Baggio Fuentes","comment":"Moro nos Estados Unidos faz 7 anos e já vi americanos de toda a parte do país falarem as duas pronúncias. Inclusive já ouvi californianos de regiões próximas falarem as pronúncias diferentes. O próprio dicionário Webster define 3 pronúncias diferentes válidas: https://www.merriam-webster.... Veja que o Webster (o Sr Webster criador do dicionário) foi responsável pela definição da sonoridade de várias palavras no inglês americano. Referência: https://en.wikipedia.org/wi..."},{"author":"Wagner","comment":"Parabéns, você foi o único que argumentou com fatos e não com desculpas. Provou por A + B que ambas pronúncias são corretas."},{"author":"Paulo Silveira","comment":"Ah, e como eu havia imaginado, você está errado sobre JSON/JASON  \n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n :"},{"author":"Wagner","comment":"Então avisa a Wikipedia que eles estão errados sobre a pronúncia \"Jason\". E quando eu falei sobre a sexta-feira 13, eu me referi ao nome do personagem em si e não ao fato do filme, que nada tem a ver, apenas o nome \"Jason\" do protagonista ser referência (me diga outro filme que tem o protagonista com nome Jason e que seja um filme tão famoso quanto). Eu nem sabia que tinha essa discussão idiota."},{"author":"Paulo Silveira","comment":"no hipsters ponto tech o ingles oficial é o en_FB, conhecido como facebook english. isto é, fala-se como quiser, a vontade, sem correção. se voce ta esperando que a gente vá pronunciar wisdol em vez de W.S.D.L. ou isquell em vez de S.Q.L, coca light em vez de coca laite, ta no podcast errado :)"},{"author":"Wagner","comment":"Ok, então disseminar termo errado pra vocês é legal. Muito bom saber o nível de profissionais que vocês são."},{"author":"João P. Vanzuita","comment":"11:40 todo mundo checando o WhatsApp"},{"author":"Ricardo de Souza Monteiro","comment":"Esqueceram de colocar o link da Paula na descrição ?"},{"author":"Gabs Ferreira","comment":"Ela não tinha passado pra gente, Ricardo. Mas achei aqui e coloquei lá :)"},{"author":"DarkElf","comment":"Ler os comentários do aplicativo do banco no Google Play, eita...React Native, passei bastante raiva. Mas infinitamente melhor que mexer com Ionic"},{"author":"Fausto Blanco","comment":"e flutter vai ter quando?"},{"author":"Wagner","comment":"Quando ele funcionar decentemente. 🤣"},{"author":"Fausto Blanco","comment":"supera o RN desde que nasceu, nem vem cara"},{"author":"Wagner","comment":"Não é o que o NuBank acha. Eles estão migrando pro Flutter mas estão passando por alguns problemas. Não só eles, mas muitos outros projetos. Só olhar as issues. O ecossistema do Flutter ainda é minúsculo se comparado do React Native."},{"author":"Guilherme Rodrigues","comment":"Wagner  o Flutter já está estável amigo"},{"author":"Wagner","comment":"Estável é diferente de funcionar decentemente."},{"author":"Lucas Breitembac̶h","comment":"Temos um cara que nunca usou flutter.O que você vai fazer no react Native: Encher de If para rodar nas duas plataforma, ter que usar redux, para os componentes não ficar zuado. Menos performance.Já usei react Native e não saio nunca mais do flutter 🥰"},{"author":"Wagner","comment":"Redux? Só usa esse lixo quem não sabe programar direito.E sim, eu não só usei como eu fiz um PR pra ele e foi aceito! E você? O que você pelo Flutter, além de falar merda?"},{"author":"Rafael Silva","comment":"Cara aqui um pagina de tecnologia para debatermos de tecnologia e não ofender as pessoas, manda teu git ai se tu realmente fez PR"},{"author":"Taichou12","comment":"Essa geração 7x1 tá complicada."},{"author":"Mario Souto","comment":"A talk do Tadeu Zagallo falando da arquitetura e o processo de criação do React Native: \n\n\nReproduzir\n\n\n Ocultar\n\n\n\n\n"},{"author":"Fernando Ferreira","comment":"Parte superior Parte superior Parte superior"}]}