{"title":"Squads e Agilidade no Magazine Luiza – Hipsters Ponto Tech #149","releaseDate":"21/05/2019","tags":["agilidade","Podcast"],"people":["Paulo Silveira","Henrique Imbertti","Roberta Genaio","Guilherme Varandas","Adriano Almeida"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=2377%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D2377&t_u=https%3A%2F%2Fhipsters.tech%2Fsquads-e-agilidade-no-magazine-luiza-hipsters-ponto-tech-149%2F&t_e=Squads%20e%20Agilidade%20no%20Magazine%20Luiza%20%E2%80%93%20Hipsters%20Ponto%20Tech%20%23149&t_d=Squads%20e%20Agilidade%20no%20Magazine%20Luiza%20-%20Hipsters%20Ponto%20Tech%20%23149%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Squads%20e%20Agilidade%20no%20Magazine%20Luiza%20%E2%80%93%20Hipsters%20Ponto%20Tech%20%23149&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Alã Costa","comment":"Adorei esse Podcast, meu primeiro do hipster! Fantástico o conteúdo e a forma como foi conduzida a discussão! Fiquei fã!"},{"author":"Carlos Eduardo","comment":"O tamanho do time não é determinado por nenhuma metodologia. Mas já foi diagnosticado(por estudos científicos e observação empírica)  que times \"grandes\"(termo relativo) tem maior dificuldade em manter a comunicação fluída e atualizada. Uma das principais razões é a quantidade de canais de comunicação que se abre por integrante."},{"author":"Jian Rodrigues","comment":"Esse comentário foi apagado."},{"author":"Jian Rodrigues","comment":"Que comentário mais infeliz e desnecessário."},{"author":"Bruno Funnie","comment":"Uma coisa não tem nada a ver com a outra, se você ouviu o Podcast inteiro teria percebido que na verdade os termos em inglês foram para criar uma cultura, um jeito de trabalhar que gerasse um impacto sonoro, visual. Isso é completamente plausível, criar uma cultura dentro da empresa utilizando termos seja em inglês, alemão, japonês (por exemplo: kan ban, poka-yoke, kaizen). Posso até sair um pouco do escopo de tecnologia e citar diversas palavras que foram incorporadas em nosso vocabulário que são de origem estrangeiras como: sutiã, bufê, boné, abajur... ou ainda algumas metonímias como Bombril, Gillette ou o próprio Isopor.Inglês pode não ser essencial para TODAS as situações, mas em um mundo de tecnologia é essencial se você quer expandir o seu conhecimento, opções de trabalho, ter oportunidades no exterior, ter acesso a documentações oficiais sem ter que esperar por traduções e MUITAS outras situações. Quanto a você afirmar que \"a maioria não sabe\" é muito leviano e até considero um espantalho para o seu argumento então vou desconsiderar.Quanto a ver pessoas escrevendo errado o português, sim, realmente acontece tem pessoas que realmente tem um nível de conhecimento da língua portuguesa bem precário. Mas isso não significa que estas pessoas não possam utilizar termos em outras línguas para ajudar, diversificar e tornar o ambiente de trabalho mais eficaz e descontraído.Então, \"seje menas\" and be happy!"},{"author":"Rafael Santos","comment":"Esse comentário foi apagado."},{"author":"Rafael Santos","comment":"e se fala \"squAd\" e não \"squEd\" kkkk"}]}