{"title":"Tecnologias no Nubank: 3 anos depois – Hipsters #150","releaseDate":"28/05/2019","tags":["Podcast","programação"],"people":["Paulo Silveira","Ed Wible","Lucas Cavalcanti","Roberta Arcoverde","Maurício “Balboa” Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=2385%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D2385&t_u=https%3A%2F%2Fhipsters.tech%2Ftecnologias-no-nubank-3-anos-depois-hipsters-150%2F&t_e=Tecnologias%20no%20Nubank%3A%203%20anos%20depois%20%E2%80%93%20Hipsters%20%23150&t_d=Tecnologias%20no%20Nubank%3A%203%20anos%20depois%20-%20Hipsters%20%23150%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Tecnologias%20no%20Nubank%3A%203%20anos%20depois%20%E2%80%93%20Hipsters%20%23150&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Patrick Nascimento","comment":"Bah, alguns bancos hoje em dia ainda usam essa famosa tabelinha hahaha (santander, bradesco)  :("},{"author":"Tiago Aguiar Moreira","comment":"Parabéns, pelo aniversário do cast! Acompanho desde o primeiro e com certeza só tem melhorado!Pessoal, uma coisa que eu ouvi no cast e achei muito interessante é sobre o \"charge\" (não sei se é assim que fala) citado em torno dos 35 minutos. Queria entender melhor esse funcionamento ou link de referência para o assunto. Valeu!"},{"author":"DarkElf","comment":"Acho que eles querem dizer shard.Alguém poderia explicar o que é isso?"},{"author":"Paulo Silveira","comment":"é shard mesmo. seriam formas de voce dividir o banco de dados (Existem varias) para poder ganhar mais disponibilidade. no caso é como se eles fizessem sharding da aplicacao *inteira*"},{"author":"Carlos Ferreira","comment":"Parabéns pelo aniversário do podcast, Paulo! E que prazer foi \"rever\" o Lucas, depois de algum tempo!"},{"author":"Paulo Silveira","comment":"obrigado professor!"},{"author":"Guilherme Pasqualino","comment":"Tem algum link pra esse diplomatic architecture?"},{"author":"Yuri Araujo","comment":"Fiquei com uma dúvida quando mencionaram sobre usar react native com outras tecnologias pra gerar apenas um binário. É possível misturar várias linguagens no desenvolvimento mobile? Se sim, adoraria algum artigo explicando."},{"author":"Fernando O. Pimenta","comment":"Muito bom, espero um dia poder trabalhar em um projeto tão desafiador igual o Nubank."},{"author":"Tania Makiyama","comment":"Adorei! Eu ouvi o primeiro a três anos atrás e me fez apaixonar pelo Hipsters Ponto Tech. Poder ouvir a evolução do Nubank é sempre incrível."},{"author":"Thiago Mauricio","comment":"Conteúdo incrível! Estão de parabéns pela qualidade. Não sei se o podcast me motivou a estudar ou me deixou na merda mostrando o tanto que estou na zona de conforto da profissão e o que diariamente temos que estudar para trabalhar em alto nível em um universo que evolui a cada instante haha"},{"author":"Rafael Felipe","comment":"Mais de 200 microserviços, imagino pra batizar tudo isso aí. Vocês tem tipo um oráculo igual a família dinossauro pra batizar os bebês que nascem?"},{"author":"Rafael Duque Estrada","comment":"Paulo e galera hipster.tech, parabéns pelos 3 anos, esperamos que continuem realizando esse excelente trabalho. Mais um podcast excelente com a galera da Nubank.Só para descontrair, toda vez que o Ed falava me sentia vendo o Érick Jacquin do Masterchef, só que sem legenda hehehe."},{"author":"Silva","comment":"Legal, vão usar Flutter!  Flutter vs Reactive Native, um assunto legal!!!"},{"author":"André Vasconcelos","comment":"Opa! Mais uma \"briga\" ai kkkk"},{"author":"Nate","comment":"Parabéns pela qualidade do podcast e pelas informações levantadas.Alguma previsão da Nubank sobre integração ao Apple Pay?"},{"author":"Gabriel Felix","comment":"Parabéns a todos vocês são um dos maiores percursores de conteúdo na area , parte do ecosistema de vocês me acompanha desde o inicio da minha carreira , lá na caelum e me acompanha no metro via alura , e no meus home offices via hipsters . Parabéns ai Gui e Paulo"},{"author":"Abraão Allysson Dos Santos","comment":"Parabéns galera! E graça ao Nubank os serviços financeiros do Brasil melhorou.Fica o link sobre o investimento de fintechshttps://www.startse.com/not..."},{"author":"Fábio Lucas","comment":"Parabéns galera!Melhor podcast que existe. Estou toda terça aqui pra escutar vocês, aprender e rir demais!Abraços!"},{"author":"Leonardo Rocha Dias","comment":"Muito bom!Já quero um sobre Kafka, e Flutter vs Reactive Native.Gostaria de ouvir sobre as tecnologias no Banco Inter também."},{"author":"Cleiton Dantas","comment":"Parabéns Paulo e toda galera do Hipsters, parece que foi ontem que eu escutei o Paulo falando do lançamento do podcast no Nerdcast e la estava o link pro primeiro episodio com o nubank. É muito bacana ver o quanto a comunidade tem crescido e evoluído.Parabéns"}]}