{"title":"Microsserviços autônomos na Usabilla – Hipsters On The Road #10","releaseDate":"18/06/2019","tags":["Podcast","programação"],"people":["Gabs Ferreira","Renato Mefi","Alberto Souza"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=2420%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D2420&t_u=https%3A%2F%2Fhipsters.tech%2Fmicrosservicos-autonomos-na-usabilla-hipsters-on-the-road-10%2F&t_e=Microsservi%C3%A7os%20aut%C3%B4nomos%20na%20Usabilla%20%E2%80%93%20Hipsters%20On%20The%20Road%20%2310&t_d=Microsservi%C3%A7os%20aut%C3%B4nomos%20na%20Usabilla%20-%20Hipsters%20On%20The%20Road%20%2310%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Microsservi%C3%A7os%20aut%C3%B4nomos%20na%20Usabilla%20%E2%80%93%20Hipsters%20On%20The%20Road%20%2310&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Vinicius Gati","comment":"Deu medo esse podcast haha PESADO"},{"author":"Davis Peixoto","comment":"Gabs Ferreira, tive que voltar vários trechos várias vezes... E alguns eu realmente não absorvi. #tamojuntoMas pela parte que entendi, e pelas referencias citadas, o podcast está de parabéns como sempre!"},{"author":"Gabs Ferreira","comment":"hahahahaha tamo junto!"},{"author":"Rafael Felipe","comment":"O engraçado é ter saído perto do outro podcast sobre Overengineering, é bom quando ver que o cara que defende a ideia entende do que está falando. Mas \"se tirar a parte complicada fica simples\", hehehe. A ideia é deixar os microserviços realmente independentes e pra isso eles replicam bastante informação de uma maneira transparente para a aplicação.Interessante são os termos técnicos que utilizam e nós meros mortais aplicam sem saber, tipo:Ao invés de publicar um evento e capturar o mesmo pra inserir no banco, você insere no banco e insere numa tabela de eventos onde tem um outro software monitorando pra publicar o evento de fato, assim garante a transação (eu faria a mesma coisa mas não saberia dizer se é CDC puro ou não).Faltou comentar sobre se essa abordagem aí não gasta storage em excesso, se na prática não aumentou muito o armazenamento."},{"author":"Renato Mefi","comment":"Obrigado pelo comentário Rafael FelipeRealmente tudo que retiramos a parte difícil fica fácil né? heheNo nosso caso não gastamos storage em excesso pois a informação que replicamos mais vezes não é nosso core business. A usabilla vive de itens de feedback, estes a gente repete pouco, mais em bancos especializados para agregação e pesquisa.Geralmente os dados que necessitamos nos outros serviços não são estes itens de feedback porém dados de usuário, configurações e metadados para o feedback.Claro que cada caso é um caso, porém imagino que muitas vezes também se é necessário replicar muita informação pode ser sinal de que a arquitetura está vazando dos contextos delimitados, tornando a replicação mais e mais necessária, isso também pode acontecer quando as pessoas quebram a arquitetura em serviços demasiados!Espero que esta resposta possa ter esclarecido um pouco mais a coisas!"},{"author":"Ravan Scafi","comment":"Muito bom! Vou ter que ouvir umas três vezes pra fixar tanto conceito legal  hahahaComo o Alberto disse é a consistência eventual do cérebro 😅"},{"author":"Eduardo Reale","comment":"Achei que só eu estava boiando. hehehe"},{"author":"Alberto Luiz Souza","comment":"Esse foi intenso né? Senti a mesma coisa. Quando acabou, eu tava mega cansado hehehe."}]}