{"title":"Testes de Software e Inteligência Artificial – Hipsters #154","releaseDate":"25/06/2019","tags":["Podcast","programação"],"people":["Paulo Silveira","Maurício Aniche","Roberta Arcoverde","Maurício “Balboa” Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=2439%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D2439&t_u=https%3A%2F%2Fhipsters.tech%2Ftestes-de-software-e-inteligencia-artificial-hipsters-154%2F&t_e=Testes%20de%20Software%20e%20Intelig%C3%AAncia%20Artificial%20%E2%80%93%20Hipsters%20%23154&t_d=Testes%20de%20Software%20e%20Intelig%C3%AAncia%20Artificial%20-%20Hipsters%20%23154%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Testes%20de%20Software%20e%20Intelig%C3%AAncia%20Artificial%20%E2%80%93%20Hipsters%20%23154&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Paulo Sérgio Medeiros","comment":"Pulei alguns trechos do podcast, mas não vi citarem o SpotQA - https://www.spotqa.com/"},{"author":"Alexandre Pereira","comment":"Goistei muito da ideia da automatização nível 2 de teste de código. Já ouvi falar no Randoop, vocês preferem o Evosuite ou tem alguma outra ferramenta para testar códigos de APIs escrito em spring, por exemplo?"},{"author":"André Luiz Leoni","comment":"Muito massa esse EP. parabéns!"},{"author":"Thiago Delgado Pinto","comment":"Parabéns pelo episódio! Queria deixar uma referência para uma linguagem e ferramenta opensource: concordialang.org. Elas foram desenvolvidas durante minha pesquisa de doutorado na PUC/Rio. A linguagem, chamada Concordia, permite escrever especificações de requisitos no \"estilo Ágil\", em Português ou Inglês. A ferramenta usa processamento de linguagem natural (NLP) e inferência de dados de teste e oráculos, a partir de declarações realizadas na especificação. Com isso, ela consegue gerar automaticamente testes e2e completos, sem precisar escrever código. Os testes gerados empregam várias técnicas conhecidas, tais como análise de valor limite, particionamento em classes de equivalência e teste aleatório, além de usar teste combinatório (p-wise) e outras mais. Daí, a bateria de testes gerada provavelmente vai cobrir casos importantes da aplicação (regras de negócio, principalmente) e também aqueles fáceis de se esquecer. :)"},{"author":"Maurício Aniche","comment":"Muito legal, Thiago!"},{"author":"dev.easier","comment":"Thiago Delgado Pinto Muito legal!"},{"author":"Stélio Moiane","comment":"Muito bom o episódio. Parabéns pessoal. Impressionante que sempre que o assunto é Testes Aniche é a primeira pessoal que me vem a cabeça, não so por ser a pessoa que me \"evangelizou\" la em 2013 em Maputo (lembra Aniche?) mas também por se a pessoa que realmente domina o tema. mais uma vez parabéns pela partilha.Abraços"},{"author":"Maurício Aniche","comment":"Claro que lembro, Stélio! Mande um abraço a todos por aí, se vc ainda tiver contato com eles!E bom saber que vc ainda acompanha meu conteúdo!! Fico feliz!"},{"author":"Paulo Kraemer","comment":"Acessando a URL do EvoSuite (http://www.evosuite.org), avisa que o site não está disponível."},{"author":"Maurício Aniche","comment":"Aqui abriu. Talvez uma instabilidade momentânea?"},{"author":"Eduardo","comment":"Qual o nome e link do projeto do google que o Maurício citou???"},{"author":"Herbert Sousa Cruz","comment":"Eduardo  acho que é Fuzzer Test Suite "},{"author":"Robert Resende","comment":"Bom dia, parabéns por este episódio sensacional... Com dicas valiosíssimas... Mauricio, por favor poste nos link o livro sobre a galera da Alemanha, é uma área de gosto muito. Também tenho muito interesse nessa ferramenta de testes SQL, bora trocar uma ideia pra ver se posso ajudar na evolução dela pois aonde trabalho tenho umas aplicações legadas que são basicamente SP's que como a Roberta falou vira e mexe nos deixa com as coisas na mão.... Abs Robert Resende"},{"author":"Maurício Aniche","comment":"fuzzingbook.org"},{"author":"Robert Resende","comment":"Boa tarde,Aniche muito obrigado pelo retorno!At Robert"}]}