{"title":"Vida e Obra: John Carmack – Hipsters Ponto Tech #156","releaseDate":"09/07/2019","tags":["carreira","Podcast","programação"],"people":["Paulo Silveira","André Breves","Roberta Arcoverde","Maurício “Balboa” Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=2461%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D2461&t_u=https%3A%2F%2Fhipsters.tech%2Fvida-e-obra-john-carmack-hipsters-ponto-tech-156%2F&t_e=Vida%20e%20Obra%3A%20John%20Carmack%20%E2%80%93%20Hipsters%20Ponto%20Tech%20%23156&t_d=Vida%20e%20Obra%3A%20John%20Carmack%20-%20Hipsters%20Ponto%20Tech%20%23156%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Vida%20e%20Obra%3A%20John%20Carmack%20%E2%80%93%20Hipsters%20Ponto%20Tech%20%23156&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Rodrigo Tognin","comment":"Eu vivi para ouvir alguém mencionar \"Commander Keen\" em um podcast!Sou dessa época, joguei bastante o game no meu 486, lá em 1997... Show!"},{"author":"Wagner","comment":"Primeiro Podcast que ouço aqui no Hipsters.Tech! Muito legal!"},{"author":"Reinaldo Braga","comment":"Ward Cunningham :)"},{"author":"Victor Yuji Maehira","comment":"O brasileiro é famoso por ser criativo e \"tirar leite de pedra\",como dizem por aí. Fico curioso de saber os causos dos brasileiros que competem com gigantes de fora, como é o caso dos desenvolvedores do filme \"Cassiopeia\" que fizeram uma animação 3D em computadores 486 na década de 90 e chegaram a disputar o pioneirismo com o Toy Story da Pixar.No mais, parabéns pela iniciativa! Joguei muito Doom na minha adolescência e não sabia da loucura, no bom sentido, do Carmack! Muito bom!"},{"author":"Maurício Linhares","comment":"Nem sabia desses, vamos procurar sim!"},{"author":"Jefferson Ribeiro de Medeiros","comment":"Eu não sei se alguém já sugeriu isso aqui mas poderia ter a transcrição do audio do podcast. A Alura já tem a tecnologia para isso. Tem alguns jogos antigos que não consegui anotar o nome. Qual foi o primeiro jogo que  a Roberta falou que jogava ??"},{"author":"Roberta Arcoverde","comment":"Commander Keen!"},{"author":"Jefferson Ribeiro de Medeiros","comment":"Oi Roberta. Eu achei que tinha ouvido Commander Queen. Não estava achando. Obrigado !!"},{"author":"Romulo Martins Da Silva","comment":"O proximo poderia ser o Linus Torvalds né? haha"},{"author":"PedroHFC","comment":"tem meu voto, mas outra ótima opção seria Guido van Rossum."},{"author":"Marlos","comment":"Boa."},{"author":"Eridani Campos","comment":"Descobri que eu era fã do John Carmack por causa desse episodio do podcast e não sabia...Meu pai era oficial da Marina Mercantil e sempre que eu passava dias visitando o navio dele na decada de 90. Sempre tinha esses jogos instalados no Computador pra passar o tempo!Joguei Quake, Doom, Tennis, Catacomb, Slordax, Hovertank 3D, Wolfenstein 3D (amava!) e Heretic"},{"author":"Maurício Linhares","comment":"Tá vendo, já tava no caminho certo! Heretic era muito bom, pena que não fez muito sucesso :D"},{"author":"Eridani Campos","comment":"Muito boa a ideia da sérieMas fujam dos personagem Cliches como Steve Jobs e etc..."},{"author":"Marcilio Leite","comment":"Brendan Eich"}]}