{"title":"Microsserviços na Monkey Exchange – Hipsters On The Road #12","releaseDate":"16/07/2019","tags":["Podcast","programação"],"people":["Gabs Ferreira","Felipe Adorno","Bruno Oliveira","Diego Costa","Alberto Souza"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=2476%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D2476&t_u=https%3A%2F%2Fhipsters.tech%2Fmicrosservicos-na-monkey-exchange-hipsters-on-the-road-12%2F&t_e=Microsservi%C3%A7os%20na%20Monkey%20Exchange%20%E2%80%93%20Hipsters%20On%20The%20Road%20%2312&t_d=Microsservi%C3%A7os%20na%20Monkey%20Exchange%20-%20Hipsters%20On%20The%20Road%20%2312%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Microsservi%C3%A7os%20na%20Monkey%20Exchange%20%E2%80%93%20Hipsters%20On%20The%20Road%20%2312&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Ederaildo Fontes","comment":"Olá, show de bola esse Podcast.Eu tenho uma dúvida, trabalho com um sistema com uma arquitetura idêntica a de vocês. Só que uma coisa legal que vocês disseram que fazem é persistir a mensagem de out no banco antes de enviar ao RabbitMQ.Aqui não fazemos, mas passamos a considerar isso depois desse Podcast.Dúvida, para essa persistência da mensagem antes de enviar para o Rabbit vocês utilizam algo como \"MongoDB Outbound Channel Adapter\"  ou a anotação @GlobalChannelInterceptor com o método preSend?Mais uma vez parabéns pelo trabalho."},{"author":"Felipe Adorno","comment":"Fala cara, nós não chamamos direto o serviço que faz o enveio da mensagem pro RabbitMQ, nós temos na nossa classe AbstractEntity um método registerEvent que é mais ou menos algo assim (Utilizando spring não importa qual sua base de dados já que utiliza o próprio repository, aqui nós usamos em aplicações com mongo e com mysql):\tpublic T registerEvent(DomainEvent event) {\t\tBeanUtil.getBean(DomainEventsStorageRepository.class).save(new StoredDomainEvent(event));\t\tBeanUtil.getBean(ApplicationEventPublisher.class).publishEvent(event);\t\treturn (T) this;\t}Então ele sempre salva o evento antes de publicar ele e depois nós utilizamos a anotação @TransactionalEventListener do Spring e garantimos que só será enviado o evento se a transação com a base tenha sido comitada com sucesso."},{"author":"Ederaildo Fontes","comment":"Legal... em um primeiro momento nós optamos em publicar em um Logstash/Kibana, mas devido a limitação da Infra logo não se mostrou muito eficiente. Ficamos vendido na análise da orquestração.Com certeza salvar o evento em uma base é mais garantido.Obrigado pela resposta!"},{"author":"Pedro Kuntz","comment":"Muito bom esse Podcast. Uma duvida que ficou, vocês usavam o SQS no lugar do RabbitMQ, certo?! Minha duvida é se vcs usavam SNS + SQS para ter o resultado de fanout que vcs conseguem com RabbitMQ."},{"author":"Felipe Adorno","comment":"Oi Pedro, sim a gente usava o SNS + SQS."},{"author":"Clayton Passos","comment":"Que tal substituir o Kubernets por Istio.io e no lugar do Sleuth usar o Istio.io com jaegertracing.io? Já avaliou?"},{"author":"Felipe Adorno","comment":"No  momento oq temos funciona bem, vamos evoluir o produto agora e istio é uma coisa bem nova, vamos ver onde vai dar."},{"author":"DarkElf","comment":"Em relação a organização de pacotes, como vocês expõe as classes de domínios?"},{"author":"Felipe Adorno","comment":"Dentro dos pacotes as classes de domínios são publicas, assim como interfaces de seriços, mas entre microservices a gente duplica mesmo o código não temo compartilhamento."},{"author":"DarkElf","comment":"Entre microsserviços era o que eu imaginava mesmo.Vlw"},{"author":"Clayton Passos","comment":"Vc quer dizer compartilhar as classes de domínio entre projetos? Se for esse o caso acredito que ele não compartilha, neste ponto o código é duplicado mesmo."},{"author":"Clayton Passos","comment":"Sempre tive dúvidas quanto ao custo do SNS ou SQS se realmente seria mais barato que RabbitMQ ou Kafka.  Neste podcast agora tenho um relato real de que não é.Seguindo essa ideia de custo, vocês acreditam que EKS possa ser mais barato que criar máquinas e vocês mesmo cuidarem do Kubernets? Não fiz as contas, mas tendo a acreditar que sai mais caro."},{"author":"Felipe Adorno","comment":"Estamos começando a migrar para o EKS usando instâncias spot, ai acho q vai compensar."},{"author":"Clayton Passos","comment":"Nesse caso estamos falando de um hibrido? Os kubernets principais rodam em máquinas e os SPOTs seriam para a demanda e reservadas?"},{"author":"Clayton Passos","comment":"E se o microserviço de autenticação cair, ainda assim é possível usar a aplicação?"},{"author":"Felipe Adorno","comment":"Fala Clayton Passos  infelizmente como em todos os sistemas nós temos alguns pontos de falaha e esse é hoje o nosso maior ponto rs ... mas temos ele totalmente escalavél e bem monitorado para podermos agir antes de uma parada de todos os pods."}]}