{"title":"Gestão de Pessoas – Hipsters #157","releaseDate":"16/07/2019","tags":["carreira","Podcast"],"people":["Paulo Silveira","Joel Backschat","Stefanie Ferracciu","Luísa Aguirra","Alberto Souza"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=2481%20https%3A%2F%2Fhipsters.tech%2F%3Fp%3D2481&t_u=https%3A%2F%2Fhipsters.tech%2Fgestao-de-pessoas-hipsters-157%2F&t_e=Gest%C3%A3o%20de%20Pessoas%20%E2%80%93%20Hipsters%20%23157&t_d=Gest%C3%A3o%20de%20Pessoas%20-%20Hipsters%20%23157%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Gest%C3%A3o%20de%20Pessoas%20%E2%80%93%20Hipsters%20%23157&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Lucas Do Prado Polo","comment":"Misturaram carisma, timidez e outras coisas com introversão e extroversão. Não faz sentido, existem muitas pessoas extrovertidas que nunca serão líderes, e introvertidos que cativam individualmente as pessoas. Não faz sentido mesmo misturar os conceitos."},{"author":"Alberto Luiz Souza","comment":"Queria dizer que você está 110% certo :). Ser introvertido e extrovertido menos ou mais capaz de nada :)."},{"author":"Fernando Luiz Goulart","comment":"Meritocracia é de fato o maior desafio. Como também premiar as pessoas que não se vendem tão bem, mas entregam de forma sustentável (pensando em soluções que se sustentam no longo-prazo). Parabéns a todos !"},{"author":"Davis Peixoto","comment":"É relativamente fácil de usar métricas objetivas para avaliar a qualidade de código quando se usa analisadores estáticos de código como o SonarQube / CodeClimate / Scrutinizer... Apesar de ser olhando ao passado, mas ainda assim são métricas e objetivas, muito melhores do que linhas de código ou números de card entregues. OKR é legal, por se tratar de dar um objetivo futuro.E existe uma outra prática interessante que pode ser adaptada de outro contexto. Me refiro ao KPI de inovação da 3M. Lá, uma porcentagem substancial da receita tem que ser gerada a partir de produtos criados nos últimos anos - o que força a empresa a sempre buscar, criar e colocar no mercado novos produtos. Isso pode ser adaptado às empresas de tecnologia como uma parte do produto ou da stack de tecnologia precisa ter menos de X meses/anos. Isso força o uso de novas tecnologias, incentiva pesquisas, e pode eventualmente criar features ou cortar custos, mas mais importante, reforça a inovação, a experimentação e o aprendizado contínuo."},{"author":"Willi Santana","comment":"Meu muito foda!!!! É bem isso, hoje no mercado as pessoas não suportam ouvir a verdade... Concordo que o feedback é importante o problema é que na maioria das vezes isso não acontece e quando acontece é o FodeBack..."},{"author":"Welton Vaz de Souza","comment":"Parabéns a toda equipe do Hipsters por tratar um assunto espinhoso \n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n https://media0.giphy.com/me..."}]}