{"title":"Vida de Agência – Hipsters #02","releaseDate":"26/07/2016","tags":["business","carreira","Podcast"],"people":["Paulo Silveira","Anderson Leite","Fabricio Teixeira"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=263%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D263&t_u=https%3A%2F%2Fhipsters.tech%2Fvida-de-agencia-hipsters-02%2F&t_e=Vida%20de%20Ag%C3%AAncia%20%E2%80%93%20Hipsters%20%2302&t_d=Vida%20de%20Ag%C3%AAncia%20-%20Hipsters%20%2302%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Vida%20de%20Ag%C3%AAncia%20%E2%80%93%20Hipsters%20%2302&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Lucian Dalla Nora","comment":"Esse podcast mexeu comigo! Tenho uma irmã formada na área de jornalismo e comunicação e possui a própria agência. Já indiquei este podcast em específico pra ela, pois mesmo focando em tecnologia, acaba passando várias boas idéias. Além disso, tenho o perfil de estar sempre aprendendo e gostar de me meter em projetos que estimulem isso. Daqui a pouco este podcast é o estalo que faltava pra ela e eu fazermos uma grande parceria."},{"author":"Álvaro Júnior","comment":"Muito bom! Precisávamos de algo assim em Português."},{"author":"Giselly Rebouças","comment":"Melhor podcast sobre tecnologia ♥"},{"author":"Gabriel Darezzo","comment":"Trabalhei 1 ano em uma agencia de comunicação e foi muito bacana o aprendizado.Até hoje sinto falta da pegada de agencias já que curto muito publicidade e marketing.Podia rolar um Cross-Podcast com a galera do b9.Recomendo:http://www.b9.com.br/30731/..."},{"author":"Marcos De Moraes","comment":"Eu vim através do nerdcast, cheguei pela curiosidade e fiquei pelo alto nível das conversas."},{"author":"Yan de Carvalho","comment":"Descobri o podcast através do nerdcast e como estou mudando para a área de \"web design\", acabei gostando muito. Devo admitir que antes de fazer download, achei que o formato seria uma cópia de nerdcast e fico feliz em ter me enganado. O formato e o tempo estão muito bons. Parabéns e abraços. "},{"author":"Paulo Silveira","comment":"olha yan, até que eu gostaria de copiar o nerdcast, mas simplesmente é impossível :).estamos tentando dar uma cara própria e com o tempo acho que chegaremos la"},{"author":"JP","comment":"Excelente !!! Nomes gabaritados didática e descontração combinadas "},{"author":"Bruno Spd","comment":"Muito bom os dois podcast. Bem didático, provocações interessantes e questionamentos ricos. Parabéns."},{"author":"Paulo Silveira","comment":"Valeu Bruno! Acreditamos que ainda dê para melhorar bastante e encontrar um formato mais interessante, mas sempre bom saber que estamos no caminho!"},{"author":"André Luis Gomes","comment":"Gostei do Episódio... parabéns."},{"author":"Lucian Dalla Nora","comment":"Esse podcast mexeu comigo! Tenho uma irmã formada na área de jornalismo e comunicação e possui a própria agência. Já indiquei este podcast em específico pra ela, pois mesmo focando em tecnologia, acaba passando várias boas idéias. Além disso, tenho o perfil de estar sempre aprendendo e gostar de me meter em projetos que estimulem isso. Daqui a pouco este podcast é o estalo que faltava pra ela e eu fazermos uma grande parceria."},{"author":"anderson_leite","comment":"Muito Legal Lucian! Go for it! /o/"},{"author":"Paulo Silveira","comment":"oi lucian! que depoimento bacana. incentiva a gente a seguir em frente!"},{"author":"Leandro Takeda","comment":"Show!"},{"author":"Fabiano Góes","comment":"Pessoal esses podcast estão sensacionais, parabéns pela iniciativa #Hipister+1"},{"author":"Oroz","comment":"zip, plis. proxy m ata"},{"author":"Paulo Silveira","comment":"estamos providenciando oroz!! a sua proxy nao deixa mp3, isso?"},{"author":"neymarbrazza","comment":"na empreza eh bloquiado so baxa mp3 dentro di zip. dereto naum vai.,"},{"author":"Diego Brocanelli","comment":"Excelente episódio, o podcast está com uma  qualidade incrível.Parabéns pela escolha do tema, e realmente trabalhar em agência tem suas \"aventuras\"  um tanto quanto caóticas hahahahah, quando bate a hora do pastel é um Deus nos acuda kkkkk, porem é um dos poucos lugares que a experimentação de novas tecnologias é melhor aceita, pois há projetos que ficam no ar por 1 ou 2 meses, o que possibilita esta experiência.Parabéns a todos os envolvidos do podcast e no episódio.Deixo como dica para um episódio, tratar sobre a nova modinha do mercado o \"Full stack developer\" quais os benefícios e os malefícios.Parabéns pelo episódio!!!"},{"author":"Paulo Silveira","comment":"Oi Diego! Boa ideia. Excelente pauta para um episódio! E valeu o apoio"},{"author":"Júlia Yamamoto","comment":"Curtindo muito o podcast de vocês! Parabéns! Entrei nesse mundo de agência + tecnologia e estou achando muito legal. Bem o que vocês disseram mesmo, em 4 meses aqui peguei vários projetos diferentes que me exigiram várias competências diferentes. O bacana é que dá pra aprender muitas coisas legais e evoluir muito como um profissional mais aberto a novas tecnologias, técnicas e abordagens.Não sei se esse seria o espaço para sugestões, mas acredito que um tema interessante e que esteja crescendo cada vez mais agora nessa área de tecnologia é o uso de Realidade virtual (semana passada teve o BRVR que foi um evento bacana de VR aqui no Brasil, enfim... bastante coisa legal e bastante dev brasileiro se movimentando em direção á essa tecnologia). Seria legal chamarem alguns nomes fortes que estão surgindo e debater um pouco sobre essa área. (E esclarecer para as pessoas que Realidade virtual e Realidade aumentada são duas coisas diferentes, que o que tem gente confundindo...)"},{"author":"Paulo Silveira","comment":"Oi Julia! Obrigado pela sugestão. E teremos surpresas pra voce em algum dos proximos episódios :)."},{"author":"thiagokazu","comment":"Esses caras são feras demais! Grande inspiração! Parabéns pelo podcast =)"},{"author":"Lucas Trevisan","comment":"melhor podcast do brasil! :D"},{"author":"Victor Ferreira","comment":"Tinha como ser mais hipster?"},{"author":"Paulo Silveira","comment":"quem trabalha em agência moderinha é por default hipster :)"}]}