{"title":"Progressive Web Apps – Hipsters #03","releaseDate":"02/08/2016","tags":["front-end","mobile","Podcast","web"],"people":["Paulo Silveira","Sérgio Lopes","Mauricio ‘Balboa’ Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=271%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D271&t_u=https%3A%2F%2Fhipsters.tech%2Fprogressive-web-apps-hipsters-03%2F&t_e=Progressive%20Web%20Apps%20%E2%80%93%20Hipsters%20%2303&t_d=Progressive%20Web%20Apps%20-%20Hipsters%20%2303%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Progressive%20Web%20Apps%20%E2%80%93%20Hipsters%20%2303&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Matteus Barbosa","comment":"Em junho entreguei meu TCC: um app em cordova que criei com Intel XDK, pela vantagem de usar linguagem web pra gerar apps android, ios, windows phone... Se soubesse da PWA, teria salvo uma baba de tempo e ficaria bem mais completo."},{"author":"Corvo","comment":"Ótimo podcastcomecei a me aprofundar em PWAs e já consegui fazer dois projetinhos simples, à quem se interessar:https://balancadigital.idei...https://whatsnumber.ideias.pw"},{"author":"Everton J. Carpes","comment":"Muito bacana o podcast. Queria reforçar 2 vantagens que vejo nessa abordagem (a qual aqui na Nutrebem já usamos desde 2014):  1. Não temos que nos dividir em time mobile e app, aqui somos as mesmas pessoas trabalhando com web e com mobile, mantendo a equipe pequena e mais simples de gerenciar projetos, com infra tecnica bem comum entre ambas as soluções: mesmo processo de deploy, mesma infra, mesmo processo de integração, etc  2. Em casos onde é necessário acesso nativo a algum dispositivo (no nosso caso é acesso a impressora), você pode desenvolver um híbrido, onde o código nativo é exposto para o JS (qqr browser embedável vai te dar recurso pra isso) e de resto a APP apenas abre um webview dentro dela mesmo; Usamos esse caso aqui em nossos kiosks, o que reforça meu primeiro ponto: hoje temos uma mesma equipe com skills de web mantendo kiosks que funcionam em mais de uma plataforma e com deploy tão simples quanto qqr site do mercado"},{"author":"Pedro Manuel Torres","comment":"Excelente episódio, segue minha home screen. \n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n\n "},{"author":"Israel Oliveira","comment":"#homescreen limpa, com apenas os apps mais importantes. \n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n  \n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n"},{"author":"Lidy Monteiro","comment":"Quais materiais vocês recomendam pra quem quer aprender a criar progressive web apps?considerando que tem que saber o básico html, css, js."},{"author":"Lucas Duarte","comment":"também quero saber!"},{"author":"Bruno Oliveira de Alcântara","comment":"Mais um ótimo podcast!"},{"author":"Fausto Blanco","comment":"A minha, só o basico\n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n"},{"author":"matheus","comment":"Um motivo para a Apple não apoiar os Progressive Web Apps é que ele perde uma grande fonte de renda que é a Loja de Aplicativos.Se meu App não precisa estar em uma loja para ser utilizado, não tem como Apple controlar e ganhar com isso.Para a Google isso não é um problema, porque o foco dela não é vender mais, mas sim ter mais usuários na sua plataforma para ganhar com anúncios.O que pensam disso?"},{"author":"Hector Cardoso","comment":"Olha a home aí gente \n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n "},{"author":"Felipe Rodrigues","comment":"Olha o print \n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n \n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n "},{"author":"Brendo Marinho","comment":"Olha a home aí gente\n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n "},{"author":"Gustavo Paiva","comment":"Show!"},{"author":"Gabriel Ariza","comment":"Ata, esqueci de um de detalhe. Parabéns ao podcast maravilhoso, cheio de conteúdo usefull !"},{"author":"Gabriel Ariza","comment":"Qual a linguagem utilizada no hipster tech ?Cara que agunia de não ter barra de pesquisa, po coloca no github o projeto que eu faço a melhor barra de pesquisa o possível."},{"author":"Thiago Marinho","comment":"verdae precisa! hehe"},{"author":"Murilo","comment":"Interessantíssimo essas progressive web apps, qm sabe se torne um padrão no futuro. Espero um curso na Alura!"},{"author":"Tarantini Pereira","comment":"Messenger = sms \n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\nPodcast super show!!!"},{"author":"Fábio Thomaz","comment":"Vejam, este é o Telegram sendo usado como app, mas rodando web pelo endereço que citei no post anterior"},{"author":"Fábio Thomaz","comment":"Já comentaram sobre o Telegram aqui, mas não sei se alguém já usou ele web no Smartphone:web.telegram.orgAbrindo no Chrome, vc pode adicionar ele na tela principal e funciona como uma app mas sem precisar instalar."},{"author":"Gustavo Paiva","comment":"Sim, funciona bem, inclusive no iOS 10"},{"author":"matheus","comment":"Obrigado pelo podcast! Vocês estão de parabéns mesmo.O Audio é de primeira qualidade e o tempo dos episódios está perfeito, mais tempo do que isso penso ser perda de tempo.Vocês conseguem condensar bem o conteúdo e instigar a pesquisar mais sobre o tema, tanto que fui testar o site do Twitter e a primeira mensagem que apareceu foi a sugestão para adicionar à tela inicial."},{"author":"Fabio Souza","comment":"Muito bom o podcast, aproveito para sugerir aí uma web app da Alura, tem hora que o jeito é estudar no mobile mesmo."},{"author":"Percival Adriano","comment":"Depois de ouvir este podcast fiquei mais confiante no desenvolvimento da página de minha empresa.Fiz com Polymer seguindo o conceito Progressive Web App. Quem quiser conferir o resultado segue o link https://www.crius.com.br, segue também minha homescreen : )"},{"author":"Daniel Lucena","comment":"Tai! "},{"author":"Daniel Filho","comment":"¯\\_(ツ)_/¯ "},{"author":"Daniel Filho","comment":"FTR, não tenho fb nem fb messenger instalado também. e cada vez mais penso sobre mudar pra android por causa do ciclo cagado de atualizações do Safari.parece IE antigamente, que só atualizava com updates do sistema operacional. lixo isso. mas aí penso em todo dinheiro que gastei comprando apps pro iOS, e que quase não uso apps do Google (só maps e translate). tá difícil ser eu, hahahaha"},{"author":"Paulo Silveira","comment":"bem organizado mesmo. mas ainda acho tao estranha essa galera com telegram como app principal..."},{"author":"Fábio Thomaz","comment":"Rsrs+1"},{"author":"Diego Mello","comment":"Uma tentativa de corrigir a fragmentação dos webapps no Android é o Projeto Crosswalk.É um must-have em projetos Ionic (acho que Phonegap também).Ele instala uma webview baseada no Chromium p/ unificar a experiência.O problema é que ele aumenta 15~20MB no tamanho final do app =/"},{"author":"Diego Mello","comment":"Excelente programa!Li em algum lugar que o Facebook está fazendo alguns testes com React e React Native.Se eu não me engano, os comentários da web já estão usando React e toda a aba de eventos do app está em React Native."},{"author":"Marcelo Aragão","comment":"Ta aí. Com atraso."},{"author":"Douglas Junior","comment":"Posta mais, pf! 2016 D.C., eis que surge um podcast útil, sem encher linguiça e sem viagens intra estrelares.Falando do assunto, como desenvolvedor de app nativos e híbridos sou da opinião que isso vai demorar muito para acontecer, principalmente para app comerciais. Os browsers ainda pecam muito no requisito de validação de formulários, integração com o softkeyboard, problemas de locale e language, formatação de números decimais baseados em idiomas, etc.Desenvolver com Ionic já é um sofrimento enorme, mesmo com todo o suporte de plugins nativos oferecidos pelo cordova ainda tem muitos problemas, como o fato de não ser possível navegar com o foco entre os campos do formulário com o teclado do iOS. Enfim, acho que ainda vai tempo."},{"author":"Diego Mello","comment":"Também sou dev Ionic.Na minha opinião, é um excelente framework pra fazer coisas simples e rápidas.Se for necessário implementar QUALQUER coisa mais elaborada, FUDEU!Hahahahaha."},{"author":"Oissat","comment":"Acho paia, pq o Firefox OS era justamente essa ideia enraizada no sistema operacional da Mozilla: de vc usar apps que fossem na web, e que depois pudesse baixar como um favoritos ou não, podendo usar off line, e mesmo assim não vingou. Tudo bem que o Firefox era muito html5 tosco, e que não houve impacto de divulgação e desenvolvimento, mas era a mesma ideia do Steve, repaginada.  Humanidade tem que sofrer baixando apps msm... kkkkkkk... 😅"},{"author":"Paulo Silveira","comment":"É uma opinião válida. Mas eu chuto que vai mais pra web que pro nativo. Como ocorreu nos computadores: usamos cem vezes mais o browser do que aplicações nativas... Mas claro, posso morder a língua :)"},{"author":"Oissat","comment":"Sim sim, você não vai morder a língua! Olhe pro MSN Messenger hoje, kkk parece até brega um dia termos instalado aquilo! Tipo aquelas fotos que vc pega de você há uns 10 anos atrás! Mas a gente tem que bater a cara no muro,  aprender pra depois desconfiar que existe outros caminhos, e o progressive web apps não foge disso!"},{"author":"Victor Milani","comment":"Telegram como principal comunicador!"},{"author":"Luis Sérgio","comment":"Requisitar que o usuário instale o Chrome no IOS não ajudaria a resolver o problema do Safari não suportar Service Workers?"},{"author":"Sérgio Lopes","comment":"Não resolve. Chrome no iOS é um Safari na verdade com visual de Chrome. Então não tem Service Workers. Apple não permite outros browsers no iOS :("},{"author":"Márcio Sancho","comment":"É esse jeito \"Coreia do Norte\" de ser que não me atrai nos produtos da Apple."},{"author":"Daniel Rigoni","comment":"Parabens pelo podcast, já estou aguardando um curso sobre mais detalhes e utilização no Alura ;)"},{"author":"stefania","comment":"Adorei!!!! Muito bom!"},{"author":"mfdavid","comment":"Muito bom! Parabéns =)"},{"author":"KlarkC","comment":"Poxa, um cast desses e ninguém fala sobre o polymer-project.org, x-tag, bosonic, skatejs e a especificação dos web-components?"},{"author":"Sérgio Lopes","comment":"Web components tá no radar pra um próximo episódio! "},{"author":"KlarkC","comment":"Boa! =D"},{"author":"José Alves","comment":"O meu desktop deve ser o mais bizarro ever sem snap, sem Facebook, sem instagram. "},{"author":"Luis Sérgio","comment":"Mas vai dizer que vc faz ligação e manda SMS todo dia? O telefone é a primeira coisa que vai pra segunda página quando pego um novo celular. E só não desinstalo a app de SMS pq não dá."},{"author":"José Alves","comment":"Nada. A última vez que usei o \"telefone\" mesmo foi semana passada, para algo específico ainda."},{"author":"Sérgio Lopes","comment":"Isso é de boa. Bizarro é ter o Google japa :p"},{"author":"José Alves","comment":"hahahaha...na verdade é entrada de teclado em japonês do Google."},{"author":"Maurício Fedatto","comment":"Totalmente excelente. Todas as minhas ponderações foram abordadas no cast. A Apple vende dispositivo e quer após, o Google vende ads e quer dados e acessos. WebApp não aprece em loja, por enquanto. Muito bom mesmo. Mandando minha home screen também."},{"author":"Dyego Rodrigo","comment":"Mais um podcast pra lista =P muito bom, parabéns! :)"},{"author":"Paulo Silveira","comment":"Valeu Dyego! E terça feira já tem mais :)"},{"author":"Alessandra Luz","comment":"Parabéns pelo ótimo conteúdo!! Eu não uso o APP do Facebook e ta ai os que mais utilizo diariamente:"},{"author":"Lucas Marciano","comment":"O Flipkart não é responsável."},{"author":"Sérgio Lopes","comment":"Pois é. E no começo só funcionava no Chrome tbm. Eles tão melhorando com o tempo... Mas por enquanto eles tem um site desktop e outro mobile (PWA)"},{"author":"Lucas Marciano","comment":"Mas vi que o template deles é material design puro, muito show. Só tem esse \"probleminha\" da responsividade."},{"author":"Raphael Lacerda","comment":"Agora vai! E quando o screen shot gera um print > que 2mb! Hahaha! Não tem uma progressive webapp já para reduzir o tamanho? Ótimo cast!"},{"author":"Sérgio Lopes","comment":"Tem! https://smaller-pictures.ap..."},{"author":"Raphael Lacerda","comment":"Melhor podcast até agora! Welcome to the future... go back to the Web! "},{"author":"Luiz Gustavo","comment":"Mas bá aja app haha"},{"author":"cmilfont","comment":"Primeira tela"},{"author":"Marcos Antônio Dos Santos","comment":"Muito bacana o podcast, curti demais.. Ajudou muito abrindo meus pensamentos mais ainda..Obrigado Alura. ;)"},{"author":"Fernando Boaglio","comment":"Muito bom podcast,  parabéns. Os apps mais usados ficam na home. =) "},{"author":"Flavio Camello","comment":"Parabéns! Os Podcasts estão ótimos, o entrevistador manda muito bem e estou no aguardo dos próximos. Valeu."},{"author":"Paulo Silveira","comment":"fico grato pelo elogio flavio!!"},{"author":"frankyston","comment":"Muito bom o padcast. Minha screen foi realmente como foi discutido no podcast heheheheh"},{"author":"Douglas Neves","comment":"Parabéns pelo conteúdo!!! Segue minha screen, prefiro organizar em pastas ;)"},{"author":"Leonardo","comment":"Ótimo conteúdo. Mas tem um fundo musical a partir de 9:25 totalmente irritante (ruído)."},{"author":"Cássio Almeida","comment":"PWA + Beacons = <3Eis a solução para o usuário \"encontrar\" o app. rs!Excelente cast!"},{"author":"Sérgio Lopes","comment":"Bem lembrado! To torcendo tbm pros beacons decolarem"},{"author":"Cássio Almeida","comment":"Estou muito confiante que irá decolar, Google vem fazendo um trabalho legal em cima disso.EUA já temos até uns cases bem interessantes."},{"author":"Mauricio Mutte","comment":"Eu coloco tudo na home screen pois não gosto de ficar abrindo o menu :D"},{"author":"Rafael Silva","comment":"Show de bola."},{"author":"Marcelino","comment":"Tenho o Basecamp 3 que usa o Turbolinks 5 e um bom esse exemplo, que apesar ter der apps nativas o core e todo na web."},{"author":"Sérgio Lopes","comment":"Acho que sou o único que não deixa o ícone do Telefone no dock fixo debaixo da tela. Aliás, o Tel disparado é a \"App\" que menos uso :-D"},{"author":"Cássio","comment":"É aí que você se engana! :p(pra abrir o discador eu uso ~dois toques~ na tela)"},{"author":"Carlos Fagiani Junior","comment":"Não caberia no cast falar sobre o FirefoxOS? Que eu saiba ele é todo voltado para webApps.Essa eh minha home screen do iPhone, 10 dos 18 apps da pasta extra eu desinstalaria se pôde-se. Mas acho q se eu tivesse mais memória com certeza teria muito mais aplicativos instalados, consumir somente um json pelo App ainda acho bem melhor do q consumir json, html, js, css e etc a cada refresh da página, talvez quando o cacheamento das páginas como se fossem uma aplicação começar a acontecer com certeza mudo a opinião..."},{"author":"Sérgio Lopes","comment":"Saudoso Firefox OS! Infelizmente foi descontinuado pela Mozilla :(Mas tem razão, várias das ideias de PWAs vieram de lá!"},{"author":"Douglas","comment":"Pra quem como eu ficou curioso sobre mais exemplos reais de Progressive Web Apps, vejam o link abaixo que tem desde afinadores de violão até gerenciadores de despesas :https://pwa.rocksTá muito maneiro o Podcast pessoal :) "},{"author":"Inaldo Brandão","comment":"Parabéns pelos podcasts, depois de uma maratona, ouvi os 3, segue aí minha homescreen, hehe !"},{"author":"Daniel, o Conte - Caps","comment":"maratona de 3 podcasts? hehe isso eu chamo de uma tarde tranquila huhue"},{"author":"Maurício Linhares","comment":"O meu tá até organizadinho."},{"author":"Nuno","comment":"Adicionando um link para complementarhttp://devcommunitycast.com..."},{"author":"Rubinho_sjr","comment":"Minha Home é bem limpa kk"},{"author":"Paulo Silveira","comment":"incrível!"},{"author":"Nuno","comment":"Olá pessoal,Muito bom o programa."},{"author":"Rubinho_sjr","comment":"Muito bom  tema, comecei a desenvolver apps recentemente e isso de pra cada coisa criar um app tava me incomodando bastante, não parece a forma certa de se desenvolver para certos casos.Vou estudar mais isso."},{"author":"Daniel, o Conte - Caps","comment":"Só um ponto que mesmo sem o App da TAM tu acessa o serviço de mídia por um link no navegador também."},{"author":"Maurício Linhares","comment":"Não abre os vídeos :("},{"author":"Daniel, o Conte - Caps","comment":"a mas dai é detalhe heheh"},{"author":"Daniel, o Conte - Caps","comment":"\n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n￼Com que uso diariamente mesmo. "},{"author":"Maurício Linhares","comment":"nubank tá em todas :O"},{"author":"Daniel, o Conte - Caps","comment":"Temas muito relevantes, estou gostando, principalmente do momento onde escovam os bits."},{"author":"Paulo Silveira","comment":"Valeu Daniel! A gente deixa a escovação de bits mais pro final, para todo mundo poder aproveitar! Mas to vendo que a galera gosta mesmo do hardcore."},{"author":"Daniel, o Conte - Caps","comment":"para preencher o espaço que o Grok deixou nos nossos corações Feeds"},{"author":"Raphael Lacerda","comment":"Só de pensar que um dos argumentos laaaaaaaa atrás para não se fazer o podcast era justamente o Grok!! hahaha"},{"author":"Matheus Montenegro","comment":"Ótimo podcast. Estão de parabéns. O Paulo consegue arrancar umas dúvidas que a gente vai pensando aqui e acaba sendo uma conversa bem bacana de se ouvir. A minha homescreen é bem clean. "},{"author":"William R. Fernandes","comment":"Ótimo podcast! Ajudou nas minhas ideias para os novos projetos hehe! Obrigado!"},{"author":"Thiago Miro","comment":"Eu uso todos os meus Apps organizados na home, alguns em grupos."},{"author":"Paulo Silveira","comment":"não vi a app do jovemnerd :)"},{"author":"Thiago Miro","comment":"Quem já usa o Pocketcasts o considera insuperável. =D"},{"author":"Paulo Silveira","comment":"APPOCALYPSE. Como prometido, eis minha home screen. As apps que eu uso muito são instagram e whatsapp. As outras nem tanto. Das outras páginas então, quase nunca...."},{"author":"Matheus Montenegro","comment":"Opa, acho que vi um app ali de shopping hehee"}]}