{"title":"Histórias do Cloud – Hipsters #04","releaseDate":"09/08/2016","tags":["devops","infra","infraestrutura","Podcast","programação"],"people":["Paulo Silveira","Rodrigo Turini","Roberto","Sim"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=307%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D307&t_u=https%3A%2F%2Fhipsters.tech%2Fhistorias-do-cloud-hipsters-04%2F&t_e=Hist%C3%B3rias%20do%20Cloud%20%E2%80%93%20Hipsters%20%2304&t_d=Hist%C3%B3rias%20do%20Cloud%20-%20Hipsters%20%2304%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Hist%C3%B3rias%20do%20Cloud%20%E2%80%93%20Hipsters%20%2304&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Hector Cardoso","comment":"tiraram o vídeo do Roberto Marin do ar :("},{"author":"Eduardo Gonçalves","comment":"o cara falou $2?"},{"author":"Roberto Marin","comment":"Olá Eduardo Gonçalves, em que momento do podcast? Abraços"},{"author":"Marcio Mansur","comment":"Olá a todos. Sei que posso estar \"atrasado\", mas gostaria de apresentar o ensejo e perguntar se algum de vocês possui o conhecimento de algum treinamento, online ou presencial, pago ou gratuito, para AWS e ambientes cloud. Estou utilizando a Udemy, porém gostaria de um treinamento mais extensivo, como já vi em algumas ocasiões. Muito obrigado!"},{"author":"Roberto Marin","comment":"Olá Marcio Mansur, um bom local para se aprender é com os Talks oficiais da AWS:https://aws.amazon.com/abou...Muitos estão disponíveis também no youtube:\n\n\nReproduzir\n\n\n Ocultar\n\n\n\nAbraços,"},{"author":"Douglas Gaspar Alves","comment":"A minha tela é simples e pura e tenho um atalho com os principais app:  \n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n  \n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n"},{"author":"Hector Cardoso","comment":"só falta ter o link do vídeo. Roberto Marin."},{"author":"Roberto Marin","comment":"Bem lembrado Hector Cardoso, aqui vai:\n\n\nReproduzir\n\n\n Ocultar\n\n\n\n\n"},{"author":"Hector Cardoso","comment":"kkkkkkkkkkkkkkkkkkkkkkkkkkkkkk.. vou fazer isso pra minha empresa tbm kk."},{"author":"Roberto Marin","comment":"Melhor bagulho! :D Recomendo! hahahaha"},{"author":"SonySantos","comment":"Eu sinto falta de links para os sites das empresas representadas pelos convidados, como o Viva Real, o Nubank, etc."},{"author":"Fred Oliveira","comment":"Excelente, já estou viciando no podcast."},{"author":"Welington Oliveira da Silva","comment":"Queria saber, na boa mesmo, por que nenhuma vez vocês citaram o Azure como player de nuvem? No que a Microsoft está errando na divulgação? Não conheço muito os outros players mas o Azure é tão ruim assim?"},{"author":"Roberto Marin","comment":"Olá Welington Oliveira da Silva, isso provavelmente foi culpa minha. A Azure vem crescendo realmente, e tem se posicionado bem, tanto ela como o Google Cloud. Não falamos sobre Azure ou Google, pois falamos bastante da minha experiência em particular. Outro motivo é este statement da Gartner, \"In 2015 AWS delivers over 10X the utilized cloud capacity of its largest 14 competitors combined\", que você encontra no terceiro slide desta palestra: http://slides.com/robertoma...Abraços!"},{"author":"luan fonseca","comment":"Por mais que eu adore o formato de podcast, as vezes eu prefiro vídeo, mesmo que seja só hangout sem edição de nada. Particularmente eu consigo prender mais minha atenção, no podcast tirando os casos de estar no busão ou deitado, qualquer notificação tira meu foco haha"},{"author":"Paulo Silveira","comment":"Luan, é complicado mesmo. Tem midia que funciona melhor pra cada pessoa. Consideramos as opções de mostrar tambem no soundcloud, gravar o video no googlehangouts, etc, mas acabamos seguindo as dicas de quem manja de podcast. vamos ver o que teremos no futuro!"},{"author":"Delliriun","comment":"Só pra mim?"},{"author":"Paulo Silveira","comment":"resolvido!"},{"author":"Paulo Silveira","comment":"ops! css errado. vamos corrigir amanha :)."},{"author":"Claudenir Freitas","comment":"mais uma vez muito manero o podcast, top!Sobre PAAS, de uns tempos pra cá venho brincando com o Openshift da Red Hat, estou gostando bastante, mas sigo na conta free... Alguem fez/faz uso da conta paga?"},{"author":"Paulo Silveira","comment":"Nunca usei em produção, mas conheço muita gente que está estudando. É realmente uma das grandes opções"},{"author":"Leandro Martins","comment":"Muito bom essa proximidade que estamos tendo com grandes empresas nesses cases fantásticos. Estou bem feliz com o Hipsters, ainda mais por achar a periodicidade do NerdTech muito baixa. Os temas estão animais. Parabéns!"},{"author":"Paulo Silveira","comment":"Valeu Leandro. Era exatamente esse o objetivo. Ter mais episódios que o NerdTech e poder ser mais técnico. Mas o nerdtech continua desbocado e com temas mais pop!"},{"author":"André Luis Gomes","comment":"Muito bom"},{"author":"Carlos Carvalho","comment":"Eu vivo em um cenário onde os meus clientes preferem servidores dedicados, mesmo que isso custe mais caro. Conseguir com que o cliente mude de ideia e faça uma migração é sempre tenso.No primeiro cliente \"complicado\" de aceitar a mudança que aceitou mudar eu sofri desgraçadamente com acessos de spam na aws. No log eram infinitos acessos de ips aleatórios, tentando acessar determinadas urls que não existiam.Até conseguir contornar o problema, com alarmes, iptables e afins, foram muitas noites sem dormir.Ps: ainda tive que pagar a primeira fatura de mais de 400 obamas."},{"author":"Paulo Silveira","comment":"oi Carlos! Gostei do seu depoimento, exibe uma realidade: a migração e a mudança são barreiras enormes. Nem posso culpá-los, ainda mais se tiveram essa experiência dos ips querendo fazer de tudo pra achar brecha nas máquinas por lá"},{"author":"Carlos Carvalho","comment":"Pois é, mudança é complicada mesmo. E querendo ou não, a utilização de serviços nuvem começou a cair no gosto das médias, pequenas empresas não faz tanto tempo assim. Já as startups meio que nasceram nesse universo. Mesmo que em alguns casos os clientes já estejam familiarizados com virtualização alguns acham estranho. Mas enfim, parabéns pela sequencia de casts, estou ansioso pelo próximo!"},{"author":"Tiago Pereira","comment":"Sensacional o cast. Parabéns!"},{"author":"Alan Oliveira","comment":"Ouvi pela manhã no aplicativo e esqueci de vir comentar kkkk!Ótimo episódio, mas tenho uma dúvida: o servidor Cloud afeta/muda algo no trabalho dos Devs ?Quem me ajuda nessa?Continuem com o projeto!!"},{"author":"Paulo Silveira","comment":"Alan, se você for fazer a migração como o Roberto Marin descreveu no primeiro cenário, de transformar cada servidor tradicional em uma máquina no cloud, pouco muda. Já se você for mudar a arquitetura geral, colocar os auto balancers, etc, vai ter trabalho e muita coisa vai mudar, mas talvez seja o que está faltando em um projeto. Até porque você provavelmente vai usar ferramentas devops (hipster!) para automatizar essas tarefas, como chef/puppet entre outras estratégias."},{"author":"Fernando Quadro","comment":"Paulo, parabéns pelos podcasts, está um melhor que o outro e os temas estão incríveis! Abraço!"},{"author":"Paulo Silveira","comment":"Valeu Fernando. Isso dá gás pra gente!"},{"author":"tapajos","comment":"Paulo, parabéns pelo podcast, está cada vez melhor.Vocês comentaram sobre o medo de apagarem a conta. Recentemente passei por isso por um erro da Amazon e eles foram capazes de recuperar minha conta por completo, inclusive com dados no S3 e Glacier.Claro que todo mundo deve ter backup mas isso pode servir para deixar uns um pouco mais tranquilo."},{"author":"Paulo Silveira","comment":"Valeu Tapajos! E bom saber que eles mantem a conta por um tempinho. Claro que imaginava, mas é aquele tipo de coisa que você não paga pra ver :)."},{"author":"Valdir Viana","comment":"Parabéns excelente podcast. Excelente tema escolhido."},{"author":"Danilo Braga","comment":"Olá Pessoal, bom dia! Primeiramente excelente podcast! Gostaria de compartilhar uma experiência similar a relatada no programa, com relação a deixar máquinas ligadas na Amazon AWS. Também estava fazendo um treinamento, utilizando o free tier que a amazon oferece. No meu caso, deixei um server ligado apenas com o tomcat em pé durante 30 dias, sem nenhuma aplicação. Resultado - $1500.00 doletas de cobrança e 14TB de transferência de dados.Entrei em contato, e após algumas conversas, pois nem eles sabiam o motivo de uma transferência de dados tão grande, a Amazon cancelou minha cobrança.Foram três dias até minha cobrança ser cancelada e três LONGAS noites sem dormir, pensando na fatura do cartão ...Obrigado e parabéns pelo cast !!"},{"author":"Paulo Silveira","comment":"Eu também não teria dormido Danilo! Mas fica a curiosidade: o que foi que trafegou 14GB em um tomcat pelado!"},{"author":"Danilo Braga","comment":"Pois é Paulo ... foram 14TB (Terabytes) de tráfego de uma página inicial do Tomcat !!Mas, assim como foi falado neste programa, também foi erro meu de não ter definido os alarmes. Valeu o aprendizado!"},{"author":"Maurício Fedatto","comment":"Parabéns novamente pelas excelentes ponderações. Muito bom mesmo."},{"author":"Paulo Silveira","comment":"valeu Maurício! acho que as histórias do Marin são muito boas e mostram uma realidade"}]}