{"title":"Agilidade – Hipsters #05","releaseDate":"16/08/2016","tags":["agilidade","Podcast","startup"],"people":["Paulo Silveira","Ceci Fernandes","Victor Hugo Germano","Rafael Jaguá"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=315%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D315&t_u=https%3A%2F%2Fhipsters.tech%2Fagilidade-hipsters-05%2F&t_e=Agilidade%20%E2%80%93%20Hipsters%20%2305&t_d=Agilidade%20-%20Hipsters%20%2305%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Agilidade%20%E2%80%93%20Hipsters%20%2305&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Ricardo Henrique de Freitas","comment":"Top"},{"author":"Frederico Aranha","comment":"Link quebrado galera: https://www.cs.umd.edu/clas..."},{"author":"Antonio Carlos L. Oliveira","comment":"Da hora meu, show de bola. A partir de hoje vou sempre acompanhar os pods."},{"author":"Jader Virtuoso","comment":"Qual é mesmo o material de 6 páginas que a Ceci Fernandes disse que podcast mesmo?"},{"author":"RNHack","comment":"Pausa e volta, ouve de novo."},{"author":"Jader Virtuoso","comment":"Ficou sentida né coleguinha? ha ha ha"},{"author":"ironside","comment":"Olá Pessoal !algumas considerações a serem feitas para melhorar o podcast.1) Precisam falar mais devagar. vem um bombardeiro de informações e não se entende aonde quer chegar.2) Pelo fato de falarem rápido, falam muito e não dizem nada. não se chega a conclusão nenhuma. exemplo: falaram da sala de guerra, qual a conclusão disso, bom, ruim, há outros meios ?3) Deveriam estruturar melhor a entrevista e o assunto.Agora minha pergunta: O Gerenciamento de Projetos na área desenvolvimento de software está ultrapassado, é isso ?mas enfim, cuidado com essas modinhas. :)"},{"author":"Jader Virtuoso","comment":"Pausa e volta, ouve de novo."},{"author":"Fred Oliveira","comment":"Infelizmente a mente de muitas pessoas estão focadas apenas em briga de torcidas, poderiam estudar mais.Excelente podcast, o segundo que escuto apenas hoje."},{"author":"heitorspedroso","comment":"cada vez melhor, excelentes convidados."},{"author":"Wellington Aurélio","comment":"Vim escutar por indicação estes podcasts e acabei por escutar todos que já foram lançados no mesmo dia kkRealmente muito bom ouvir papo de programador, parabéns pelo trabalho!"},{"author":"Paulo Silveira","comment":"binge listening! :). valeu wellington"},{"author":"Carlos Carvalho","comment":"Ahhh, esse papo de ser mainstream, tipo, conheço uma galerinha que acha que eu sou hipster porque vivo falando de scrum... O mais bacana é que vivo usando isso, e eles mal se dão conta. Parabéns pelo conteúdo!!"},{"author":"kennedy Pereira","comment":"Muito bom o conteúdo de +1  Showww !!!!!!"},{"author":"JP","comment":"Simplesmente EXCELENTE! Desde que comecei a ter o hábito de ouvir podcast, esperava encontrar um feito por desenvolvedores para desenvolvedores"},{"author":"Luiz Eduardo Favalessa","comment":"Excelente podcast. Entrei no mercado agora e esse podcast foi excelente para me mostrar as direções que devo seguir (a empresa está começando a praticar desenvolvimento ágil).Aproveitando a oportunidade, tenho muita vontade de ouvir um podcast no estilo daquele do Nubank com com a galera do iFood. Será que rola?Faz um sobre tecnologias como ionic e firebase!!!Parabéns pelo excelente trabalho. Ansioso pelo próximo. Abraço.  "},{"author":"Eduardo Medeiros Branquinho","comment":"Show! Bom demais, sô!"},{"author":"Paulo Silveira","comment":"copiando o sotaque do Rafa Jagua!"},{"author":"Luiz Silva","comment":"Tava tentando acompanhar mais é muita informação e eles falam rápido  hahahahaha"},{"author":"Paulo Silveira","comment":"Poxa Luiz, e a gente tentou ir devagar :(. Tente ir ate os 10 minutos que tem uma explicacao mais devagar sobre os principios ágeis."},{"author":"Ítalo  Mendonça","comment":"Paulo Silveira O link que a Ceci citou com as siglas do mundo ágil é esse:http://blog.taller.net.br/g..."},{"author":"Paulo Silveira","comment":"adicionado! valeu Ítalo"},{"author":"Ítalo  Mendonça","comment":"Boa, Paulo Silveira! Que venham outros programas sobre o tema. Sucesso!"},{"author":"Ítalo  Mendonça","comment":"Boa! Vamos dar voz para a galera da comunidade agile! :DDeixo aqui outros 3 podcasts para a galera que gosta do assunto poder acompanhar:O da Lambda3:https://itunes.apple.com/br...O da Resultados Digitais (Capycast):https://itunes.apple.com/fj...e o da Taller (Taverna Taller):https://itunes.apple.com/br...Conhecem outros?Abraço!"},{"author":"Paulo Silveira","comment":"Bem lembrado Ítalo. Victor nem citou o da lambda né? E eu nem sabia que a RD tinha o deles de agile."},{"author":"Diego Brocanelli","comment":"Excelente episódio, parabéns a todos os envolvidos pela excelente qualidade do conteúdo.No desenvolvimento de software virou uma coqueluche falar que os times são ágeis, quando em sua maioria passam bem longe disso.No time que trabalho utilizamos Scrum, porem o que posso tirar dessa experiência é que é fácil entender a teoria do método ágil, porem muito complexo de se implementar e utilizar, tendo em vista que as pessoas que utilizaram devem ter claramente em suas mentes os papeis que irão desempenhar dentro do clico e quais são suas áreas de atuação e responsabilidade. Porem é extremamente agradável trabalhar em uma ambiente onde se emprega uma metodologia ágil, respeitando seus artefatos e seus ciclos.Parabéns a todos!!!"},{"author":"Paulo Silveira","comment":"Também acho bastante difícil aplicar tanta coisa! Por isso gostei que conseguimos focar no episódio em técnicas-chave que cada experiente participante considerava importante para dar o primeiro passo. Valeu Diego o apoio!"},{"author":"Victor","comment":"Acredito que o difícil não é ser tanta coisa, mas querer fazer tudo de uma vez só, sem antes nem discutir o que trás ou não valor no dia a dia de cada um. Metodologias também estão ligadas a Governança, e sem um acompanhamento educacional pode acabar uma hora ou outra simplesmente caindo no limbo... Não sei se necessariamente aplicável, mas falo um pouco disso em https://www.linkedin.com/pu..."},{"author":"Jorge Improissi","comment":"Excelente pod!!! Parabéns pela iniciativa e poderiam \"mergulhar\" em frameworks e técnicas específicas no futuro! #BeAgile ;)"},{"author":"Vex","comment":"Mt bom <3Seria legal se vcs fizessem algo sobre a vida de estudante de TI e o começo da vida no mercado de trabalho.Vou ingressar em uma facul ano que vem, seria legal se falassem de como é estudar TI, coisas a esperar e coisas a (definitivamente) nao esperar... falar sobre o começo da vida no mercado de trabalho, o que esperar e o que nao esperar, esse tipo de coisa, daria um ótimo podcast(hipsterCast) tbm...ps: Vcs estao fazendo um ótimo trabalho"},{"author":"Paulo Silveira","comment":"oi Vex! Em breve teremos surpresas sobre esse tema :). Valeu o apoio."},{"author":"Paulo Silveira","comment":"Bem, faltou a minha preferência de prática que você pode adotar agora é algo como \"Big Visible Chart\" (pessoal tambem chama de Information Radiator). Isso é, algum lugar central onde você possa dar informações essenciais do andamento do projeto, das histórias e de tudo que está (e como está) em andamento naquele momento. Com essa transparência a gente consegue começar a diminuir aquele monte de emails/telefonemas/conversas do tipo \"ei, isso está sendo feito\", \"ei, alguém já falou isso\", etc.Parece simples? Muito projeto ninguém sabe dizer o que está sendo feito agora."},{"author":"Fernando Quadro","comment":"Paulo, desculpe a ignorância, mas o que diferencia o Information Radiator do Kanban? Abraço!"},{"author":"Paulo Silveira","comment":"Fernando, um quadro do kanban, ou mesmo um trello, se encaixa bem sim!!"}]}