{"title":"Oculus Rift e Realidade Virtual – Hipsters #07","releaseDate":"30/08/2016","tags":["games","hardware","Podcast","programação"],"people":["Paulo Silveira","André Breves","Mauricio ‘Balboa’ Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=330%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D330&t_u=https%3A%2F%2Fhipsters.tech%2Foculus-rift-e-realidade-virtual-hipsters-07%2F&t_e=Oculus%20Rift%20e%20Realidade%20Virtual%20%E2%80%93%20Hipsters%20%2307&t_d=Oculus%20Rift%20e%20Realidade%20Virtual%20-%20Hipsters%20%2307%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Oculus%20Rift%20e%20Realidade%20Virtual%20%E2%80%93%20Hipsters%20%2307&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Anthony","comment":"Faltou a comparação de tecnologias com o HololensTodos os problemas que foram debatidos no podcast, a microsoft já conseguiu na versão developer apresentar outras alternativas. Como não está na versão final, ainda tem muito o que atualizar e implementar, mas no futuro próximo, provavelmente a Hololens poderá ser usada no Xbox Scorpio Mas em termos de interatividade a Hololens supera Oculus Rift, Playstation VR, etc.\n\n\nReproduzir\n\n\n Ocultar\n\n\n\n"},{"author":"Fred Oliveira","comment":"Sou viciado neste podcast, me identifico muito, pois sempre estou testando coisas novas."},{"author":"Augusto da Silva Costa","comment":"Excelente cast!! Mas senti falta do Microsoft HoloLens."},{"author":"Evandro Teixeira","comment":"Salve Hipsters, meus parabéns pelo trabalho de qualidade e pela excelente discussão sobre a tecnologia, já estou aguardando ansioso pelo próximo assunto que será abordado aqui, estão fazendo um trabalho excelente.Falando sobre VR, acredito que vale ressaltar o livro 'Jogador N°1' do Autor Ernest Cline, que fala exatamente sobre a realidade virtual em um futuro não muito distante e como isso muda toda a interação entre as pessoas, é um livro maravilhoso pois apresenta uma visão muito interessante sobre o uso da tecnologia. Apesar de gostar da visão do Autor do livro, ainda acredito que a VR seria bem melhor aplicada se consegui-se chegar ao patamar da VR apresentada em animes como SAO ( Sword Art Online ), onde o nível de imersão é completo utilizando somente o óculos de VR, sem qualquer necessidade do uso de hardwares adicionais.Acredito muito na tecnologia e espero que ela tenha um futuro promissor pois tenho como objetivo trabalhar com o desenvolvimento de aplicações para ela no futuro, assim como a Realidade Aumentada, que se der certo, tende a transformar totalmente o mundo que vivemos e a interação com o mundo virtual.O vídeo postado pelo Sérgio Lopes da uma ideia da Realidade Aumentada no dia a dia, mas pra quem é fá de animes, o anime Accel World trás uma visão bem mais interessante :)Vlw e até o próximo episodio."},{"author":"Maurício Linhares","comment":"Esse livro é foda! Li num fim de semana, hahaha, mas é meio assustador também como VR altera o mundo."},{"author":"Sérgio Lopes","comment":"Vídeo bem legal sobre AR e o futuro: \n\n\nReproduzir\n\n\n Ocultar\n\n\n\n\n"},{"author":"Victor","comment":"Legal a discussão. Acho que o óculos cairia muito bem no simulador de ciclismo Zwift (http://zwift.com/). Abraço e parabéns pelo trabalho."},{"author":"trumae","comment":"Muito bom podcast! Em um trecho voces comentaram sobre detectar movimentos sem o uso de GPS. Em principio, o GPS nem eh o sensor ideal devido ao erros do sensor. Com acelerometros e giroscopios eh possivel um boa precisao na estimativa de pequenos movimentos lineares. Falando um pouco de matematica, se temos a atitude da \"cabeca\" lida pelos giroscopios, podemos realizar a integracao da leitura dos acelerometros obtendo a variacao de velocidade. E integrando a velocidade podemos ter os deslocamentos lineares. Eh um pouco mais chato/dificil de fazer do que falar :). Integrar sucessivas vezes as leituras de sensores pode aumentar o erro pq estamos integrado um sinal que ja tem um erro.Continuem com o bom trabalho!"},{"author":"André Breves","comment":"Exatamente! Os acelerômetros têm uma taxa de atualização relativamente alta (1kHz), mas o erro acumulado aumenta gradativamente. Numa taxa de atualização menor (60Hz) entram os sensores posicionais absolutos (Constellation/Lighthouse) para corrigir o \"drift\"."},{"author":"Michel Cordeiro","comment":"Já vem melhorando a cada episódio Paulo, sei que é algo natural e não programado, mas nesse ep. em especial, acho que o humor casou perfeito com a relevância do conteúdo. Lembro que a gente conversou um pouco no ProductCamp na vivaReal sobre o podcast e tudo mais, e acho que esse é dos grandes acertos do nerdcast. Sei que não se pode chamar isso de fórmula de sucesso, mas acho que causa uma empatia muito forte com o público. Enfim, só mais uma opinião de várias para você considerar ou não.Ta ficando cada vez melhor!!Abraço!!"},{"author":"Paulo Silveira","comment":"valeu Michel! Acho que estamos nos soltando e está ficando um pouco menos forçado. Vamos ver como fica mais pra frente."},{"author":"Matheus Montenegro","comment":"André Breves, por favor, me convida pra tua casa tbm, cara!? Muito bom o papo de vcs, dá pra se pensar em muita coisa para quando ficar mais \"palpável\" financeiramente, entrar com tudo!Ah, coloca um \"_target\" nesses links :DAbraços!"},{"author":"André Breves","comment":"Vou abrir um VR Arcade e lucrar com as visitas :D"},{"author":"Maurício Linhares","comment":"Opa, vou visitar em breve!"},{"author":"Júlia Yamamoto","comment":"Muito bom. Comecei a trabalhar com VR a pouco tempo e gostei muito de tudo o que disseram aqui! sempre legal saber todos os dramas e tramas xD! Ótimo programa, muito bem feito e divertido de ouvir! :D (pedi por esse conteúdo no segundo podcast do Hipsters, super feliz por esse tema ter aparecido!).Apesar do que disseram sobre o Leap Motion e o quão bom seria não ter que segurar nada para se sentir mais imerso, ainda acho que uma luva não seria nem um pouco intrusivo e aumentaria muito o que poderíamos desenvolver de bacana!De recomendação de coisas que você PRECISA experimentar com Realidade virtual é o Tilt Brush (que inclusive usamos recentemente para fazer o level design de um jogo para VR). \n\n\nReproduzir\n\n\n Ocultar\n\n\n\n\nAlém disso, existem aí várias iniciativas para usar a realidade virtual para cura de fobias e também para publicidade. Está começando, engatinhando, mas acho que quando menos esperarmos, vai explodir! :D"},{"author":"Paulo Silveira","comment":"Que bacana Júlia! E onde exatamente você está trabalhando?"},{"author":"Júlia Yamamoto","comment":"Eh uma empresa voltava a eventos, então usamos muito a realidade virtual para mostrar produtos :) "},{"author":"Cássio Almeida","comment":"Excelente poscast, mais uma vez!Não foi mencionado no cast, mas tem nos links o CardBoard do Google. Tenho um e é uma excelente forma de começa a brincar com VR sem gastar muito. =]"},{"author":"Maurício Linhares","comment":"Pior que falamos disso antes mas não comentamos no podcast, minha primeira experiência com VR foi com o pouso na lua num cardboard."},{"author":"Paulo Silveira","comment":"Cássio, vacilamos e nem citamos o cardboard.... foi alguns dos que ficou pra fora. Por isso deixei nos links"},{"author":"maiconrcf","comment":"Muito boa a discussão, para quem interessar tem esse Framework desenvolvido pela Mozilla https://aframe.io"},{"author":"cleysonwebdev","comment":"Lembrando que muitos nichos vão se aproveitar dessas tecnologias, como a industria porno e a medicina!"},{"author":"Maurício Linhares","comment":"Nada escapa do porn."},{"author":"maikenunes","comment":"Assunto muito interessante, parabéns pelo conteúdo de qualidade."},{"author":"Paulo Silveira","comment":"Valeu Maike! Muita coisa acotnecendo nesse campo. Vamos ver pra onde vai!"}]}