{"title":"Web Components – Hipsters #06","releaseDate":"23/08/2016","tags":["front-end","Podcast","programação","web"],"people":["Paulo Silveira","Sérgio Lopes","Zeno Rocha"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=332%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D332&t_u=https%3A%2F%2Fhipsters.tech%2Fweb-components-hipsters-06%2F&t_e=Web%20Components%20%E2%80%93%20Hipsters%20%2306&t_d=Web%20Components%20-%20Hipsters%20%2306%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Web%20Components%20%E2%80%93%20Hipsters%20%2306&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Zé-Ninguém","comment":"Ótimo tema, galera!Embora ele seja de 2017 e já estamos em janeiro de 2018, poderiam abordar esse tema novamente com o Vue.js, que parece implementar essa parada de Web Components...Estou estudando ele atualmente visando adotá-lo... Antes dele, li um livro sobre Angular v1.x... e depois descobri que ele mudou totalmente... Já descartei Node.js por causa do servidor em JS e o Embler por ser pesado.Agora, gostaria de saber de mais opiniões com um \"Advogado do Diabo\" junto pra não ter só a opinião de alguém que é entusiasta do Vue.jsOutra sugestão de tema seria abordarem \"Metodologias de Desenvolvimento Profissional\" em PHP em JS.Parabéns pelo trabalho de vocês!"},{"author":"Junior Osho","comment":"Adorei React !"},{"author":"Augusto Sandim","comment":"Vocês comentaram sobre o materializecss, funciona perfeitamente."},{"author":"Douglas Junior","comment":"Show de bola. Parabens mais uma vez, e obrigado.Estou estudando esses framework nos últimos meses. Até agora gostei mais do React. Angular não caga e não sai da moita. VueJS parece q ainda está engatinhando.Estou usando uma lib chamada React Toolbox para material design, a melhor que achei até agora."},{"author":"João Pedro Gamin","comment":"Por favor, possibilite efetuar o download do podcast como .zip . Pois a internet que uso existe um bloqueio no firewall."},{"author":"Joao Cardoso","comment":"Bootstrap == grids"},{"author":"Leandro Severino","comment":"Pergunta de noob, mas preciso fazer:- React versus Angular 2.x ?Tipo, o Angular 1.x é carta fora do baralho ?e o React versus Angular 2.x ? qual é o melhor caminho ?, claro que tudo depende de projeto e aplicabilidade e etc, mas me parece que o mercado esta indo bastante para o lado do React.Impressão minha mas tem muita gente desconfiada com o Angular 2.x, isso procede ?"},{"author":"Douglas Junior","comment":"Pelo o que tenho visto, Angular 2 ainda não tá pronto. A cada release muda muita coisa e outras ficam deprecated. Angular 1 nem se fale, agora com o 2 a morte é certa. Nem o próprio Google usa.Minha melhor opção até então foi React."},{"author":"Cleiton Rodrigues","comment":"Eu ODEIO o inbox! Me julguem. :(ps: Eu ouvi curso de Polymer no Alura?"},{"author":"Junior Osho","comment":"Eu também queria fazer esse curso !"},{"author":"Clayton Passos","comment":"não da pra ouvir no http://www.podbean.com/ :("},{"author":"Paulo Silveira","comment":"Eu to conseguindo Clayton, olha aqui:http://www.podbean.com/medi..."},{"author":"Ednilson Campos","comment":"Além do letsencrypt existe o http://www.cacert.org/ para certificado gratis"},{"author":"Paulo Silveira","comment":"valeu ednilson! não conhecia."},{"author":"Rafael","comment":"Ótimo podcast para ser consumido por nós desenvolvedores."},{"author":"kennedy Pereira","comment":"mais um conteúdo muito bom !!!!!!!!"},{"author":"Victor Vasquez","comment":"Muito bom! Parabens! Estou migrando o meu site para responsivo e aproveitando a mudança para já colocar em uma tecnologia front end mais moderna. Esses podcast estão me atualizando e me motivando!"},{"author":"Andre Pereira","comment":"Cadê o Slack do Hipsters.tech?"},{"author":"Paulo Silveira","comment":"boa andre. um passo gigante de cada vez :)"},{"author":"Carlos Carvalho","comment":"Cara, melhores conteúdos que eu consumo na semana. Por mim vocês deveriam ter 2 por semana :P. Poderia ser até só um com os imortais e o outro de assuntos mais diversos. Sério, eu fiquei viciado haha. Abs"},{"author":"Paulo Silveira","comment":"Valeu Carlos! Olha, seria meu sonho gravar 2 podcasts por semana. Mas 1 já está dando uma trabalheira danada ehhehe."},{"author":"Diego Batista","comment":"Opa estamos usando Polymer na nossa web app com cordova esta muito rápido executando no IOS e Android."},{"author":"richellyitalo","comment":"Achei massa!"},{"author":"richellyitalo","comment":"React, VueJs ou Aurelia?"},{"author":"richellyitalo","comment":"Estou estudando o Aurelia, mas admito que gostei mais do React."},{"author":"Mauricio R. Duarte","comment":"React"},{"author":"Júlio Shinoda","comment":"VueJs é bom. Uso em meus projetos"},{"author":"Matheus Castiglioni","comment":"Esperando anciosamente para essa idéia se concretizar pois irá facilidade demais não ter todos aqueles ctrl+c e ctrl+v de códigos."},{"author":"KlarkC","comment":"Gente quero aproveitar pra divulgar dois projetos, um é o http://customelements.io, um website que é um \"agregador\" de web-components. Claro que ele também usa web-components ;)Outro projeto é um que estamos começando agora no GitHub: https://github.com/trabalha...Será um Progressive Web App para centralizar informações de bons lugares para se trabalhar, estamos decidindo ainda as tecnologias, mas já há algo usando Polymer por lá. Participe conosco! ;)"},{"author":"Paulo Silveira","comment":"opa! parabéns pelo trabalho! o zeno nem lembrou de falar do customelements ehhehe."},{"author":"Alan Oliveira","comment":"Nem escutei, mas já sei que está sensacional!"},{"author":"Gabriel Ribeiro","comment":"Sérgio, existe modal só com css sim!O Felipe Fialho tem uma lib com vários componentes feitos só com html + css.https://github.com/LFeh/css...Parabéns pelo podcast galera \\o/"},{"author":"Sérgio Lopes","comment":"Bem legal esse projeto! Muitos bons exemplos mesmo. Mas vários hacks tbm né (tem mais checkbox hack do que eu gostaria hahaha)"},{"author":"Mauricio R. Duarte","comment":"Existe esse Bulma CSS, que não usa Javascript e tem modal, vê se é isso :Dhttp://bulma.io/documentati...Parabéns pelo podcast"},{"author":"Gabriel Ribeiro","comment":"uhauhahuauha estamos longe de um mundo perfeito, mas o projeto é tope mesmo :)"},{"author":"Fernando Quadro","comment":"Paulo, pensei que era só eu que ainda usava o center no HTML. Fiquei mais tranquilo quando você falou que também sente falta e usa. rsrsrs! Abraço!"},{"author":"Paulo Silveira","comment":"dá-lhe <center>!"},{"author":"Ramon Sena","comment":"Sempre muito bom!! :D"},{"author":"benLopes","comment":"Ótimo tema!!!Poxa os programas estão muitos pequenos...rsrspostcast maiores...por favor..."},{"author":"Paulo Silveira","comment":"estamos a caminho de aumentá-los :) valeu ben."},{"author":"KlarkC","comment":"Haha valeu! ótimo Podcast, vou indicar pra uma galera =D"},{"author":"Giovani Alfeu Harada","comment":"Second"},{"author":"Thiago Miro","comment":"First"},{"author":"Paulo Silveira","comment":"você é café com leite."}]}