{"title":"CSS: Cansei de Ser Simples – Hipsters #09","releaseDate":"13/09/2016","tags":["front-end","Podcast","web"],"people":["Paulo Silveira","Sergio Lopes","Diego Eis"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=373%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D373&t_u=https%3A%2F%2Fhipsters.tech%2Fcss-cansei-de-ser-simples-hipsters-09%2F&t_e=CSS%3A%20Cansei%20de%20Ser%20Simples%20%E2%80%93%20Hipsters%20%2309&t_d=CSS%3A%20Cansei%20de%20Ser%20Simples%20-%20Hipsters%20%2309%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=CSS%3A%20Cansei%20de%20Ser%20Simples%20%E2%80%93%20Hipsters%20%2309&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Douglas Ferreira","comment":"caramba... e o Paulo sempre pegando no pé no react kkkkkkkkkkk"},{"author":"thales alonso","comment":"Ótimo podcast, sou fã do Hipster, sou iniciante na área, e decidi que vou aprender javaScript puro."},{"author":"Gabriel Darezzo","comment":"e esse <marquee> ai?! HUSAHUSHUASHUAS"},{"author":"Leo Almeida","comment":"hahaha Esse e hipster meesmo !!"},{"author":"Glauco Raupp Russo","comment":"Parabéns, excelente podcast ainda mais com o Diego Eis mega sangue bom. Vocês falaram que tem devs usando npm e pre-processadores em sites básicos com até 05 pages, blz concrodo plenamente. Mas e afins de prática e estudos? Trabalho em uma agência que a maioria dos sites são institucionais e simples (ainda mais com o wp), porém estou usando sass para praticar diariamente e assim que eu manjar mais de angular vou utilizar também kkk. Abraço pessoal da alura e diego eis."},{"author":"Marquinhus Goncalves","comment":"Paulo muito bom o podcast, acompanho desde o começo e faz com que o tempo que fico no trânsito seja bem melhor ouvindo, nesse episódio acho que os convidados foram bem selecionados o Sergio e o Diego tem uma boa bagagem e uma experiência incrível, gosto muito de CSS. Obrigado pelos links e curti muito o marquee no código."},{"author":"Filipe Siegrist","comment":"Cara, essa marquee foi proposital por conta do tema?"},{"author":"José Alves","comment":"Gostei da participação do Diego Eis. Eu sempre achava que ele era meio babaca mas esse episódio mudou meu ponto de vista. To comentando um mês depois de ter ouvido o episódio porque lembrei só agora quando fui ver um artigo no tableless hahaha"},{"author":"Matheus Bizan","comment":"Designer que mexe com web, editando e criando o css por exemplo, não é WEB design?... trazendo novamente o glamour do web design"},{"author":"Ricardo Justem","comment":"Ótimo bate-papo. Para quem curte FRAMEWORKS CSS, ta ai uma lista para comparações e laboratório.http://usablica.github.io/f..."},{"author":"NA-DI-NA-EL","comment":"Sempre quando o professor perguntava sobre o que era CSS eu dizia: Counter Strinke Source kkkkk, agora tenho uma definição melhor."},{"author":"Paulo Silveira","comment":"confesso que invejei a sua"},{"author":"heitorspedroso","comment":"muuuito bom. Abriu muito a idéia com relação ao que vocês falaram sobre o css ser simples e a não necessidade de pré-processadores e etc como um padrão."},{"author":"SonySantos","comment":"Delícia de podcast!"},{"author":"Arthur Bernardi Jordão","comment":"Melhor podcast de todos <3."},{"author":"Paulo Silveira","comment":"obrigado o apoio Arthur!"},{"author":"Eric Hayashi","comment":"Sensacional este episódio. Já acompanho o trabalho o Eis há muito tempo. Quando comecei a aprender CSS, usava muito o tableless como referência."},{"author":"Diego Brocanelli","comment":"Excelente episódio, parabéns pelo conteúdo!"},{"author":"Juscilan Moreto","comment":"Conteúdo fodastico podcast profissa! padrão Caelum!"},{"author":"Luiz França Dos Santos","comment":"Paulo, faz um episodio sobre Scala no Brasil."},{"author":"Paulo Silveira","comment":"Uma boa Luiz. Talvez algo um pouco menos específico senao vira muito nicho. Focado em linguagens menos conhecidas e emrpesas que a utilizam?"},{"author":"Luiz França Dos Santos","comment":"Talvez algo tipo o episodio 1, que tratou do Nullbank e como eles usam o clojure, mas falando de Scala. Enfim, o podcast ta otimo, parabens!"},{"author":"Diogo Machado","comment":"Muitoooo bom, admiro bastante esses três caras. Continuem sendo vocês hehehe e jogando experiência pra gente!"},{"author":"Eduardo Medeiros Branquinho","comment":"Um host que deixa seus convidados falarem sem interrupções? Da a liberdade para os mesmos falarem o quanto quiserem? Po, Paulo, não aprendeu nada com seus domingos a tarde na globo? haha.Brincadeiras a parte, muito bom. Ontem mesmo eu estava estudando a metodologia BEM. Bela coincidência. Terça que vem estamos ai!"},{"author":"Paulo Silveira","comment":"agradeço o elogio, mas o pessoal da edição faz uma mágica quando eu interrompo a galera que parece que eu sou educado. :)"},{"author":"Rafael Acioly","comment":"No link do Diego Eis esta direcionando para o do Paulo (https://twitter.com/paulo_c... :/"},{"author":"Paulo Silveira","comment":"era um truque baixo para eu ganhar mais followers! :P. consertado"},{"author":"Clóvis Neto","comment":"Muito bom! CSS ainda é muito escanteado.Para diversificar mais isto e provar o contrário, criamos o http://cssbrasil.org vale muito a pena dar uma conferida."},{"author":"Carlos Carvalho","comment":"Sensacional o conteúdo! como sempre. Quando comentaram sobre o designer que também faz css, eu me lembrei de um dos meus fornecedores designers que também fornece o css. No entanto utiliza demais de seletores complexos e páginas muito cheias de ids nos elementos, que as vezes pela maneira como está sendo feito, não se preocupa muito com reutilização de estilos. E eu sempre pensei que, por eu não ser tão bom no front-end, ele estivesse certo e eu equivocado. Ouvindo agora as dicas, me veio a confirmação de que algo de errado está acontecendo naquele código que ele me fornece.Irei recomendar esse conteúdo pra ele."},{"author":"cleysonwebdev","comment":"Ótimo programa, fico ansioso pela terça para ouvir o podcast, e minhas considerações são:Realmente o CSS é um monstro, existe varias formas de organizar e ferramentas de build, mas nada disso vai funcionar bem se a sua base não for boa.... eu pensava o mesmo sobre as ferramentas de build, \"Pra que dificultar algo que é simples\", mas ai que tá, a solução só faz sentido pra quem realmente tem o problema."},{"author":"Luis Sérgio","comment":"Muito bom podcast.Eu sou programador SharePoint a 7 anos (3 antes disso com outras tecnologias Web) e até ano passado eu tava criando layout com table. Esse ano comecei a trabalhar com Wordpress e me vi forçado a aprender a lidar e fazer layouts com div e Bootstrap, e saber uq é Sass e Less. Tenho que aprender 10 anos de evolução de CSS em meses.Acredito que muita gente passou por isso pq programador visa focar em aprender e estudar o backend que também não para de evoluir. Só sendo muito antenado para não deixar isso acontecer (e nada melhor do que um bom podcast desses pra saber as tendencias).Eu também não me vejo utilizando Sass e Less pelos mesmo motivos comentados no podcast. Mas com certeza terei que estudar pra entender melhor."},{"author":"Luis Sérgio","comment":"Caraca, acabei de dar uma olhada no site www.tableless.com.br. Onde eu estive que perdi tantas facilidades que o CSS3 nos proporciona?Eu estava muito desantenado para um programador. #NãoMais"},{"author":"Thiago Miro","comment":"Segui as dicas na criação do meu novo site. Usei poucas classes. O resultado foi que eu reduzi o css de 62 para 24 Kb. Impressionante."},{"author":"Paulo Silveira","comment":"deixa o link pra gente Thiago. e valeu pela edição impecável!"},{"author":"Thiago Miro","comment":"Mundo Podcast - https://mundopodcast.com.br/"}]}