{"title":"Monitoramento: não receba mais telefonemas de madrugada! – Hipsters #12","releaseDate":"04/10/2016","tags":["infraestrutura","Podcast"],"people":["Paulo Silveira","Thadeu Russo","Mauricio Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=394%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D394&t_u=https%3A%2F%2Fhipsters.tech%2Fmonitoramento-nao-receba-mais-telefonemas-de-madrugada-hipsters-12%2F&t_e=Monitoramento%3A%20n%C3%A3o%20receba%20mais%20telefonemas%20de%20madrugada!%20%E2%80%93%20Hipsters%20%2312&t_d=Monitoramento%3A%20n%C3%A3o%20receba%20mais%20telefonemas%20de%20madrugada!%20-%20Hipsters%20%2312%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Monitoramento%3A%20n%C3%A3o%20receba%20mais%20telefonemas%20de%20madrugada!%20%E2%80%93%20Hipsters%20%2312&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Bruno Souza Picinini","comment":"música de fundo 22:00 Rammstein - Du Hast"},{"author":"Túlio Gomes","comment":"Que tal uma alternativa open source ao New Relic? Pinpoint! https://github.com/naver/pi..."},{"author":"Pedro César Gomes","comment":"Uma solução de monitoramento de TI (gerenciamento de disponibilidade e capacidade) é o OpMon https://www.opservices.com..... É desenvolvido por uma empresa brasileira em que trabalho. Tem uma versão de testes no site."},{"author":"Fernando Albuquerque","comment":"Ótimo podcast! Também existe o DynaTrace, que é uma ferramenta APM completa e totalmente integrada."},{"author":"Douglas Cunha","comment":"Sobre a questão de mandar os log´s da aplicação e também dos servidores para uma ferramenta cloud, imagino que isso possa gerar um tráfego de dados muito intenso para fora do host. A dúvida é, amazon, digitalocean, etc cobram por esse tráfego externo (dentro para fora) ? Penso que isso pode ficar caro."},{"author":"Victor Lucas","comment":"Eu ouvi... maratona de programação??? :O Falem mais sobre por favor haha. Comecei a me preparar esse ano e gostaria de saber as técnicas que vocês utilizaram para estudar para ela ou algo assim haha. A Alura tem cursos voltados para essa área??"},{"author":"Kaique Leão","comment":"Fantástico como sempre. Só gostaria de tirar uma dúvida a respeito do monitoramento de tempo de consulta no banco de dados, essa configuração, seria um trace de tudo que a aplicação manda para o server de banco, correto? Isso não iria concorrer com a aplicação gerando mais lentidão?"},{"author":"Rodrigo","comment":"Excelente discussão! Os assuntos dos podcasts estão super interessantes, parabéns Paulo."},{"author":"Andre Luiz","comment":"Muito interessante, mas o log da app tem q ser usado com cuidado, eu já tive lentidão no site, porque toda consulta feita pelo usuário eu salvava a query utilizada e media sua performance para ver onde podia melhorar. Até perceber que este processo de medição estava causando a lentidão.Isso me ajudou em um determinado momento, quando o site foi pra produção e ai eu tive o uso real e pude medir (na máquina do DEV tudo funciona bem), mas depois tornou-se um problema.Excelente podcast."},{"author":"Maurício Linhares","comment":"Esse comentário foi apagado."},{"author":"Maurício Linhares","comment":"Opa, estão aqui: https://www.alura.com.br/po..."},{"author":"Thadeu Russo","comment":"Opa, bacana que gostam pessoal. Foi muito legal gravar com Paulo e Maurício e poder compartilhar algumas das ideas que usamos no dia a dia. Espero que consigam colocar em prática algumas das dicas. Eu sempre brinco que sistemas são como seres humanos. A diferença que estão na UTI o tempo todo e por isso precisam ficar ligado nos 'aparelhos de monitoramento' (Thadeu e suas metáforas!). Fazendo um jabá aqui, para os que usam soluções IaaS (e.g.: EC2), toda a parte de monitoramento de hardware, em geral, é feita de brinde. No caso da Amazon, você consegue monitorar praticamente tudo o que é relevante no CloudWatch. #ficadica #jaba_aws."},{"author":"Victor Vasquez","comment":"Eu tenho uma aplicação \"pequena na web\" mas que o pouco que ficou fora tive stress com os usuário. Agora ou tento colocar um disparo de email quando ocorre uma falha nas paginas sensíveis do sistema. Ou seja, fiz um insert, update que falhou? Ele me manda um email avisando... E o que me ajudou também é criar o meu próprio monitoramento de log bem simples. Em php fiz um script que monitora o meu log, porém erros normais são comuns, então coloquei no script para só me avisar se der mais de tantas linhas em menos de tanto tempo.... Agora ficou fácil saber se está tudo indo bem. O que nao fiz foi realizar um ping externo para a minha aplicação. Mas acho que poderia fazer isso de forma grátis com o site de algum amigo... ai podemos fazer para ele tbm. Só que tem q ser uma hospedagem diferente da sua, se possível de empresas distintas, senão os dois caem juntos e ninguém avisa."},{"author":"benLopes","comment":"Muito bom, parabéns!!!Voltando para o front-end, e o angular 2 ? Vale apena bater um papo sobre ele ?"},{"author":"Maurício Linhares","comment":"Está nos planos!"},{"author":"Gabriel Sixel","comment":"Faltou o link do artigo do Danilo Sato"},{"author":"Paulo Silveira","comment":"opa! atualizado"},{"author":"Gabriel Sixel","comment":"Obrigado!"},{"author":"Michel Cordeiro","comment":"Papo show!!!! Excelente conteúdo. Parabéns galera!"},{"author":"Diogo Machado","comment":"Conteúdo top hein, bate papo de alto nível, estou curtindo bastante os podcasts"},{"author":"Carlos Carvalho","comment":"Parabéns pelo conteúdo. Está sensacional como sempre.Só fiquei triste porque ninguém falou do zabbix. Que além de ser uma ferramenta open source. É reconhecida como uma das melhores ferramentas de monitoramento de hardware e software que existe atualmente (http://www.zabbix.com/)."},{"author":"William R. Fernandes","comment":"Muito bom!Conversas como essas que não são encontradas em blogs diários, estão aqui nesse Podcast lindo! heheNewRelic sempre foi meu amigo \"tenho até camisa\" não é zuera. Papertrail é muito interessante mesmo.Mais falando em servidores nosso amigo Nagios é rei ainda né? Apesar do Zabbix está querendo comer o mercado o Nagios ainda é forte e sempre será!Em APM com toda certeza Newrelic, só acredito que o custo dele é um pouco alto para pequenas aplicações :(Obrigado galera, esse bate papo é show!"},{"author":"Maurício Linhares","comment":"Aff, paguei rios de dinheiro pro newrelic e não tenho camisa :("},{"author":"William R. Fernandes","comment":"E eu conseguir naqueles presentes! "},{"author":"Sebastião Relson Reis da Luz","comment":"Também tenho uma camisa da newrelic :DNa empresa q trabalho passamos muito tempo desenvolvendo ferramentas de monitoramento, hoje substituímos todos os nossos agentes pelo icinga ( fork do nagios ) e desenvolvemos a integração.Como sempre ótimos cast"},{"author":"William R. Fernandes","comment":"Boa Sebastião! Não conhecia esse fork, pelo visto muito bom em! Já vou coloca na lista de estudo!"},{"author":"Valdir Viana","comment":"Ótimo cast, estava esperando algo relacionado a monitoramento backend.E o Paulo criando termos novos, como \"setupar\"Flws"},{"author":"Paulo Silveira","comment":"e deploiar!"},{"author":"William R. Fernandes","comment":"Debugar"},{"author":"Gustavo Fão Valvassori","comment":"Podcast ta cada vez melhor, só falta adicionar a propriedade no link pra abrir numa outra aba. Sempre clico nos links e saio podcast :joy:"},{"author":"cleber","comment":"Ta no AR, mais um Hipsters ... bora la... Show <3"}]}