{"title":"Startups, Ninjas e Marketplaces – Hipsters #10","releaseDate":"20/09/2016","tags":["Podcast","startup"],"people":["Paulo Silveira","Eduardo LHotellier","Lucas Souza"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=412%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D412&t_u=https%3A%2F%2Fhipsters.tech%2Fstartups-ninjas-e-marketplaces-hipsters-10%2F&t_e=Startups%2C%20Ninjas%20e%20Marketplaces%20%E2%80%93%20Hipsters%20%2310&t_d=Startups%2C%20Ninjas%20e%20Marketplaces%20-%20Hipsters%20%2310%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Startups%2C%20Ninjas%20e%20Marketplaces%20%E2%80%93%20Hipsters%20%2310&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Bruno Oliveira de Alcântara","comment":"Gostei muito deste episódio, um dos meus preferidos até agora, senão o melhor. Pessoal da GetNinjas falou bastante coisa interessante sobre a vida real em uma startup."},{"author":"Marquinhus Goncalves","comment":"Mais um episódio sensacional, gostei muito da história da GetNinjas já conheço a alguns anos e pude ver bastante a metamorfose que a empresa passou, achei muito interessante conhecer a stack e as tools que eles usam. Parabéns"},{"author":"Diegolinkk","comment":"Vocês são um dos dois ótimos podcasts que eu faço questão de colocar no download automático.Papo de alto nível.Pergunta: sejam sinceros por favorEu consigo adquirir um bom conhecimento técnico apenas assistindo aos cursos da Altura ? Pois gostaria de ingressar em outros mercados de TI, mas só tenho experiência em poucas áreas.Exemplo: eu trabalho com infra e até flerto com programação, bd e tudo mais. Mas como ja passei da fase dos estágios, eu gostaria de ingressar na área, mas geralmente preciso ter um conhecimento bem sólido para concorrer à essas vagas com quem ja tem experiência.Obs: tenho pesadelo de me aposentar como analista de suporte Windows (ou trocador de mouse profissional)  -_-Valeus"},{"author":"Isaque Costa","comment":"Mano,"},{"author":"Milton Jacomini Neto","comment":"show galera, sem duvidas é sensacional conhecer a história de startups que deram certo e sempre tem conteúdo a agregar!!"},{"author":"Artur Veiga","comment":"Excelente !! Será que dava pra fazer um com ionic ??"},{"author":"Alexandre Fumes","comment":"Pessoal, show de bola. Se conseguirem postar o link das ferramentas de tracking citadas no podcast, seria muito bacana. Abraços!!!"},{"author":"A coisa","comment":"Essa trilha sonora de Naruto é pura nostalgia! <3"},{"author":"Paulo Silveira","comment":"easter eggs!"},{"author":"Henrique Freitas","comment":"Muito bom"},{"author":"Ysbrobows","comment":"Melhor programa até o momento. Continuem assim !"},{"author":"Wesley Oliveira","comment":"Cadê o app da GetNinjas para WP? #WeAreThe2%E não, não somos haters :)"},{"author":"Paulo Silveira","comment":"perseguição!!!!"},{"author":"Luis Sérgio","comment":"Sugestão de Podcast: versionamento de código."},{"author":"Mauricio Brenner","comment":"Muito bacana! Alguns relatos coincidem com a nossa história do CenaZERO (www.cenazero.com.br)"},{"author":"heitorspedroso","comment":"O BI dos caras do get ninja é sensacional , brincadeira.Não tem mais como perder o podcast de vocês. Muito bom mais uma vez."},{"author":"Carlos Carvalho","comment":"Coincidência interessante demais comigo. Vocês estão adivinhando pensamentos aí, hahaha.Eu estava em uma reunião ontem, conversando com um cliente da área da industria de produtos químicos, discutindo esse assunto com ele. O cliente não entende nada de tecnologia, tem uma ideia, mas não entende como discorrer isso da maneira correta. Esse podcast veio como uma luva. Sensacional!!!Parabéns galera, cês são foda!!"},{"author":"Marcos André","comment":"Tem como postar o link para a ferramenta que o Eduardo utiliza fazer fazer tracking das aplicações?Parabéns pelo podcast!"},{"author":"Marcos André","comment":"Obrigado!"},{"author":"Leonardo","comment":"E alguém tem o site da ferramenta que a Caelum/Alura usa?"},{"author":"disqus_hvlXOoYmoO","comment":"Oi Marcos André , usamos essa ferramenta mesmo: http://snowplowanalytics.com/"},{"author":"Joao Marcos","comment":"http://snowplowanalytics.com/"},{"author":"cpappen","comment":"Pelo que entendi, parece ser essa ferramenta. http://snowplowanalytics.com/Alguém me corrige se eu estiver errado!"},{"author":"Andre Luiz","comment":"também estou interessado."}]}