{"title":"Por trás dos vídeos da Globo.com – Hipsters #11","releaseDate":"27/09/2016","tags":["infra","infraestrutura","Podcast"],"people":["Paulo Silveira","Emerson Leite Macedo","Mauricio Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=428%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D428&t_u=https%3A%2F%2Fhipsters.tech%2Fpor-tras-dos-videos-da-globo-com-hipsters-11%2F&t_e=Por%20tr%C3%A1s%20dos%20v%C3%ADdeos%20da%20Globo.com%20%E2%80%93%20Hipsters%20%2311&t_d=Por%20tr%C3%A1s%20dos%20v%C3%ADdeos%20da%20Globo.com%20-%20Hipsters%20%2311%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Por%20tr%C3%A1s%20dos%20v%C3%ADdeos%20da%20Globo.com%20%E2%80%93%20Hipsters%20%2311&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Wesley Nunes de Lima","comment":"Exatamente isso! Trabalhando e ouvindo hipsters.tech  kkkkk"},{"author":"Oziel Alves Cavalcante","comment":"Estou contra a correnteza: prefiro esperar pra assistir em alta qualidade."},{"author":"Vitor Schiavo","comment":"show de bola esse podcast!"},{"author":"Tozza","comment":"Boa, Emerson ;)"},{"author":"eric","comment":"hahahahaha verdade!"},{"author":"Danilo Vieira","comment":"Muito bom o conteúdo. Porém eu fiquei curioso para saber quais as tecnologias de vídeo usadas ai na Alura ??"},{"author":"Marquinhus Goncalves","comment":"Um universo explodiu na minha cabeça, usuários normais e inclusive dev' geralmente apenas damos o play e acabamos nunca parando para pensar em toda estrutura, infra que realmente é usada para atender a toda demanda, esse ano fui no BrazilJS e em umas das palestras foi falado sobre o mesmo tema (vídeos ) porém do jornal New York Times que um dev faz parte do time foi onde tive o primeiro contato, e com o podcast pude aprender e conhecer mais,"},{"author":"EduMelo","comment":"Como chama a plataforma de PAAS citada pelo Maurício?"},{"author":"Agendor Bits","comment":"Kubernetes http://kubernetes.io/"},{"author":"cleber","comment":"Parabéns aos HIPSTERS por mais um conteúdo fenomenal.Toda semana estou aqui esperando o Podcast sair pois o papo e sempre sensacional tecnologia. E lembrar também que a voz do Paulo silveira e a melhor rsrsrsrsrsrs. Valeu RISPTERS abraços."},{"author":"Artur Veiga","comment":"como sempre, excelent podcast <3"},{"author":"heitorspedroso","comment":"muuito bom de novo!"},{"author":"Adler Coelho Santos","comment":"Será que as tecnologias usadas pela Globo.com são similares a outros serviços de streaming, exemplo o Netflix? Parabéns pelo conteúdo."},{"author":"Victor Menegusso","comment":"Muito interessante saber como funciona o streaming \\o/. Mas uma curiosidade nada a ver... a risada do 'Mauricio Linhares', esta sendo adicionada pela edição em certas partes né ? hehehehe"},{"author":"Maurício Linhares","comment":"É sério, tenho um problema grave em rir de qualquer coisa HAHAHAHA!"},{"author":"Paulo Silveira","comment":"sabe o que é pior? não está! ele é da zoeira mesmo!"},{"author":"Murilo","comment":"Parabéns mais uma vez pelo material apresentado no podcast. Cada programa são novos conhecimentos, novas tecnologias (até bate um desespero, rs). Só gostaria de saber, quando que estes players vão começar a suportar as plataformas Linux? É impossível assistir um filme no Telecine Play no Ubuntu 16.04.01"},{"author":"Filipe Tagliatti","comment":"o que é um sistema PAS q é citado aos 4 minutos +-???"},{"author":"Paulo Silveira","comment":"Filipe, comi bola de nao ter interrompido o Emerson essa hora. PaaS é plataforma como servico. Uma forma de fazer o cloud onde voce tem menos controle da infraestrutura (as vezes nenhum), mas ja ganha um monte de coisa pronta em compensacao. Exemplos são o Google App Engine e o Heroku."},{"author":"mstrey","comment":"Achei interessante o Emerson comentar que o Android TV está tentando ser um padrão e que isso é bom mas nenhum dos apps da Globo está disponível para Android TV. Pra conseguir utilizar precisei instalar no tablet, capturar o APK e instalar manualmente, mas dai não da pra usar o controle do android, só com mouse pra interagir com o app.Foi uma imensa oportunidade perdida não ter esses apps no android tv durante as olimpiadas."},{"author":"Eduardo Medeiros Branquinho","comment":"Resumo: Complicadíssimo! Haja dificuldades pra fazer isso tudo rodar haha"},{"author":"Marcelo Aragão","comment":"Excelente podcast. Muito bom mesmo, interessante saber que a globo usa Rails e Django."},{"author":"Emerson Macedo","comment":"Amigos, em quase todos os lugares que eu falei DRM o correto era DVR. Isso que dá gravar podcast de madrugada. Peço desculpas pela confusão de siglas e segue a explicação:- DVR -> Digital Video Recorders - Grava um tempo do vídeo para o usuário poder voltar (e.g. 30 min)- DRM -> Digital Rights Management - Tecnologia para criptografar e proteger vídeos com CopyrightsGrande Abraço e espero que tenham gostado."},{"author":"Tozza","comment":"Boa, Moleque... mandou muito ;)"},{"author":"Fernando Quadro","comment":"Muito interessante o assunto do podcast e o Emerson desmistificou muita coisa interessante. Parabéns a todos excelente trabalho."},{"author":"Valdir Viana","comment":"Excelente cast, desmistificou um pouco o desenvolvimento utilizando vídeos."},{"author":"Fanime Fartoon","comment":"Achei que fosse falar de Elixir =("},{"author":"Maurício Linhares","comment":"O assunto de streaming terminou ficando muito interessante então resolvemos deixar Elixir pra um futuro episódio, mas vai acontecer, pode ficar tranquilo!"},{"author":"Cleidiano Oliveira","comment":"Estamos ansiosos por este podcast, sem duvida Elixir esta provocando um barulho na comunidade e tem muita gente de olho nesta linguagem."},{"author":"Kleber Kihara","comment":"Olá a todos os hipsters,Sou desenvolvedor Rails e, creio que como a maioria da audiência de vocês, conheci o podcast através do Nerdcast. Acompanho mensalmente vocês no Nerdcast e o Hipsters Ponto Tech desde o início.Infelizmente não sou de escrever feedbacks pros podcasts, pois, além de serem muitos, geralmente escuto-os dirigindo ou trabalhando... Mas tive que reservar um tempo para escrever sobre esse episódio. Estamos tendo muitos problemas com entrega de vídeos pros usuários dos nossos sites... E com o player que escolhemos. Acredito que esse episódio nos ajudará em muito... Valeu pelo belo conteúdo, não só desse episódio! ;D"},{"author":"Paulo Silveira","comment":"Kleber, muito bom saber que um episodio nao foi apenas enriquecedor a titulo de curiosidades, mas pode vir a ajudar o trabalho de alguem!"},{"author":"William R. Fernandes","comment":"Parabéns!Mercado de stream é meio obscuro e entender um pouco do que a Globo faz, ajudou a tirar algumas dúvidas!!!!"}]}