{"title":"HTTP/2: magia com o novo protocolo – Hipsters #13","releaseDate":"11/10/2016","tags":["front-end","infraestrutura","Podcast","programação","web"],"people":["Paulo Silveira","Sergio Lopes","Mauricio Linhares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=449%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D449&t_u=https%3A%2F%2Fhipsters.tech%2Fhttp2-magia-com-o-novo-protocolo%2F&t_e=HTTP%2F2%3A%20magia%20com%20o%20novo%20protocolo%20%E2%80%93%20Hipsters%20%2313&t_d=HTTP%2F2%3A%20magia%20com%20o%20novo%20protocolo%20-%20Hipsters%20%2313%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=HTTP%2F2%3A%20magia%20com%20o%20novo%20protocolo%20%E2%80%93%20Hipsters%20%2313&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Davis Peixoto","comment":"Ótimo podcast como sempre!Mas qual é o nome da música do começo (depois de eye of the tiger)??"},{"author":"Luiz Eduardo Amorim","comment":"Amo o hipsters.tech, melhor podcast para desenvolvedores que existe. Tava estudando um pouquinho de Http/2 justamente na Alura e agora achei esse podcast maravilhoso! Vida longa ao hipsters!"},{"author":"Atila Vasconcelos","comment":"Paulo, Atila o físico aqui (não é o biólogo) ;)Leciono para faculdade, além de física, assuntos de ciência da computação;hoje quando vinha vindo para aula de Redes de Computadores, estava escutando esse podcast sobre o HTTP/2; e é um dos assuntos que vou abordar durante o semestre com os alunos.gostaria de verificar contigo se posso usar teu podcast com os alunos, já que os assuntos são exatamente os que abordo em aula com eles (hoje por exemplo estamos discutindo sockets TCP e 3-way handshake).a ideia é solicitar aos alunos que escutem o podcast, para mais para o final do semestre tentarmos alguma implementação do HTTP/2.todos os episódios do hipsters.tech são excelentes (estou escutando eles em modo TCP: todos, em ordem e sem repetição ;)continuem assim que está ótimo!"},{"author":"Tiago Nunes","comment":"\"O sera que meu cookie ta muito grande?\" cara como eu sou idiota, #EuRi =|"},{"author":"Augusto Santos","comment":"Ótimo podcast, conteúdo excelente. Parabéns."},{"author":"Bruno Oliveira de Alcântara","comment":"Muito obrigado por este conteúdo com muito valor."},{"author":"Marquinhus Goncalves","comment":"Parabéns mais uma vez, venho acompanhando muito sobre HTTP2 inclusive com o Sérgio Lopes, existe algumas pequenas barreiras para implementação mas acredito que logo muitos já terão migrado e muitos usuários estarão utilizando, também acho que muitas das coisas que ainda fazemos vamos manter como concatenação, minificação e quantidade de request mesmo talvez não tendo mais necessidade em um futuro."},{"author":"Tiago Dias","comment":"Estou meio perdido aqui tentando instalar Lets numa hospedagem compartilhada Locaweb... se alguém puder me ajudar fico muito grato."},{"author":"William R. Fernandes","comment":"Bom dia Tiago,Até onde eu sei, hospedagem compartilhadas não deixam instalar esse certificado, você precisa de acesso em SHELL e não pode ser o acesso que a Locaweb fornece para Compartilhado.Provavelmente você não vai conseguir não."},{"author":"Tiago Dias","comment":"Bom dia William, obrigado pela atenção. Então, se entendi bem, o acesso SSH que eles liberam não é suficiente? Consegui acessar via SSH depois que abri um chamado.E encontrei um client pra ajudar na instalação do Lets mas como nunca mexi com isso ainda não entendi bem como funciona -> https://github.com/Neilpang..."},{"author":"William R. Fernandes","comment":"Tiago,Fui ler o que eu escrevi e não entendi então vamos de novo! heheheExiste um link da própria LocaWeb explicando esse processo.Artigo:http://blog.locaweb.com.br/..."},{"author":"Marcelo Oguma","comment":"Muito bom pessoal! Keep it coming! Trabalho com ADCs e esse foi bem na minha praia. Mas gosto de ouvir sobre os outros assuntos pra entender um pouco de tudo. Estão de parabéns pelo trabalho! Conheci através do Nerdcast e agora assino esse podcast tb."},{"author":"Diogo Machado","comment":"Mais um excelente podcast, assunto importantíssimo. Só não encontrei ainda um módulo http2 do Apache oficial."},{"author":"Thiago Miro","comment":"Dica marota. Quem usa o Cloudflare já não precisa instalar certificado nem Lets Encrypt, nada. Basta jogar o https na URL e pronto, tudo encriptado. O Cloudflare tem uma parceria com a COMODO para distribuir certificados gratuitamente, tudo configurado no painel deles.Cloudflare é vida."},{"author":"Alexandre Fumes","comment":"Pessoal, ouvindo o podcast tenho alguma dúvida. Usar um domínio diferente para servir os assets, faz com que o navegador abra mais conexões para carregar os arquivos. No caso de usar subdominio pra mapear os assets, também atingiríamos o mesmo efeito ?"},{"author":"Paulo Silveira","comment":"tambem! a palavra \"subdominio\" é algo da nossa cabeça. para o navegador ele é um outro dominio.lembrando que no http2 já não há mais essa necessidade."},{"author":"Anthony","comment":"Agora eu fico imaginando o que isso pode causar de impacto nas novas tecnologias.Fiquei imaginando em sites quase em VR, cheio de interatividade, inovação, imagine...Podcast sensacional, já ouvi quase todos. Hipsters + Devnaestrada é meu know-how nº1[OFF] Poderiam separar um podcast para tratar de C#/.NET/ASP/Win10/Kinect/Hololens?Estou um no aguardo para ouvir de um profissional as perspectivas como programador C# FullStack na nova ideologia de expansão de mercado por parte da Microsoft, e o cenário após ela colocar em modo open source o C# e .NET e até que ponto ela poderá se tornar inovadora nas próximas tendências em grandes projetos UWP."},{"author":"Maurício Linhares","comment":"Com certeza vamos fazer sobre C# sim :D"},{"author":"Anthony","comment":"Obrigado Maurício \\o/top d+"},{"author":"Rubinho_sjr","comment":"Como sempre um ótimo cast, me sinto cada veis mais hipster com esse podcast =]"},{"author":"Philipe dos Santos Pompeu","comment":"Parabéns pelo podcast, assuntos interessantes e convidados que realmente sabem do que estão falando."},{"author":"Pedrinho Aoki","comment":"Ótimo assunto. So fiquei na dúvida se a implementação para requests http mudam muito. "},{"author":"Sérgio Lopes","comment":"Pro servidor e pro Browser muda bastante sim. Mas pra gente como dev não muda nada. Sua aplicação continua funcionando da mesma forma. As mudanças são mais internas e ficam encapsuladas nas implementações "},{"author":"Jaciel Dias","comment":"Ótimo podcast! Temas muito interessantes. Alguma coisa sobre arquitetura SAAS prevista?"},{"author":"Paulo Silveira","comment":"oi Jaciel. Queriamos um sobre modelos de negocio para saas. de arquitetura vamos ter algo em breve :)"},{"author":"benLopes","comment":"Dream Team com certeza!!Parabéns pelo podcast!!!!"},{"author":"Wilker Alves","comment":"Parabéns a todos pelo ótimo episódio. E como o Paulo mencinou esse realmente é o dream Team.Estou ancioso pelo próximo podcast😬"},{"author":"Lucas Formiga","comment":"Cara, esse podcast é incrível.Eu, sinceramente, sentia falta de um podcast desse gênero. Vocês estão de parabéns!"},{"author":"Paulo Silveira","comment":"Valeu Lucas! Esse apoio anima muita a gente"},{"author":"William R. Fernandes","comment":"Instalação realizada durante o Podcast em uma EC2 Micro.\n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n"},{"author":"William R. Fernandes","comment":"Muito massa galera!Parabéns pelo assunto, que se faz cada dia mais necessário a dica do SSL free é FODA! Eu uso no Zimbra local e faz \"mó\" sucesso hehe!<3"},{"author":"Fernando Henrique Rosa","comment":"No feed está sem o número do episódio. Foi de propósito?É que se não me engano se tiver o número fica mais fácil para o pessoal que usa leitor de tela.E eu às vezes pesquiso por número também, o que torna útil. :)"},{"author":"Paulo Silveira","comment":"Foi um erro! Valeu, corrigido"},{"author":"NA-DI-NA-EL","comment":"Excelente cast, ainda mais com essa dica dos certificados."},{"author":"Paulo Silveira","comment":"e acabei de atualizar e colocar o link!"}]}