{"title":"Bancos, Inovação e o Vale do Silício – Hipsters #18","releaseDate":"15/11/2016","tags":["business","infraestrutura","Podcast","startup"],"people":["Paulo Silveira","Marco Mastroeni","Wagner Leao","Andre Breves","Vilmar Gruettner"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=469%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D469&t_u=https%3A%2F%2Fhipsters.tech%2Fbancos-inovacao-e-o-vale-do-silicio-hipsters-18%2F&t_e=Bancos%2C%20Inova%C3%A7%C3%A3o%20e%20o%20Vale%20do%20Sil%C3%ADcio%20%E2%80%93%20Hipsters%20%2318&t_d=Bancos%2C%20Inova%C3%A7%C3%A3o%20e%20o%20Vale%20do%20Sil%C3%ADcio%20-%20Hipsters%20%2318%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Bancos%2C%20Inova%C3%A7%C3%A3o%20e%20o%20Vale%20do%20Sil%C3%ADcio%20%E2%80%93%20Hipsters%20%2318&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Natalia Cortes Torres","comment":"Paulo Silveira  Eu gostaria de obter a fonte da pesquisa citada no podcast \"se você pudesse manter somente um app no seu celular, qual seria?\" na qual o BB ficou entre as primeiras posições."},{"author":"Erisson Costa","comment":"Bacana esse cast, fui estagiário de programação do Banco do Brasil e realmente é uma empresa fantástica. Quem sabe um dia volte como Analista e volte a participar ainda mais desse mundo que é o BB."},{"author":"Arthur","comment":"Li um artigo falando que é um grande risco usar o React Native por ter uma licença duvidosa. O autor comenta inclusive que o jurídico de várias empresas recomendaram não usar essa lib/framework do Facebook justamente por ser nebulosa a relação. Fico pensando como o BB trata desse tipo de situação."},{"author":"Fábio Witt Jagnow","comment":"O link: https://dev.labbs.com.br/ está fora! Excelente papo btw."},{"author":"Ronaldo Cesar Paggi","comment":"E dalhe Cobol ❤️Muito bom ouvir este cast!"},{"author":"Thiago Guimarães Tavares","comment":"Excelente o trabalho de vocês, sigo freneticamente. O que acho mais bacana é que vocês não apenas falam sobre tecnologia. Vocês buscam pessoas que estão utilizando, quando, onde e como elas vem utilizando. Sensacional! Parabéns para todos os envolvidos."},{"author":"Everton Alves","comment":"Parabéns pelo trabalho! Todos os Podcasts estão excelentes. A conversa é mediada com excelência, os convidados são grandes referências e servem de  inspiração.  Aguardando ansiosamente para ouvir o próximo, obrigado por compartilhar conhecimento :)"},{"author":"Frederico Garcia Costa","comment":"@Paulo Silveira, parabéns pelo excelente podcast! Trabalho na TI do BB e posso afirmar que essa galera eh realmente mto boa! Participei recentemente do evento DevOpsDays Brasília e lá foi falado muito na dificuldade de mudar a cultura de uma organização. E vejo que no BB estamos no caminho certo. Adotando métodos ágeis,  experimentando DevOps, \"criando startups\", fazendo Hackatons, enfim..  O caminho eh longo mas estamos no rumo certo! "},{"author":"Bruno Oliveira de Alcântara","comment":"Super interessante saber que o Banco do Brasil está investindo em tecnologia e ainda enviando o pessoal para o Vale do Silício para viver novas experiências."},{"author":"Alisson Silva","comment":"Paulo Silveira na espera do episódio falando sobre comunidades de tecnologia, seus eventos e etc."},{"author":"Lucas Oliveira","comment":"Só eu que escutei vozes no fundo HAHAHAHHAHAHAH e uma respiração macabra!! caraiooooo uehuehehheu"},{"author":"Paulo Silveira","comment":"é uma comemoração tardia do Halloween!"},{"author":"JOAO JOSE MARANHAO JUNIOR","comment":"Muito bom saber que uma empresa do porte do BB pensa fora da caixinha !!"},{"author":"Fábio Valente","comment":"Que legal!Orgulho de ser Analista de TI no BB."},{"author":"Carlos Irano","comment":"Só uma consideração: o app mais bem avaliado de banco é do Itaú."},{"author":"Vilmar Grüttner","comment":"Oi Carlos, hoje, as notas na Google Play Store são BB 4,5 (681 mil avaliações) e Itaú 4,3 (508 mil avaliações). A App Store apresenta as notas da versão atual e de todas as versões - em todas as versões, onde tanto o BB com o Itaú tem mais de 35 mil avaliações cada (só para comparar, na versão atual são apenas 300 avaliações), as notas são 4 estrelas para o BB e 3,5 para o Itaú."},{"author":"Fábio Valente","comment":"👍🏿"},{"author":"Jether Canhada","comment":"Vem ser #digitau."},{"author":"Luiz Venturote","comment":"Muito bom!"},{"author":"João Antônio","comment":"Muito bom o podcast, interessante para dar uma ideia de como é forma de trabalho das grandes empresas.Paulo Silveira, por favor, faça um podcast sobre o desenvolvimento de games e como é a realidade das empresas brasileiras."},{"author":"Paulo Silveira","comment":"está na fila :)"},{"author":"Rodrigo Campos","comment":"precisa de concurso público para trabalhar no ti do bb?"},{"author":"Mário Augusto Requejo Júnior","comment":"Teve concursos para BB Tecnologia e Serviços (Cobra Tecnologia) no meio do ano passado."},{"author":"Tiago Stutz","comment":"Fala Rodrigo!É isso mesmo que o Paulo Silveira falou. Você faz concurso para escriturário para trabalhar em agência e depois busca oportunidades dentro do banco para trabalhar com TI. Eu trabalhei 2 anos em agência e hoje trabalho na TI do banco. Apesar de puxado o trabalho na agência, você aprende muito sobre o negócio bancário em si e isso é bastante útil por onde quer que você vá, além, é claro, de coletar uma porção de histórias divertidas e emocionantes que só quem já passou por agência tem.Na minha época, não havia um formato padronizado de processo seletivo para você tentar uma vaga na área de TI, então rolava uns \"Growth Hacking\" (embora essa palavra também não existia, ehhehehe) pra se conseguir ir pra lá, mas nos últimos 4 ou 5 anos o BB estabeleceu um processo interno de seleção de pessoas para a TI que funciona como uma espécie de programa de trainee. Em alguns anos houve 1 rodada desse programa, mas houve anos com 2 rodadas, dependendo da demanda. O programa é bastante interessante e é uma oportunidade legal de crescimento na carreira.Um tempinho atrás houve concurso direto para a Tecnologia, mas parece que não será mais permitido esse tipo de seleção por características da carreira bancária, que é regulada pela CLT."},{"author":"Paulo Silveira","comment":"Rodrigo, não sei direito, mas é uma mistura. para entrar no BB você presta um concurso e entra no cargo basico igual ao de todo mundo. Para ir para TI, aí começa a se mexer lá por dentro mesmo!"},{"author":"Luiz França Dos Santos","comment":"Hipster e vintage ao mesmo tempo...dá pra botar até numa propaganda do BB, kkk!"},{"author":"Paulo Silveira","comment":"se eles quiserem patrocinar a gente tá aceitando :P"},{"author":"Flavio Castro","comment":"8 minutos, parece que tem alguém chorando.:\\"},{"author":"Fanime Fartoon","comment":"hehehe ficou meio assustador/perturbador esses ruídos xD"},{"author":"benLopes","comment":"Ótimo podcast @peasilveira, parabéns..."},{"author":"Pedrinho Aoki","comment":"Parabéns pelo podcast Paulo. Interessante saber como que grandes empresas ( banco do Brasil) incentivam o desenvolvimento tecnológico das áreas de ti."},{"author":"Augusto Sandim","comment":"Muito bom o seus podcasts "},{"author":"João Henrique Barbosa","comment":"@peasilveira, por favor, façam um podcast sobre Python e Django! Ou só sobre Python! Amo vocês <3"},{"author":"Paulo Silveira","comment":"valeu Joao Henrique :). Fá-lo-emos!"}]}