{"title":"Startups, Cubos e Coworking – Hipsters #15","releaseDate":"25/10/2016","tags":["Podcast","startup"],"people":["Paulo Silveira","Rodrigo Dantas","Diego Latorieri","Danilo Oliveira"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=509%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D509&t_u=https%3A%2F%2Fhipsters.tech%2Fstatups-cubos-e-coworking-hipsters-15%2F&t_e=Startups%2C%20Cubos%20e%20Coworking%20%E2%80%93%20Hipsters%20%2315&t_d=Startups%2C%20Cubos%20e%20Coworking%20-%20Hipsters%20%2315%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Startups%2C%20Cubos%20e%20Coworking%20%E2%80%93%20Hipsters%20%2315&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Roger Albino","comment":"Eae pessoal, blz? Tô curtindo muito os casts. Queria ouvir pela minha tv ( com chromecast ) será que tem alguma forma de passar isso pra tv?"},{"author":"Paulo Silveira","comment":"instala esse no seu android e joga pro chromecast!https://play.google.com/sto..."},{"author":"Sgenio","comment":"Boas Pessoal! O pod está bastante interessante. estão num bom caminho. Parabéns."},{"author":"Marquinhus Goncalves","comment":"Não conhecia e acabei de me inscrever, vou acompanhar de perto e tentar ir para conhecer, aprender e quem sabe empreender. Parabéns por mais esse episódio."},{"author":"Rubinho_sjr","comment":"O legal de ver as vagas é que da pra ver as tendências do mercado brasileiro quanto ao que as empresas buscam nos profissionais...O chato é que eu não conheço quase nenhuma das linguagens em um nível aceitável :/ Preciso me especializar mais =]"},{"author":"Rubinho_sjr","comment":"Mano que loco esse cast. Eu passei um tempo pesquisando um lugar assim. Parabéns o/"},{"author":"Redley","comment":"Gostaria de dar uma sugestão, fazer podcasts sobre desenvolvimento de jogos, sobre otimização, ferramentas, ou até mesmo o mercado em si."},{"author":"Fabricio Panhan Costa","comment":"Adorei o podcast e por coincidência recebi um link de uma matéria fazendo um mapeamento das startups brasileiras.https://medium.com/codando/..."},{"author":"Paulo Silveira","comment":"só faltou o hipsters/caelum/alura na educacao ai :)"},{"author":"Fernando Boaglio","comment":"Muito bom podcast... tem também a incubadora da Telefonica chamada Wayra, com certeza tem coisa boa lá http://wayra.co/br"},{"author":"Artur Veiga","comment":"Parabéns pelo podcast Paulo Silveira , a ideia do cubo é sensacional !! Que essa ideia vá para mais estados."},{"author":"Jhonatan Morais","comment":"HAHA show de bola. vlw Paulo.Agora essa starting do PlayStation 1 no meio do audio foi nostaugico hein. kkkkk"},{"author":"Filipe","comment":"Bom sonhar não custa nada enfim, queria solicitar dois temas: Segurança da informação e Sistemas Embarcados (IOT) o primeiro tema está em alta com vários DDOS rolando mundo afora, criptografia dos mensageiros e etc... e IOT acho que seria um tema legal, pra fugir um pouco do desenvolvimento web."},{"author":"Eric Hayashi","comment":"Parabéns pelo podcast Paulo Silveira e equipe! Muito bacana ouvir mais sobre o Cubo e suas iniciativas. Acho que seria legal trazer o Pedro Waengertner da ACE, Flavio Pripas do Cubo e o André Barrence do Campus SP para um papo =D"},{"author":"Paulo Silveira","comment":"Eric, desde já eles estão mais que convidados! Quero ver se terão agenda!! :)"},{"author":"Eric Hayashi","comment":"É, agenda é sempre um complicador rs. Quem sabe fazer um 'live' durante o CASE, ein? :)"},{"author":"Lucas Formiga","comment":"Paulo Silveira  no \"Links de ferramentas citadas e artigos\" o Cubo Coworking Itaú está como \"Cubo Coworiking Itaú\" hehe.Ótimo podcast como sempre, meus parabéns!"},{"author":"Paulo Silveira","comment":"ops! arrumado!"},{"author":"Paulo Silveira","comment":"E *muito* em breve um evento de startups e vagas :)"},{"author":"Fernando Boaglio","comment":"fale-me mais sobre isso! =)"}]}