{"title":"Xamarin: Desenvolvimento multiplataforma – Hipsters #19","releaseDate":"22/11/2016","tags":["mobile","Podcast","programação"],"people":["Paulo Silveira","Mauricio Linhares","Rodrigo Kumpera","Rafael Steil"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=558%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D558&t_u=https%3A%2F%2Fhipsters.tech%2Fxamarin-desenvolvimento-multiplataforma%2F&t_e=Xamarin%3A%20Desenvolvimento%20multiplataforma%20%E2%80%93%20Hipsters%20%2319&t_d=Xamarin%3A%20Desenvolvimento%20multiplataforma%20-%20Hipsters%20%2319%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Xamarin%3A%20Desenvolvimento%20multiplataforma%20%E2%80%93%20Hipsters%20%2319&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"César","comment":"Gostaria de comecar a usar o Xamarin e tenho um mac, eu tinha baixado o Xamarin Studio, voces aconselham a baixar o Visual Studio no lugar? Obrigado"},{"author":"Bruno Paschoali","comment":"Sim, aconselho. A ideia do VS4Mac é unificar o VS com o Xamarin Studio. A própria Microsoft recomenda a mudança, uma vez que não liberarão mais updates para o XS. Era de esperar algo a respeito depois da MS comprar o Xamarin. Não faria sentido 2 IDEs."},{"author":"César","comment":"Excelente, vou fazer o teste. Muito obrigado =D Por acaso você é desenvolvedor de apps utilizando o Xamarin? Como sou iniciante, ainda mais no C#, estou meio perdido.. Se tiver algum conselho de algo pra seguir.. Obrigado"},{"author":"Bruno Paschoali","comment":"Olá.Sou desenvolvedor .NET há 2+ anos e tenho estudado Xamarin.Forms. Você deve ter notado que há desenvolvimento Xamarin e o Xamarin.Forms é uma toolkit de abstração de código e de interfaces gráficas, possibilitando 100% de desenvolvimento C# compartilhado entre as plataformas (Android/iOS/Windows Phone), trabalhando com APIs nativas.Enfim, você tem Alura? Eles têm um curso excelente de 4 partes de Xamarin (estou fazendo a terceira parte. Também recomendo esse livro gratuito de Xamarin Forms:https://developer.xamarin.c...E o que mais você precisar e eu puder ajudar, pode contar comigo. Ou por aqui, ou pelo e-mail bpaschoali@gmail.com"},{"author":"Alex Bispo","comment":"Muito bom! Gostaria de sugerir um episódio sobre Desenvolvimento Mobile Nativo: Como está o mercado? Dicas para quem está começando ou pra quem é desenvolvedor web e quer se aventurar no mudo mobile (como eu rsss)...ect. Vlw e abraços."},{"author":"Bruno Paschoali","comment":"Fala Alex. Eles acabaram de lançar um podcast sobre desenvolvimento Android. Vai lá dar uma ouvida :)"},{"author":"Augusto Santos","comment":"Ótimo podcast. Só tenho uma observação, foi dito que é necessário um Mac em rede para dar build para SOs da Apple. O que não foi dito, e que considero essencial pra quem está começando, é que é possível dar build para dispositivos Apple com um Mac OS rodando numa máquina virtual no windows. O contrário também vale para Windows rodando numa máquina virtual no Mac onde é possível desenvolver para dispositivos rodando windows."},{"author":"Paulo Pompeu","comment":"ximian, evolution e mono. Foi proposital a sequencia?! rs"},{"author":"Eduardo Vital","comment":"Fiquei decepcionado por terem ao lado um dos desenvolvedores do Xamarim, falarem do Mono, mas não perguntarem qual a perspectiva da Xamarim e Microsoft para o suporte ao Linux, principalmente agora com a liberação do Visual Studio para Linux."},{"author":"Marquinhus Goncalves","comment":"Não conhecia e nunca tinha ouvido falar de Xamarin, foi demais o Podcast porque além de conhecer pude me aprofundar, não sou exatamente dessa área de desenvolvimento de app's mas acho essencial estar por dentro de alguns relacionados a desenvolvimento web. Conteúdo muito rico. Valeu pelo Podcast."},{"author":"Bruno Paschoali","comment":"Vale lembrar que agora temos o Visual Studio for Mac. Assim, desenvolvedores podem utilizar essa IDE ao invés do Xamarin Studio caso prefiram."},{"author":"Bruno Oliveira de Alcântara","comment":"Com certeza outro ótimo podcast. Aguardando ansiosamente o episódio #20."},{"author":"Serradura","comment":"Mais um podcast excelente, vou priorizar o curso do Xamarim no Alura para refinar o meu entendimento!Aproveitando... O Basecamp 3 utiliza essa abordagem multiplataforma e foi por isso que eles desenvolveram o Turbolinks 5.No último Sábado (19/11/16) fiz uma palestra abordando o uso do Turbolinks e os porquês dele do ponto de vista técnico e de negócios. Segue o link da gravação: \n\n\nReproduzir\n\n\n Ocultar\n\n\n\n\nAbraço e parabéns a todos por esse conteúdo relevante e de qualidade!"},{"author":"André Luis Gomes","comment":"Xamarin.. obrigado pelo Calabash :heart"},{"author":"Lucio","comment":"Ótimo cast. Seria bom ouvir uma comparação com o Multi-OS Engine, que segue mais ou menos o mesma linha mas usando java,  da Intel e que foi doado para a Apache. https://multi-os-engine.org"},{"author":"Prof. Ed - ED1rac","comment":"Em determinado momento do cast foi falado sobre grandes jogos mobile que usam Unity e acho que o maior exemplo é o Hearthstone da Blizzard, uma das maiores softhouses do mundo. No caso específico do Hearthstone, o desenvolvimento em Unity possibilitou o lançamento simultâneo para várias plataformas diferentes (no lançamento, já saiu para PC e iOS, no iPad).A propósito, parabéns pelo cast!Não sei se já perguntaram e responderam, mas qual a música de abertura do cast?Alguns links:https://unity3d.com/pt/show...http://unity3diy.blogspot.c...http://hearthstone.gamepedi..."},{"author":"Paulo Silveira","comment":"exclente info Ed!A musica de abertura foi criada especialmente pro podcast, pelo Pedro Lopes, do www.musicdot.com.br"},{"author":"Prof. Ed - ED1rac","comment":"Isso é um ponto positivo para quem tem vontade de assinar o musicdot! Gosto muito da música. Ele tem a versão completa disponibilizada ou só o trecho do início do cast mesmo?Abraço e parabéns pelo trabalho!"},{"author":"Philipe dos Santos Pompeu","comment":"Ótimo podcast, no aguardo por mais podcasts sobre .Net :)"},{"author":"Vinicius Gonçalves","comment":"Quando vocês falaram sobre onde desenvolver foi citado o Visualstudio para Windows e o Xamarin Studio para o Mac. Pra quem usa Linux, existe algum ambiente de desenvolvimento, ou vocês pularam ele porque realmente não existe e eu não peguei a indireta? kkkkParabéns pelo podcast, chegou em uma hora boa pra mim."},{"author":"Jeferson Martins Bruno","comment":"Você pode usar o MonoDeveloper, mas não estou sendo se ele tem os sdks da xamarin, mas vai poder programar o C# no linux."},{"author":"Maurício Linhares","comment":"Infelizmente não, a Xamarin ainda não dá suporte pra Linux. Esquecemos de falar isso."},{"author":"Renan Duarte","comment":"Xamarin ou IONIC ? Tenho essa duvida. E outra, tem o aurelia chegando ai tbm gostaria q vcs falassem a respeito se possivel."},{"author":"Carlos","comment":"Ionic roda em uma WebView. Xamarin gera uma aplicação com componentes nativos. Xamarin é perfeito quando você precisa de uma performance nativa para aplicativos que demandam frame rate alto. Ionic acelera o processo de prototipação e te deixa muito produtivo, inclusive aplicando layout adaptado (e muito bonito) de acordo com a plataforma.Tutorial completo sobre Ionic 2 e Angular 2: tableless.com.br/criando-um..."},{"author":"Rubinho_sjr","comment":"Caramba to terminando um sistema web agora e estava pensando em aprender Xamarim pra criar o app dele, ai vcs soltam um cast desses assim. Best timing ever.Excelente cast, deu realmente muita vontade de começar a desenvolver com essa plataforma."},{"author":"Mayck Xavier","comment":"Achei bem interessante o tópico. Sempre fui um pouco contra, mas agora assumindo a frente de mobile e sendo o único desenvolvedor de uma empresa eu vejo o Xamarin como uma boa estratégia.Farei o curso do Alura e vejo se é a melhor solução para o meu caso."},{"author":"Lucas Marciano","comment":"Para esse programar ficar melhor, deveriam ter colocado alguem que levante a bandeira do nativo, só para gerar um discursão sobre esse assunto."},{"author":"Bruno Oliveira de Alcântara","comment":"Ótima idéia Lucas."},{"author":"Carlos","comment":"Xamarin gera código nativo. Não é híbrido."},{"author":"Lucas Marciano","comment":"Eu to ligado, mas existe as pessoas que são da cultura nativa e outros da cultura híbrida ... e essas discussões são muito boas. E pelo que eu entendi no programa, o Xamarin é uma plataforma de desenvolvimento híbrido, se ele gera códigos nativos, já são outros termos, pelo menos é isso que eu acho."},{"author":"Carlos","comment":"É porque a terminologia \"híbrida\" é utilizada quando nos referimos à aplicativos baseados em WebView (página web) que \"simulam\" uma aplicação com componentes nativos utilizando HTML5 - o que não é o caso do Xamarin. O Xamarin utiliza C# e compila para o código de máquina da plataforma em questão (Android / iOS). Ou seja, evita que a pessoa tenha que aprender duas linguagens diferentes (Obj-C e Java) caso queira desenvolver para as duas plataformas. Nesse caso específico, existem grupos que são contra o Xamarin simplesmente porque não enxergam (ou fingem não enxergar) o valor de se ter uma base de código única para desenvolvimento. Eles acham que aprender a linguagem \"oficial\" da plataforma é o melhor caminho.Achei que a discussão que você estava propondo era a clássica: Devemos insistir no desenvolvimento nativo à todo o custo (Obj-C, Swift, Android) ou devemos abraçar a produtividade da web e desenvolver aplicativos híbridos (Cordova, Ionic, Framework7, Quasar Framework, Onsen UI)?"},{"author":"Lucas Marciano","comment":"Sei, massa ... eu sou da bandeira dos 'nativos', mas entendo perfeitamente e respeito o poder dessa plataforma. Esse meu ponto de vista é por opção própria, mas quero muito aprender a usar o Xamarim no futuro."},{"author":"Renan Duarte","comment":"boa cara... seria uma boa ideia colocar isto em discussao"},{"author":"Eduardo Medeiros Branquinho","comment":"Não sei se faz sentido, mas a compra do Xamarin pela MS e consequente liberação free para uso, é uma última tentativa da MS para ter mais apps no windows phone. Afinal de contas, se o código que você fez para sua app é 90% compatível com o windows phone por exemplo, e só falta aqueles 10% de coisas nativas que você precisa, talvez os devs o façam e já deixem disponíveis pra windows phone."},{"author":"Maurício Linhares","comment":"Difícil, eles já desistiram do Windows Phone, não tem mercado nem espaço e escrever a app não é problema, manter ela é que é. Duvido muito que Windows Phone volte dos mortos."},{"author":"Mayck Xavier","comment":"Acho que a intenção da Microsoft é avançar no mercado com o Windows como SO para desenvolvimento de software. Eles só ganham mesmo em .NET por que muitos desenvolvedores usam Mac e Linux. A adição do Bash no Windows mostra isso também."},{"author":"Welton Vaz de Souza","comment":"Parabéns por mais um podcast fodístico, apesar de não gostar do Xamarin e do Mono, tenho incentivado o uso dos mesmos na escola que trabalho(Suporte Técnico). Para uso dos alunos, acho o Android Studio muito pesado, as solução para iOS no GNU/Linux são ruins, e por desenvolver para ambas as plataformas com pouco mudança de código e principalmente pela licença de USO menos restritiva. É também meu muito obrigado pela qualidade das aulas, sou estudante do Alura! E um abraço especial de agradecimento pelo NerdTech e Nerdologia Especial para o Paulo Silveira e Equipe do Alura!"},{"author":"Paulo Silveira","comment":"valeu o apoio Welton :)"},{"author":"Mateus Paulo","comment":"Muito bom! Parabéns."},{"author":"Cleiton","comment":"Pocha bacana o assunto (apesar de ter parecido um pouco de jaba do xamarin) Mas foi bem interessante, tenho um amigo de trabalho que trampa com .net e no ano passado ele iniciou um projeto mobile em cordova por que o xamarin era menos acessível pra quem tava começando acredito que se fosse como ele é hoje o meu amigo teria dado continuidade no projeto no xamarin. Já eu sou javeiro e pra mim não acho que valeria a curva de aprendizagem, mas claro isso é de pessoa pra pessoa."},{"author":"Anthony","comment":"Obrigado por ter trago este assunto no Hipsters.Quase chorei nesse podcast, após me formar, a microsoft foi a primeira empresa que comecei a fazer perspectivas de marketing. E deu certo!Antes do Windows 10, avaliando de 2012 até o atual momento, não me arrependo de ter escolhido C#.Até a XBOX deslanchou o Playstation HAHAHATa maravilhoso essa reviravolta cara <3Falta agora Hipsters com ASP MVC + seus Frameworks + entrevistas com profissionais que trabalhem em empresas que utilizam C# para trazer mais visões de mercado e possibilidades que a linguagem oferece.Agora ....C# UWP All-In-Oneem visão de expansão, C# é a linguagem atualmente mais abrangente de todas."},{"author":"Welton Vaz de Souza","comment":"Vc esta de sacanagem trazendo a Guerra para o melhor podcast de tecnologia do País. M$ não faz nada de graça, só pensa no lucro e na dominação mundial! :-)O dia que Xb.... + Tema do Nerdcast 542, rodar games na resolução 4K (Ultra HD) ai vc pode falar alguma coisa,  C# é a maior sacanagem. Quero ver um Hipster falando dos custos de usar ASP MVC + seus Frameworks e também dos aspectos de segurança"},{"author":"Bruno Paschoali","comment":"Anthony tem razão, caro Welton Vaz de Souza . É claro que a Microsoft continua como uma empresa capitalista, mas Satya Nadella está destruindo todo o legado do Steve Ballmer e transformando a Microsoft em uma empresa muito mais humana. A Microsoft agora é até Linux Foundation Platinum Member."},{"author":"Anthony","comment":"em qual ano você parou para dar essa resposta em 2016?lamento mas é uma resposta com pensamentos bem antigos, digamos em época de 2010/11assista aos eventoshttps://channel9.msdn.com/E..."},{"author":"Lucas Formiga","comment":"Opa, acabou de ser lançado <3"}]}