{"title":"NoSQL: por quê? – Hipsters #22","releaseDate":"13/12/2016","tags":["infra","infraestrutura","Podcast"],"people":["Paulo Silveira","Mauricio Linhares","David Paniz","Gleicon Moraes"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=566%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D566&t_u=https%3A%2F%2Fhipsters.tech%2Fnosql-por-que-hipsters-22%2F&t_e=NoSQL%3A%20por%20qu%C3%AA%3F%20%E2%80%93%20Hipsters%20%2322&t_d=NoSQL%3A%20por%20qu%C3%AA%3F%20-%20Hipsters%20%2322%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=NoSQL%3A%20por%20qu%C3%AA%3F%20%E2%80%93%20Hipsters%20%2322&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Ysmael Marinho","comment":"Muitas dúvidas esclarecidas neste podcast"},{"author":"Dexter Gandini","comment":"Vocês também bombaram em analise rsrs? Busca em um chave valor dado um hash é O(1) =)"},{"author":"Flavio Neves","comment":"Show! Poderia fazer um agora falando sobre banco de dados relacional"},{"author":"Г-н Bertoni","comment":"O e-commerce da Leroy Merlin é em MongoDB ;)"},{"author":"Gisele Zomer Rossi","comment":"Muito bom!!! Amigos, estamos começando um projeto novo e estamos na dúvida sobre colocar relatorios em procedures no banco (melhor desempenho) ou fazer na aplicação. Gostaria da opnião de vcs. Obrigada"},{"author":"Fabio Telles Rodriguez","comment":"Seria interessante mostrar que os bancos de dados relacionais tem extensões não relacionais faz um bom tempo. Particularmente o PostgreSQL possui o tipo de dados Hstore que é um campo chave valor dentro de uma tabela relacional há bem uns 5 anos. Há uns anos tem também o tipo JsonB onde tem tipos de dados do tipo Json com uma excelente indexação e funções embutidas.No entanto, além da questão do particionamento horizontal, os bancos de dados NoSQL utilizam o armazenamento colunar, enquanto os bancos de dados relacionais utilizam o armazenamento orientado a linhas. De fato temos bancos de dados diferentes para problemas bem diferentes. Bancos de dados hierárquicos são um pesadelo para as bases relacionais, e soluções NoSQL são maravilhosas nisso."},{"author":"Mario Junior","comment":"Muito bom, um dos melhores episódios tecnicamente.David Paniz  / Maurício Linhares   / @Gleicon : Vcs já deram uma olhada no RethinkDB? Eles tem uma página bem grande sobre suas diferenças em relação ao MongoDB, e parece ser beeeem interessante, principalmente em relação a escabilidade horizontal.Abs."},{"author":"Maurício Linhares","comment":"Nunca usei ele, mas li a respeito. A situação hoje é meio complicada, dado que a equipe foi pra Stripe e não se sabe se vão manter o banco (o site parece estar fora do ar e não tem muito movimento nos repos do github). Não recomendaria usar ele no momento."},{"author":"Juscilan Moreto","comment":"\"No NoSql, o Schema continuará existindo, porém controlado apenas pela App\"  - Muito bom."},{"author":"Sergio Leite","comment":"Pessoal, apenas uma pequena correção: O \"Vector Clock\" proposto por Lamport, apesar de ter a palavra \"clock\", não utiliza horários propriamente dito, mas contadores que são incrementados em uma unidade a cada alteração no dado."},{"author":"Paulo Silveira","comment":"valeu a adicao sergio!!!"},{"author":"well","comment":"Tem algum curso de mongo no alura?"},{"author":"Maurício Linhares","comment":"tem sim: https://www.alura.com.br/cu..."},{"author":"BAMBAM ✅","comment":"Muito bom, entrou pra minha lista de podcasts semanais"},{"author":"Matheus Oliveira","comment":"Hoje o mongodb dá suporte a Join e Aggregation via $lookup https://docs.mongodb.com/v3..."},{"author":"David Paniz","comment":"Oi Matheus, Ótima dica, só toma cuidado que apesar do MongoDB suportar \"joins\" com o $lookup, pelo menos por enquanto, o intuito é apenas para ajudar em operações analíticas e não deve ser uma \"muleta\" para sua aplicação.No post abaixo você pede encontrar \"Most of the time all the data for a record tends to be located in a single document. For the operational application, accessing data is simple, high performance, and easy to scale with this approach.When it comes to analytics and reporting, however, it is possible that the data you need to access spans multiple collections.\"https://www.mongodb.com/blo...Falei sobre isso numa apresentação que fiz sobre modelagem de relacionamentos em documentos"},{"author":"Matheus Oliveira","comment":"Legal David, muito obrigado pela resposta e explicação. Tem o link dessa apresentação?Abraço."},{"author":"David Paniz","comment":"Oi Matheus, a gravação está disponível no youtube em \n\n\nReproduzir\n\n\n Ocultar\n\n\n\n\n"},{"author":"Matheus Oliveira","comment":"Obrigado, David."},{"author":"Marcello Patto","comment":"Ainda não havia o Firebase no dia em que gravaram esse Podcast? Eu estou começando a usar o Angular2 e Firebase. O que dizem dessa combinação?"},{"author":"David Paniz","comment":"Honestamente nunca usei o Firebase. Ele também é dessas soluções de armazenamento como serviço, a grosso modo é bem semelhante ao DynamoDB, mas hospedado pelo Google. Tem boa parte das vantagens e desvantagens que comentamos sobre ele. A combinação por si só parece ok, mas o importante é entender como vai armazenar e como vai buscar seus dados para então escolher a melhor solução. Isso é tão importante que o segundo parágrafo da documentação deles é justamente sobre isso:\"Building a properly structured database requires quite a bit of forethought. Most importantly, you need to plan for how data is going to be saved and later retrieved to make that process as easy as possible.\"https://firebase.google.com..."},{"author":"Fabrício Cabral","comment":"Muito bom o podcast! Só uma pequena correção na página: o nome correto é Memcached e não Nemcached!"},{"author":"Paulo Silveira","comment":"feito! :)"},{"author":"João Ângelo","comment":"Muito bom o podcast como sempre mas por favor coloca um target _blank nos links. rsrssr"},{"author":"Marcelo Boeira","comment":"Voltagem não, tensão. :)"},{"author":"Tarcísio Z. Ferraz","comment":"Melhor podcast <3"}]}