{"title":"Acessibilidade web – Hipsters #21","releaseDate":"06/12/2016","tags":["front-end","Podcast","web"],"people":["Paulo Silveira","Sergio Lopes","Alexandre Costa","Reinaldo Ferraz"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=579%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D579&t_u=https%3A%2F%2Fhipsters.tech%2Facessibilidade-web-hipsters-21%2F&t_e=Acessibilidade%20web%20%E2%80%93%20Hipsters%20%2321&t_d=Acessibilidade%20web%20-%20Hipsters%20%2321%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Acessibilidade%20web%20%E2%80%93%20Hipsters%20%2321&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Lucas Ribeiro","comment":"Muito bom o conteudo!"},{"author":"Gustavo Pierre","comment":"Excelente o tema e a forma de abordá-lo. Tenho meio que escutado os podcasts de trás pra frente, dando preferência aos assuntos que mais me identifico e esse é um deles. Parabéns."},{"author":"Davis Peixoto","comment":"Chegando um pouco atrasado na discussão mas...Ótimo episódio, ótima abordagem do tema. E fica aqui uma dica para acessibilidade visual:http://paletton.com/No site acima, você pode compor paletas de cores e usar a função de simulação visual para escolher qual o tipo de deficiência visual vc gostaria de simular (existem vários tipos de daltonismo). Assim você consegue criar uma paleta com cores mais eficientes, ou escolher contrastes de forma mais acessível."},{"author":"João Vitor","comment":"Paulo Silveira  Poderia ter um curso na Alura ajudando quem é iniciante nessa área, ensinando boas técnicas e usabilidade, seria show de bola."},{"author":"Renê Fernandes","comment":"Agora tem: https://www.alura.com.br/ca..."},{"author":"Fernando Seguim","comment":"Uma boa alternativa de leitor de tela, para usuários do chrome é o ChromeVox, funciona muito bem pra quem desenvolve web. E não tem um áudio não tão robotizado! ;)"},{"author":"Bruno Tomé","comment":"Faltou o atributo aria-hidden=\"true\" em ícones como os do font-awesome por exemplo. O leitor de tela irá ignora-lo."},{"author":"Cleison Silfer","comment":"Gostei bastante desse episódio. Acho um tema muito válido que é pouco discutido.Deixo aqui minha contribuição com algo que não é voltado pra web, mas pra permitir que pessoas usem a tecnologia: Um teclado para pessoas com baixa (ou nenhuma) coordenação motora:http://tix.geraestec.com.br/Vale conferir "},{"author":"Felipe Borde Rodrigues Lima","comment":"Muito bom esse podcast!Aproveitando para pegar umas dicas, pois será o tema do meu TCC.Parabéns e obrigado."},{"author":"Marquinhus Goncalves","comment":"Ter esse tema em um podcast é sensacional, gostei muito e 2 pontos que achei marcantes foi o que o Paulo diz que a mudança para uma melhor acessibilidade ajudaria a todos não só quem tem algum tipo de deficiência e tb a parte que o Reinaldo sempre fala qdo palestra sobre o assunto que é a Acessibilidade fazer parte desde o início dos projetos. Parabéns galera."},{"author":"Jose Vieira Neto","comment":"Òtimo cast ! Paulo Silveira quando é que vai rolar um podcast sobre Kotlin? Abraço sucesso!"},{"author":"Paulo Silveira","comment":"valeu Jose Vieira! Acho Kotlin muito especifico, talvez quando formos ter um de varias linguagens \"novas\", que acha?"},{"author":"Jose Vieira Neto","comment":"Ia ser irado algo do tipo ;)"},{"author":"Thiago Guimarães Tavares","comment":"Esse cast foi de explodir o cérebro sensacional!"},{"author":"Victor Correia da Conceição","comment":"Ótimo cast o conteúdo e as dicas são de grande importância para nós."},{"author":"PotHix","comment":"Æ!!Ótimo episódio, parabéns! Vocês estão mandando muito bem! :)Só para constar, o recado do: \"para você que está ouvindo o podcast em 3x\" caiu certinho para mim. hahahaHá braços--PotHIx"},{"author":"Bruno Oliveira de Alcântara","comment":"Gostei bastante do podcast dessa semana. Ótima dica do Sérgio quanto ao uso do H1, H2, sem pular por questões de layout. Parece coisa boba, mas acabamos fazendo sem perceber o quanto isso faz diferença."},{"author":"Gabriel Darezzo","comment":"Rolou uma issue no github sobre o assunto:https://github.com/frontend..."},{"author":"Raul Felipe de Melo","comment":"Paulo, o link do Freedom Scientific está direcionando para o nvaccess.org"},{"author":"Paulo Silveira","comment":"valeu raul! corrigido"},{"author":"Flavio Castro","comment":"Ótimo cast, passar essas dicas pro meu portfólio."},{"author":"Kleber Kihara","comment":"Mais um conteúdo de ótima qualidade e de extrema relevância. ;)Apesar de ter muitos anos de experiência na área, confesso que ainda peco quando a questão é acessibilidade... E tenho que fazer mais um \"mea culpa\", porque já pesquisei sobre o assunto e nunca fui tão afundo. Empregando apenas algumas coisas básicas, que geralmente são mais por questão de SEO do que acessibilidade.Parabéns, como sempre!"},{"author":"Heitor Marques","comment":"Desde que ouço podcasts sentia falta de um que discutisse tecnologia da maneira como vocês fazem, abordando os cenários de quem produz e mantém TIC e não dos consumidores das modinhas. A seleção que fazem é sempre com feras, excelente! Sou especialista em infraestrutura da data center e atualmente tenho me dedicado a backup com TSM - uma universidade por si só. Espero que logo tragam o tema backup/DRM e outros que curto muito como NGF/IPS, 802.11x e filtros de rede. Parabéns, fiquei fã!"},{"author":"Paulo Silveira","comment":"valeu Heitor! Isso anima muito a gente. seus topicos são bem avançadinhos, vamos ver onde chegamos!"},{"author":"Heitor Marques","comment":"Conheço algumas pessoas na Palo Alto, lider no Gartner em NGF, caso precisem. Convida alguém de lá, será muito massa."},{"author":"Eduardo Medeiros Branquinho","comment":"E essa música do Demolidor, o nosso herói favorito, que é cego hahahaha Eu vi o que você fez ai."},{"author":"Paulo Silveira","comment":"eu percebi tambem. nao fui eu, foi o Thiago Miro!"},{"author":"Gabriel Ariza","comment":"www.w3.org Esta com um design totalmente ao contrário do que foi falado, será que não estão com um site depreciado ?"},{"author":"Paulo Silveira","comment":"Você pode fazer um teste do seu site aqui: http://wave.webaim.org/repo...  E realmente há alguns warnings e erros! Como todos os sites :)"}]}