{"title":"Indie Games – Hipsters #24","releaseDate":"27/12/2016","tags":["games","Podcast","programação"],"people":["Paulo Silveira","Mauricio Linhares","IndieCast","IndieCast"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=631%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D631&t_u=https%3A%2F%2Fhipsters.tech%2Findie-games-hipsters-24%2F&t_e=Indie%20Games%20%E2%80%93%20Hipsters%20%2324&t_d=Indie%20Games%20-%20Hipsters%20%2324%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Indie%20Games%20%E2%80%93%20Hipsters%20%2324&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"João Vitor Paul","comment":"Não ta dando pra ouvir o podcast :("},{"author":"Marquinhus Goncalves","comment":"Parabéns pelo Podcast esse episódio me fez lembrar de quando vi computador pela primeira vez, só o DOS rodando e me mostraram o jogo Prince of Pérsia, mesmo desde novo sempre tendo contato com computador e amar tecnologia joguei muito pouco game na adolescência  e logo depois nunca mais joguei, é estranho um programador que não joga nada rsrs gostei do Podcast porque rodaram por indicações de jogos com overview e um pouco de história também."},{"author":"NA-DI-NA-EL","comment":"Excelente programa, é meio complicado dizer que ta melhorando, pq já começou excelente. Pra nossa sorte, Tecnologia está associado a quase tudo, o q abre muitas possibilidades."},{"author":"Victor Yuji Maehira","comment":"hehehehe... muito bom o podcast! Parabéns turma!Joguei muito Doom e Duke Nukem com o Paulinho via linha discada em meados de 95. Eu me achava o máximo com meu 486 DX2-66Mhz modem de 14.4Kbps. Deixava a linha ocupada e minha mãe não entendia porque minhas tias não ligavam mais em casa rs.Outros jogos que me dão muita saudade: Heretic, Rise of the Triad, Day of the Tentacle, Full Throttle entre outros.Lembro também do saudoso mundo das BBSs (bulletin board system) que ajudou a popularizar os sharewares."},{"author":"Luiz Santos","comment":"To ouvindo meio atrasado o podcast, Como desenvolvedor de jogos tem vários outros motivos do pq o Unity é muito mais usado em indies do que outras engines:- A unity sempre teve um preço muito abaixo e ficou free muito antes das outras engines ( democratização da tecnologia )- Como dito, a comunidade foi uma grande vantagem pra eles. Desde o início eles investiram muito nisso- Usar c# não foi por acaso. O grande \"concorrente\" do Unity na época era o XNA que também utilizava c#. Fazer a migração foi bem mais fácil usando a mesma linguagem :)"},{"author":"Bruno Oliveira de Alcântara","comment":"Muito bom o podcast, já indiquei para amigos que curtem indie games."},{"author":"Marc Silden","comment":"Goat Simulator não é da Bossa Nova Studios, gente! Oxe! u_ú"},{"author":"Paulo Silveira","comment":"eita, nao lembro de a gente ter falado isso no episodio"},{"author":"Murilo Wippel","comment":"dogras"},{"author":"Anthenor Júnior","comment":"Como vcs falam de Minecraft e não citam Dwarf Fortress? https://www.wired.com/2013/..."},{"author":"Fernando Dias Motta","comment":"Como não gostar do Journey"},{"author":"Fernando Boaglio","comment":"Muito bom podcast! Conheci o Bastion e outros games indies no https://www.humblebundle.com , onde você compra vários jogos para várias plataformas e paga o quanto quiser. Minha sugestão de game indie é o Amnesia (http://www.amnesiagame.com) , é no estilo survival horror que eu gosto, ala Silent Hill / Resident Evil."},{"author":"Giovane","comment":"Faltou citar que o co-fundador da Bossa Studios (Dev do Surgeon Simulator), Henrique Olifiers, é brasileiro e fez tanto sucesso la fora quanto a galera da Behold Studios."},{"author":"Paulo Silveira","comment":"é, caberia um episódio só sobre brasileiro!"},{"author":"Jorge William Cardoso Furtado","comment":"E o Project Zomboid ??"},{"author":"Gustavo Bim","comment":"Limbo é realmente um dos melhores jogos que já joguei na vida. Sorry Paulo!!! Os desenvolvedores lançaram também o Inside, que é muito bom também.Falando sobre jogos brasileiros, existe um podcast sobre games chamado 99vidas. Eles lançaram recentemente o jogo deles feito por um estúdio brasileiro: http://99vidas.com.br/jogo/Alguns detalhes: Ele foi financiado via crowdfunding, desenvolvido em Unity e foi lançado no Steam. Em breve virá para os principais consoles."},{"author":"Paulo Silveira","comment":"baita historia Gustavo!"},{"author":"Danilo Vieira","comment":"Saudades da revista Full Games..."},{"author":"Paulo Silveira","comment":"essa é das antigas"},{"author":"João Antônio","comment":"\"Paulo Silveira, host do hipsters, que não gostou de Journey\" Vc não está sozinho eu tbm não gostei do Journey.Um jogo indie que eu joguei bastante foi o Endless Legend, muito bom, recomendo a todos!Acredito que o mercado no Brasil tem um potencial enorme e cresce a cada ano, é só perceber a quantidade de desenvolvedoras brasileiras surgindo por aí. Para conhecer um pouco mais do trabalho dessa galera segue o esse site: http://www.splitplay.com.br/pt que é uma loja (no mesmo estilo da steam) mas voltada a jogos indie."},{"author":"Maurício Linhares","comment":"Vocês são pessoas tristes :P"},{"author":"David Paniz","comment":"Além da Behold, não podemos esquecer de outro estúdio brasileiro que também está numa ótima fase, o \"Aquiris\" responsável pelo premiado \"Horizon Chase\".Além disso, na história brasileira dos Indies precisamos citar o jogo \"Dungeonland\", provavelmente o primeiro grande sucesso brasileiro no Steam, do estúdio carioca, que infelizmente já não existe mais, \"Critical\"; O jogo \"Toren\", o primeiro jogo a levantar fundos pela lei Rouanet, do estúdio \"Swordtales\". E com certeza não podemos deixar de falar da \"Hoplon\", famosa pelo MMORPG \"Taikodom\", e atualmente numa nova fase lançando o \"Heavy Metal Machines\".Existem alguns outros estúdio interessantes como \"Pigasus Games\", além de estúdios mais focados em jogos mobile, não tão \"autorais\" como a \"TFG\", \"Tapps\" e vários outros espalhados pelo Brasil."},{"author":"David Paniz","comment":"Acabei de lembrar do \"Gryphon Knight epic\" do estúdio \"Cyber Rhino Studios\" e dos designers do estúdio \"MiniBoss\" que participaram de vários jogos de destaque, incluindo o \"Towerfall\""},{"author":"Caio César Mendonca Souza","comment":"Tem o pessoal da JoyMasher também, fizeram um jogo chamado oniken e outro chamado Odallus, fizeram um barulho na mídia especializada. Pra quem se interessar : http://store.steampowered.c..., preço de pacote de bala 7 bello.O pessoal da miniBoss está trabalhando em um jogo chamado Skytorn, tive o prazer de testar a um tempo atrás e gostei do que vi."},{"author":"Sergio Rodrigo","comment":"Eu fiz graduação de Jogos Digitais na estacio de Sá, e um dos projetos no unity que fizemos foi um jogo de nave onde o tiro da nave era um \"pew\" que um dos integrantes fez com a boca mesmo, assim como outros sonzinhos do jogo kkkkkkkkkkQuem quiser jogar ta aqui o link srsrshttp://nerdindie.blogspot.c...Abçs!"},{"author":"hello world","comment":"Hahahah, muito bom!Diga-nos mais sobre a sua experiência na graduação. O que você achou? Aconselha para quem está interessado na área?"},{"author":"Sergio Rodrigo","comment":"Sim, aconselho. E um dos mais importantes é fazer amigos para fazer jogos ou não srsrsr. Fiz muitas amizades e me divertir muito (nao na hora das provas/trabalho srsrsr)Uma coisa que aprendi, algo que ja sabia, é que na produção de games, vc trabalha/estuda mais do que joga propriamente dito.Mas como sempre tive que pegar algumas cisas pro fora, mas de certa forma vale a pena sim! :)Abçs!"},{"author":"Paulo Silveira","comment":"E aí, onde estão os gamers e seus pitacos sobre indies?"}]}