{"title":"Startups, Música e Educação – Hipsters #25","releaseDate":"03/01/2017","tags":["Podcast","startup"],"people":["Paulo Silveira","Sergio Lopes","Pedro Lopes"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=638%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D638&t_u=https%3A%2F%2Fhipsters.tech%2Fstartups-musica-e-educacao-hipsters-25%2F&t_e=Startups%2C%20M%C3%BAsica%20e%20Educa%C3%A7%C3%A3o%20%E2%80%93%20Hipsters%20%2325&t_d=Startups%2C%20M%C3%BAsica%20e%20Educa%C3%A7%C3%A3o%20-%20Hipsters%20%2325%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Startups%2C%20M%C3%BAsica%20e%20Educa%C3%A7%C3%A3o%20%E2%80%93%20Hipsters%20%2325&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Felippe","comment":"Sou muito fã dos podcasts de vocês! Escuto desde o primeiro episódio! Vocês passam conteúdo de uma forma muito descontraída e objetiva. O curioso é que em várias situações aqui no trabalho pude debater sobre temas que aprendi aqui! Parabéns Paulo pela iniciativa! Sou viciado no Hipsters."},{"author":"Thyago Rezende","comment":"É o Mano Brown"},{"author":"Hector Cardoso","comment":"música topper."},{"author":"eric","comment":"Sensacional, tem o mp3 para ringtone? (^-^)"},{"author":"Gabriel Chaves","comment":"Ouvi hoje o podcast e hoje mesmo acessei o musicdot, assinei o serviço pois a Caelum e o Alura tem meu respeito. Estava pagando caro para um professor de musica e quando soube que a musicdot tem o mesmo ambiente da alura não pensei duas vezes. Parabéns pelo podcast Paulo Silveira, que desde o curso no IME da USP venho me atualizando em tecnologia através de seu legado (Caelum do qual ja fiz curso) e alura que sou assinante. E agora, na musica!"},{"author":"BAMBAM ✅","comment":"Muito bom, cada vez melhor! Parabens"},{"author":"Marquinhus Goncalves","comment":"Música é minha paixão sempre tive vontade de aprender a tocar violão mas foi com 28 anos que entrei em um conservatório e aprendi a tocar, do jeito tradicional já tive aulas em grupo e individual, nunca tive experiência em ter aulas online, mas vou testar por alguns motivos me falta tempo para os estudos presenciais e tempos para ir ao local, então acho que vale o teste. Depois do Podcast fui pesquisar por valores, realmente são bem mais em conta, mas acredito (opinião de quem ainda não testou) que o ensino presencial de instrumento seja absorvido melhor e mais rápido. Ah e para métricas... foi o Podcast que fez eu ir a pesquisa de uma escola de música online, vamos ver se o MusicDot me convence rsrs. Parabéns pelo episódio."},{"author":"Rômulo Innocêncio","comment":"Musica da hora hehehe, nostálgica =)..... \"easterEgg\" kkkkkk"},{"author":"Danilo Vieira","comment":"Perdão pela ignorância, mas Content Marketing é a mesma coisa que Inbound Marketing ?Vlw pelos Podcasts. Abraços !!"},{"author":"Paulo Silveira","comment":"Boa pergunta. Vou tentar dar um exemplo concreto: o content marketing são aqueles ebooks digitais que as pessoas oferecem, os videos com conteudo, etc. o inbound marketing é como voce vai trabalhar com os potenciais clientes que chegam até o seu site (incluindo até o seu conteudo como ebooks e videos)."},{"author":"Felippe","comment":"Sou muito fã dos podcasts de vocês! Escuto desde o primeiro episódio! Vocês passam conteúdo de uma forma muito descontraída e objetiva. O curioso é que em várias situações aqui no trabalho pude debater sobre temas que aprendi aqui! Parabéns Paulo pela iniciativa! Sou viciado no Hipsters."},{"author":"Milton Jacomini Neto","comment":"Muito legal o podcast, muito conteúdo relevante para quem tem vontade de montar sua própria startup..show!E claro, a musica completa foi bem top... parabéns aos envolvidos.. hehehe"},{"author":"Diego Nogueira dos Santos","comment":"Muito bom o podcast. Vocês estão cada vez mais de parabéns."},{"author":"Fernando Amorim","comment":"Curtir o final sempre quis ouvir essa música inteira, as vezes eu ficava ouvindo só os primeiros segundos por causa dela."},{"author":"Rodrigo Dias","comment":"Episodio Show, musiquinha já ta marcada na nossa mente.E além de tudo, vocês são inspiração de empreendedorismo e de prestação de serviço excelente ao consumidor"},{"author":"Paulo Silveira","comment":"Valeu o apoio Rodrigo!"},{"author":"Clécio Souza","comment":"Cara, mais um capitulo desse que eu espero que perdure algumas eras ^_~!Parabéns galera do hipsters, mandaram bem e com um tema que eu não esperava, muito bom o podcast, show!!"},{"author":"Gabriel Darezzo","comment":"Muito bom o bate papo.Sucesso aos Lopes xDPs: hipsters.tech estilo Marvel? hahaha"},{"author":"Cleiton","comment":"Musiquinha Show kkkk"},{"author":"Paulo Silveira","comment":"show e com muita história :)"}]}