{"title":"Presente e Futuro do .NET – Hipsters #26","releaseDate":"10/01/2017","tags":["Podcast","programação"],"people":["Paulo Silveira","Mauricio Linhares","Giovanni Bassi","Victor Cavalcante"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=639%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D639&t_u=https%3A%2F%2Fhipsters.tech%2Fpassado-e-futuro-do-net-hipsters-26%2F&t_e=Presente%20e%20Futuro%20do%20.NET%20%E2%80%93%20Hipsters%20%2326&t_d=Presente%20e%20Futuro%20do%20.NET%20-%20Hipsters%20%2326%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Presente%20e%20Futuro%20do%20.NET%20%E2%80%93%20Hipsters%20%2326&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"guilherme lourenço","comment":"Sera que rola um podcast sobre docker???? Seria show!!!"},{"author":"Jean C.","comment":"Aproveitando o ganho sobre ambiente Micro$soft (sim coloquei o $ só de zueira), faz um podcast sobre azure."},{"author":"Alair","comment":"Tem um sobre Azure no lambda3"},{"author":"RNHack","comment":"[Visual Code] - Uma coisa que já vi e senti falta foi poder abrir vários projetos no vs diferente do atom que abre independente do diretório ser diferente, as vezes quero ver algum exemplo de implementação em um projeto e usar no outro e no atom eu consigo fazer isso no mesmo lugar, existe algum plugin p sanar isso no vs!? Eu não encontrei... no mais é uma ferramenta bem bacana."},{"author":"Giulliano Santos","comment":"Sugestão Presente e Futuro da Java... Acho que seria legal também."},{"author":"Maurício Linhares","comment":"mas olha só o que aconteceu! http://hipsters.tech/e-o-fu..."},{"author":"Giulliano Santos","comment":"Ai sim Hein??. Amigos parabéns pelo trabalho de vocês."},{"author":"Cesar Lemos","comment":"Entrei no Hipster só para sugerir esse assunto e vi esse comentário (y) ;D"},{"author":"Victor Menegusso","comment":"Realmente este tema é interessante. Hoje muitos podcasts / blogs so sabem descer a lenha no Java, muitas vezes dizendo que a sintaxe é complicada e vários mimimi, basicamente como se o Java estivesse na versão 1.0."},{"author":"Paulo Silveira","comment":"quem sabe? :)"},{"author":"Victor Menegusso","comment":"Eu não tinha conhecimento dessa mudança da microsoft, é muito legal. Trabalhei com o ASP e dava uma tristeza em manter dual boot. A grande questão é saber se essa nova plataforma da MS da para usar pesado em grandes sistemas em produção.Obs: eu ainda duvido que não exista um mp3 com a risada do Maurício Linhares. hehehe."},{"author":"Paulo Silveira","comment":"se não existe, esse mp3 precisa existir :P"},{"author":"Juscilan Moreto","comment":"O Vs code sim é show."},{"author":"José Ricardo","comment":"Satya nadella se tornou um \"Jesus\" na Microsoft rsrs, existe a éra Antes Satya e Depois do Satya, o impacto da mudança de visão foi gigante não só no publico técnico quanto diretamente também no comercial/usuários finais. Podcast esta muito show, qualidade sonora nota 10, fluidez do assunto segura o ouvinte firmemente. Linha de raciocínio dos integrantes esta bem alinhada e aberta a novas opiniões diminuindo assim ou basicamente deixando inexistente pequenas intrigas. Sobre este podcast em especifico em minha humilde opinião, faltou citar mais características sobre o Visual Studio for Mac (não o Visual Studio code) pelo tamanho da quebra de \"paradigma\" poderia ter mais detalhamento. Parabéns a todos envolvidos."},{"author":"Marquinhus Goncalves","comment":"Concordo que a Microsoft hoje vê tudo de forma diferente tanto que houveram nos últimos tempos diversas mudanças e algumas que até surpreenderam as comunidades, no ambiente de trabalho consigo ver que muitas pessoas usam o VSCode tanto back quanto front ends. Achei muito interessante o episódio, mais uma vez parabéns."},{"author":"Maurício Linhares","comment":"Uso o VS Code (no Mac) hoje pra muita coisa e to bem satisfeito, leve e rápido."},{"author":"Flaverton Rodrigues Rosa","comment":"E o https://appharbor.com/ alguém já usou? É bom?"},{"author":"Sebastião Relson Reis da Luz","comment":"Sobre visual studio demorar pra abrir projetos: Trabalhei numa solução q tinha 98 projetos, o que a gente fazia era deixar o computador hibernado e rebootar só no final de semana, sem exagero era meia hora pra abrir. Como sempre, ótimo episódio"},{"author":"Maurício Linhares","comment":"been there, done that. eu trabalhava no VS dentro de uma VM no parallels, não desejo isso nem pro meu pior inimigo."},{"author":"Everton","comment":"Muito bom, como sempre! :)Uma comparação interessante sobre performance entre Sublime x VS Code x Atom.https://blog.xinhong.me/pos..."},{"author":"Bruno Paschoali","comment":"Muito legal! Realmente era um podcast que faltava e as presenças do Vinícius e do Giovanni somaram demais! Sempre curti demais C# e nunca quis largar a linguagem por ser tão bacana de se trabalhar. Aí a Microsoft vem com a compra da Xamarin, Visual Studio for Mac e .NET Core, não tem como não querer fazer tudo em .NET haha. Sobre o link do texto \"Hora de olhar novamente para a Microsoft\", foi proposital? Obrigado pelo conteúdo."},{"author":"Mateus Queiroz Correia","comment":"+1 sobre o link \"Hora de olhar novamente para a Microsoft\", ele está certo? Está apontando para http://www.jordanmechner.com/"},{"author":"Gabriel Vieira de Jesus","comment":"Paulo muito bom o podcast parabéns...a propósito haverá algum cast sobre node ?"},{"author":"Maurício Linhares","comment":"Vai sim :D"},{"author":"Gabriel Vieira de Jesus","comment":"Maurício suas participações no cast são sempre ótimas ..parabéns"},{"author":"Diego Nogueira dos Santos","comment":"Muito bom o podcast. Realmente a MS ta mudando muito pra melhor..."},{"author":"Gabriel Darezzo","comment":"Paulo, concordo plenamente com o seu encerramento.Olhando pra o mundo M.S. com outros olhos.Ótimo podcast."},{"author":"Kleber Kihara","comment":"Devidamente compartilhado no Slack da FIRMA, já que sou do lado negro da força aqui (ou desenvolvedor Ruby on Rails se preferir). Mas tenho que confessar que, apesar de ter tido péssimas experiências com a Microsoft no passado, fiquei interessado em ver mais coisas sobre o .Net."},{"author":"Paulo Silveira","comment":"eles estão mandando muito bem. é preciso ficar de olho."},{"author":"Kleber Kihara","comment":"Sim... Faz tempo que uma mudança de liderança não impactava tanto quanto essa da Microsoft. ;)"},{"author":"Valdir Viana","comment":"Enfim um cast sobre .Net"}]}