{"title":"E o futuro do Java! – Hipsters #27","releaseDate":"17/01/2017","tags":["Podcast","programação"],"people":["Paulo Silveira","Mauricio Linhares","Alberto Souza","Michael ‘Mister M’ Nascimento"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=667%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D667&t_u=https%3A%2F%2Fhipsters.tech%2Fe-o-futuro-do-java-hipsters-27%2F&t_e=E%20o%20futuro%20do%20Java!%20%E2%80%93%20Hipsters%20%2327&t_d=E%20o%20futuro%20do%20Java!%20-%20Hipsters%20%2327%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=E%20o%20futuro%20do%20Java!%20%E2%80%93%20Hipsters%20%2327&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Bruno Lopes de Mello","comment":"Acabei de terminar o curso da Caelum de Java formação completa, e aprendi a fazer deploy gerando um .war e colocando em webapps no tomcat, qual seria um método mais sugestivo?"},{"author":"Luiz França Dos Santos","comment":"Oi Paulo, senti falta do Flow API no JDK, pra reactive programming (https://community.oracle.co.... Vc acredita que o reactive programming vai ser uma tendencia no Brasil?"},{"author":"Rafael","comment":"Olá Paulo sempre tive uma dúvida,é  possível uma pessoa dominar tudo de java, tipo, desktop, web, android e afins? Ou é muita coisa e não é necessário tudo isto."},{"author":"Alexandre Queiroz","comment":"acredito que somente se você for acadêmico fazendo pesquisa mesmo.  mas é muito incomum.simplesmente porque o universo é muito grande,imagine que voce é um professor de português, você precisa ter lido todos os livros?  certamente não!é a mesma coisa, é muito incomum um profissional trabalhar com mobile, swing e web. (embora seja possivel), mas mesmo nesse caso, voce precisa entrar em cada peculiaridade da linguagem, no web voce vai usar JAVA EE ou Spring? no android voce vai usar native ou algum framework? swing com EJB OU CDI? e a camada de segurança? e a camada de persistência? e o front da sua web vai ver como? JSF? angular? outro?é muito pouco provavel que uma só pessoa realmente saiba tudo sobre tudo. =|, mas quem sabe, deve ter algum monstro ai."},{"author":"Bruno Maximo","comment":"Muito bom!Mas gostaria de saber quando vão falar de PHP (Laravel).Abraços."},{"author":"Rafael","comment":"Excelente como sempre! Obrigado. =]"},{"author":"Lucas","comment":"Ola! Eu entendi mal ou falaram que um dos motivos do Java vai ficar mais seguro é porque vão fechar o código? (8m e 45s) fiquei um pouco confuso '-"},{"author":"João Vitor Oliveira","comment":"Olaaa, curto toda semana cada episodio. Gostaria de ver um podcast falando sobre a caminhada como dev, de onde vir pra onde ir hahahhaha"},{"author":"Felipe Antunes","comment":"Olá !!! Ótimo episodio e ótimo trabalho que estão fazendo por sinal :) ... Um podcast que adoraria ver é sobre grandes aplicações, algo falando sobre oque é usado pelos gigantes (Facebook, Google, etc...) e um possível motivo da escolha de tecnologias. Não consigo achar algo que me venda o peixe da forma certa rsrsrs."},{"author":"Maurício Linhares","comment":"Vamos falar com gente dessas empresas sim mas, contudo, entretanto, todavia, as decisões que eles tomam são numa escala muito diferente do resto do pessoal. Muitas vezes decidir usar uma coisa só porque um desses grandes usa pode ser muito mais dor de cabeça do que o necessário.Tudo tem que ser pensado em contexto. Por exemplo, o Facebook usa Haskell pesadamente na suite de spam deles, mas será que dá pra usar Haskell na minha empresa? Será que consigo montar equipe, contratar gente e fazer esse trabalho? É legal saber o que eles usam mas nem sempre dá pra simplesmente decidir ir pelo mesmo caminho."},{"author":"Pablo Weslly","comment":"Porque Haskell em vez de usar outra programação mais conhecida ?"},{"author":"Silvio Pereira","comment":"Eles não usam Haskell em tudo mas usam bastante. Uma aplicação do tamanho do facebook é dividida em centenas de módulos. Haskell tem pontos fortes como a simplicidade do código, facilidade de manutenção, desempenho, foco no paralelismo (o que o facebook preza bastante), etc."},{"author":"Mario Bressan","comment":"Tô estudando Haskell e não sabia de nenhuma empresa que usasse. Me interessei por programaçao funcional e achei que seria uma boa linguagem para aprender."},{"author":"Pablo Weslly","comment":"Obrigado pelo conhecimento."},{"author":"Lucas Formiga","comment":"Olá, vocês poderiam gravar um podcast sobre o Firebase? Se já foi gravado, ignore minha falta de atenção nos episódios. :)"},{"author":"Mateus Queiroz Correia","comment":"Mais uma vez um excelente conteúdo! Padrão Hipsters Ponto Tech!Senti falta de comentários sobre o licenciamento relacionado ao Java, JVM e as disputas que a Oracle está travando na justiça com algumas empresas, como a própria Google (http://www.v3.co.uk/v3-uk/n... e http://g1.globo.com/tecnolo...Será que teremos problemas de cobranças no futuro ao utilizar o Java? Para evitar problemas, o que deve ser pago para Oracle? Há alternativas?"},{"author":"Maurício Linhares","comment":"Opa,Depende do uso. Quem usa uma das soluções que a Oracle fala lá (que são JREs com coisas que eles compraram da BEA muitos anos atrás) podem ter problemas, mas pouca gente faz isso. E de toda forma sempre tem o OpenJDK que não tem nenhum desses problemas de licença."},{"author":"Paulo Silveira","comment":"oi Mateus. Algumas dessas noticias foram exageradas e, no momento, nao há sinal nenhum que a Oracle va cobrar pelo uso da JVM e da JRE que conhecemos tão bem.... Eu não me preocuparia... tanto :)"},{"author":"Poliana  MRN","comment":"Olá Hipsters ! Boa tarde . Ouvi o ultimo podcast  e gostaria de saber a sugestão de vocês.Uma das coisas que foi falado é que hoje em dia, ninguém mais utiliza (ou ninguém mais deveria utilizar)  a prática de fazer deploy de várias aplicações em um servidor de aplicação.Entendo que para as novas arquiteturas podemos ter essa escolha. Por exemplo, o ultimo projeto que desenvolvi utilizei o wildfly swarm e uma arquitetura de micro serviços.No ambiente que trabalho, não são permitidos virtualizações. Possuímos um datacenter e todos servidores são maquinas físicas, (por diversas questões q não cabe no escopo) exceto para desenvolvimento e teste,  portanto, para manter  os projetos legados, ( talvez o caso de reimplementar alguns dos legados) , gostaria de saber um pouco mais  sobre outras alternativas.Pensei na opção de utilizar um container (ex. docker) para separar cada aplicação mas talvez tb não valha a pena neste caso.Na opinião de vocês, no caso de legado, qual seria melhor opção. Aproveitando a deixa, e para novas aplicações web (cliente / servidor ), quais seriam as recomendações ?"},{"author":"Francisco Moura","comment":"Olá Poliana  MRN!Deixei um comentário no post do Matheus que pode lhe auxiliar.Veja: http://hipsters.tech/e-o-fu...Abraços."},{"author":"Maurício Linhares","comment":"Eu diria que docker é o ideal, roda num container, não tem virtualização e você roda fácil na sua máquina de desenvolvimento e produção (dependendo do tamanho vale a pena olhar pra Kubernetes também pra controlar os servidores)."},{"author":"Fernando Boaglio","comment":"agora só falta o podcast das Java Wars!   guerra de fóruns , guerra de frameworks, guerra de servidor de app, guerra de IDEs,  ô povo desunido hein ? kkk"},{"author":"Maurício Linhares","comment":"\n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n"},{"author":"Bruno Tomé","comment":"Comecei ouvir segunda feira, hoje (Quarta-feira), terminei todos, a qualidade está incrível. Parabéns e tragam o de php e seus frameworks :D. E que tal falarem sobre o mercado Swift depois que seu código foi aberto?"},{"author":"Paulo Silveira","comment":"php virá! :Pouviu TODOS os 27 em dois dias? o louco!!"},{"author":"Matheus Castiglioni","comment":"Durante um momento o Mauricio mencionou que as empresas não fazem mais o deploy de um war para um tomcat contendo outros war's, certo ? Como as empresas fazem o deploy hoje ? Eu teria que ter um container em docker com tomcat para cada war ?Fiquei com essa dúvida, pois no meu trabalho ainda fazemos do método antigo como o Paulo mencionou kkkk"},{"author":"Francisco Moura","comment":"Olá Matheus Castiglioni  e demais hipsters, saudações!! Gastando meus dois cents, você pode ter soluções de deploy independentes sem usar docker.Algumas possibilidades de configuração na mesma máquina:1) Configurar instâncias de containers (tomcat ou jetty, por exemplo) em diferentes portas. Assim, cada instância configurada em uma porta diferente será dedicada ao atendimento de uma determinada aplicação.Referências:- https://tomcat.apache.org/t...- Googling: \"tomcat instances\"- Tenho uma documentação específica para um projeto (google docs) para configurar várias instâncias de tomcat, caso tenham interesse posso disponibilizar.2) Executar várias instâncias do application server. Você pode executar, por exemplo JBoss ou Wildfly standalone, em diferentes portas e fazer o deploy da aplicação na instância designada.Referências:- http://blog.arungupta.me/mu...- http://www.mastertheboss.co...Em essência, os application servers e containers servlet/JSP são ... Containers!!Para deixar todos felizes:Se algum \"ator\" da sua organização lhe questionar sobre a exposição das portas ou que terão que abrir várias portas no firewall, sorria e diga, vamos usar somente a porta padrão 80 ou 443. Para atingir tal objetivo, configure um proxy reverso (com apache httpd ou nginx) para atender nas portas http/https padrão e encaminhar as requests para as portas específicas de cada aplicação.Abraços."},{"author":"Poliana  MRN","comment":"Olá Francisco Moura  , acho que o problema dessa solução, seria o caso da manutenção.  Por exemplo se todos os serviços utilizam o mesmo data source, e precisar fazer alguma alteração na url do banco ou alterar numero de conexões de cada pool por exemplo teria o trabalho de ter que fazer essa alteração em cada instancia de servidor."},{"author":"Matheus Castiglioni","comment":"Show de bola Francisco, até o momento estou tentando fazer tal implementação com docker, parei no momento de criar os volumes por ainda falta de conhecimento.Gostei das informações(parece ser algo bem complexo), porém estou entrando nesse mundo de deploy, devops e infra agora, pois até então estava focado em front e java, então acredito que para conseguir atingir um nível de deploy satisfatória ainda levará algum tempo de estudo e quebrando a cabeça para implementar tais recursos.Vou ler com mais calmas depois os links que me enviou.Abraçooooos."},{"author":"Giulliano Santos","comment":"Também estou nessa. kkkkkk, so nos war, fiquei até sem graça... kkkkkkk"},{"author":"Maurício Linhares","comment":"Sim, o ideal seria fazer isso. Compartilhar o tomcat com outras apps gera vários problemas com classloaders e bibliotecas, é melhor evitar isso."},{"author":"Matheus Castiglioni","comment":"Maravilha Mauricio, vou começar tal implementação."},{"author":"Maurício Linhares","comment":"E não precisa usar Tomcat também, tem várias outras opções, como o http://undertow.io/"},{"author":"Júnior Araújo","comment":"Queremos o de PHP!"},{"author":"Kelvin Dules","comment":"Primeiro podcast que acompanho TODOS os ep. Muito bom!"},{"author":"Paulo Silveira","comment":"fico contente Kelvin!!"},{"author":"Deyve Machado","comment":"Muito bom ! Parabéns ! Abraços !"},{"author":"Rubinho_sjr","comment":"Poxa ja teve de dotNet e Java, estou ansiosamente o de esperando pelo de PHP agora.Tenho dois pontos pra comentar.Primeiro é que vendo vocês conversando me deu uma ser uma certa impressão de que a disparidade entre oque se aprende na faculdade e oque se usa na \"vida real\" é ainda maior do que eu sempre vi. Aprendi servlets JSP como se fosse a forma de se usar java pra web hoje e que se eu começa-se a trabalhar em uma empresa que usa Java eu ia conseguir usar pelo menos a base do que eu aprendi. Eu entendo que as linguagens evoluem mais rápido do que a grade curricular de uma graduação pode ser alterada. Mas não esperava algo nesse nível. Como gostei mais de desenvolver com PHP eu nunca fui atras de ver como era o mercado Java e agora estou vendo que a montanha que eu tenho q subir se quiser mudar de linguagem é muito maior do que eu imaginei.Segundo, o cast deve ter sido muito mais bacana pra quem já usa Java do que pra mim, pq não entendi quase nada do que foi falado.Mais é isso ae grande abraço o/"},{"author":"Camelo Rodoviário","comment":"Penso que a api de servlets, e até mesmo o jsp, é a base para as demais tecnologias do java ee, sendo assim, acho que é valido sim esse conhecimento. Fazendo uma analogia ao mundo orientação objetos, se você souber como uma interface funciona, não vai importar muito qual implementação você vai utilizar - as tecnologias java ee utilizam a api de servlets por baixo. Se ensinarem JSF na faculdade talvez não vale tanto quando você for aprender algum mvc action como o spring. Pelo menos é assim que eu vejo."},{"author":"Daniel Moura","comment":"Cara toda vez que escuto o Paulo Silveira falando eu acho que ele ta gripado. Pohhh vamos falar de Java kkkk. \\o/"},{"author":"Paulo Silveira","comment":"tô gripado nao. nao é todo mundo que nasce com um vozeirão como o mauricio linhares :P"},{"author":"Daniel Moura","comment":"kkkkk Parabéns pelo Podcast cara, escuto toda semana.."},{"author":"JOAO JOSE MARANHAO JUNIOR","comment":"Muito bom o Podcast !!Demorou mas chegou !!Parabéns !!"},{"author":"Eduardo Medeiros Branquinho","comment":"O Alberto Souza é fanático do Spring? Mas não foi ele que escreveu o livro de Java EE pra casa do código?Ora ora ora, alguem andou sendo infiel por aqui hahaha"},{"author":"Alberto Luiz Souza","comment":"Calma ê.. disseminar sempre eh valido :P. Meu amor por um não gera ódio no outro. "},{"author":"Danilo Vieira","comment":"Andei vendo alguns projetos Android sendo desenvolvidos usando kotlin no Android Studio. Me pareceu promissor. O que me falta agora é só coragem de embarcar algum projeto nele."},{"author":"Victor Menegusso","comment":"Este é um assunto que eu estava esperando desde o inicio do Hipsters."},{"author":"Raphael da Rocha","comment":"Foi só falar de Java que travou a página(sério)..."},{"author":"Victor Menegusso","comment":"Talvez é porque a página é feita em PHP... flame wars hehehe"},{"author":"Raphael da Rocha","comment":"Não, sem guerras... HEHEFoi só uma brincadeira... ;D"},{"author":"Maurício Linhares","comment":"\n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n"},{"author":"Raphael da Rocha","comment":"Mauricio, quando vocês vão falar de Python???"},{"author":"Maurício Linhares","comment":"Em breve!"}]}