{"title":"Cafézinho Hipster – Hipsters #33","releaseDate":"28/02/2017","tags":["gerais","Podcast"],"people":["Paulo Silveira","Mauricio Linhares","Rodrigo ‘Caffo’ Franco","Daniel Filho"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=670%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D670&t_u=https%3A%2F%2Fhipsters.tech%2Fcafezinho-hipster-hipsters-33%2F&t_e=Caf%C3%A9zinho%20Hipster%20%E2%80%93%20Hipsters%20%2333&t_d=Caf%C3%A9zinho%20Hipster%20-%20Hipsters%20%2333%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Caf%C3%A9zinho%20Hipster%20%E2%80%93%20Hipsters%20%2333&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Willian","comment":"por preguiça de escutar novamente, alguem me fala o site que faz assinatura de café, que vem de varias fazendas"},{"author":"Arthur","comment":"Sou dev e tenho assinatura na https://compilagrao.com.br! Lá eles torram e moem o café, pouco antes de te enviar. Abçs"},{"author":"cleiverrr","comment":"No centro do Rio tem o Curto Café no mezanino do edifício garagem Menezes Côrtes. Lá, além de ser bom, você paga quanto quiser e achar justo. "},{"author":"Pedro Bernardo","comment":"E qual a opinião da galera que manja de café pra moka italiana? Não foi comentado ;("},{"author":"disqus_qnqUsi6y9i","comment":"Excelente cast. Agora vou dar mais uma gourmetizada na minha vida, rs!Parabéns!"},{"author":"Olavo de Carvalho","comment":"Muito bom o podcast. O  site Banggood têm muita coisa pra comprar sobre café. Mas me tirem uma dúvida qual é a da aguá com gás? Sempre vem junto mas nem sei o que fazer com esse trem."},{"author":"Daniel Filho","comment":"é um acompanhamento pra limpar o paladar antes de beber o café.mas quem  não gosta de ficar com o resíduo na boca, toma depois ;)"},{"author":"Olavo de Carvalho","comment":"Pior que é verdade! =D"},{"author":"Thiago Ferreira","comment":"Gostei da ideia, irei me aventurar nisso, ate mesmo porque adoro cafe e tinha uma perspectiva errada sobre os cafés artesanais... valeu pelo podcast pessoal, vocês são foda...."},{"author":"Luiz Eduardo Favalessa","comment":"Só eu aqui programo e não bebo café? :("},{"author":"Renan Maciel","comment":"hahaha... também não sou muito degustador de café, mas acho que parar para tomar um café com um colega de equipe é um marco imprescindível pra dar aquela descansada na mente pra poder continuar o dia. [Não sou daqueles que bebe enquanto trampa]"},{"author":"Paulo Silveira","comment":"o alberto sousa aqui da empresa tambem nao bebe!!!"},{"author":"Heitor Marques","comment":"Sou hispter de café desde 2000, quando por acaso tomei um café \"especial\" e fiquei maluco. Compro café em grão pela internet desde que as fazendas brasileiras engatinhavam nesse nicho. Muito legal esse cast e como um cara dedicado ao assunto, aplaudo o bom conhecimento dos dos convidados! Também tenho Nespresso e respeito muito o papel dessa tecnologia. Meu método preferido é aeropress desde 2014 e prefiro muito mais café coado a café espresso"},{"author":"Alexandre Six","comment":"poxa.. to tentando me aventurar nesse mundo.. mas to perdido.. qual grao em indicaria? E qual metodo para começar? Chemex e aeropress parece ser muito investimento para se aventurar de inicio."},{"author":"Heitor Marques","comment":"Alexandre, pode-se gastar muita grana mesmo, mas o importante é começar de alguma maneira. O legal é que as tralhas de café não ficam obsoletas como de TI. Então daqui a alguns anos você acumulará gadgets e experiência com sucesso. O princípio mais básico é ter seu próprio moedor (o que já vai lhe custar umas centenas de reais - não compre de lâmina, mas de mó) e comece pelo grão que encontrar no supermercado mesmo. Mesmo no filtro Melitta, isso já fará uma diferença enorme. Depois você investe num filtro Hario V60 e em seguida em outros métodos. Veja vídeos e entenda e aplique o que os caras explicam. Quando o seu pacote estiver para acabar, compre sempre outro de outra marca e especificação. Isso lhe ajudará a comparar e a começar e escolher seus grãos com refino. Outro princípio básico é aprender a tomar sem açucar. Não é possível perceber tudo que um bom grão tem a lhe oferecer se colocar açucar, ele é muito dominante e esconde os aromas. Café bom tem um amargo super suave ou até não tem nenhum. Se amargar, é porque é ruim e/ou torrado demais. Quando quiser perguntar algo, será um prazer ajudar."},{"author":"Paulo Silveira","comment":"Dica do @breno_ferreira do twitter!! outros cafés legais pelo brasil e afora: https://medium.com/@breno_f..."},{"author":"²He","comment":"Café é algo cujo o cheiro sempre me atraiu mas não gosto de bebidas absurdamente quentes (como normalmente é o café).Existe alguma maneira/dicas pra preparar um gelado?"},{"author":"Rafael Santos","comment":"Tem sim, dá uma pesquisada por \"cold brew\".."},{"author":"debiasi","comment":"Teve esse projeto no Catarse de uma espresso manual https://www.catarse.me/cafe..."},{"author":"Fernando Boaglio","comment":"Não tomo muito café, e se tomar, tem que ser com leite, senão sem chance... uma curiosidade: o termo macchiato vem do italiano macchia, que significa mancha..."},{"author":"Enieber","comment":"deu até uma tristeza quando fui pegar um café com gosto de torra kkkk.... parabéns pelo episódio, muito bom."},{"author":"Luis Sérgio","comment":"Caraca, esse podcast ficou tão bom quanto um Nerdcast sobre café. Curti D+!Por mais podcasts como este!"},{"author":"Rafael Santos","comment":"Muito bom o podcast! No dia a dia, tomo nespresso mesmo mas gosto bastante de provar cafés novos.. Ótimas dicas de locais e métodos.. Não conhecia o Hario V60, achei muito bacana.. Vou provar.."},{"author":"Eduardo Medeiros Branquinho","comment":"Olha, eu não gosto de café, já tentei tomar várias vezes mas nunca rolou. Mesmo assim ouvi o podcast inteiro, e olha, bateu uma vontade de provar uns cafés diferentes pra ver se eu encontro algum que gosto..."},{"author":"Eduardo Medeiros Branquinho","comment":"PS: Achei curioso o fato de Starbucks nem ser citado hahaha"},{"author":"Paulo Silveira","comment":"eheheh. esqueceram de falar mal do starbucks! um clássico dos viciados em café"},{"author":"Valdir Viana","comment":"Ótimo cast, ainda estou surpreso com a ideia de colocara manteiga \"dentro\" do café."},{"author":"Jean Amaral","comment":"Engraçado que penso que é algo bem louco também.. mas lembrei que quando criança minha mãe me dava café com manteiga pra beber quando eu passava mal. Ela dizia que era bom sei la pra quê."},{"author":"Paulo Silveira","comment":"pior que é super comum. ou oleo de coco."},{"author":"Daniel Filho","comment":"gente. não é \"ou\". é \"e\" :)https://medium.com/na-cafet..."},{"author":"Valdir Viana","comment":"Massa, é hora de experimentar!"},{"author":"Rubens Mateus Padoveze","comment":"Obrigado pelas dicas e pelo tema. Eu recomendo o Café Leão que está fazendo força para que todos tomemos um bom café moído ou em grãos(eles recomendam em grãos)."},{"author":"Joao luiz seger","comment":"Show de bola, agora entendi por que entendi o por que colocar açúcar no café feito em casa e nas cafeterias decentes fica ótimo sem."},{"author":"Juliano Soares","comment":"Agora eu entendi pq o nome do podcast é hipsters."},{"author":"Thiago Miro","comment":"Admirei a maturidade de não terem perguntado se café no coador era mais forte. Eu não conseguiria. =P"},{"author":"Daniel Filho","comment":"a piada não rolou nem foi tirada na edição, só porque estávamos focados. e a piada e manjada demais. hahahaha :P"},{"author":"Wilerson Oliveira","comment":"Devem ter removido na edição."}]}