{"title":"Mídias sociais e o caso do Nubank – Hipsters #32","releaseDate":"21/02/2017","tags":["business","marketing","Podcast","startup"],"people":["Paulo Silveira","Gabriel Ferreira","Mariana Netto","Joe Colombero"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=680%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D680&t_u=https%3A%2F%2Fhipsters.tech%2Fmidias-sociais-e-o-caso-do-nubank-hipsters-32%2F&t_e=M%C3%ADdias%20sociais%20e%20o%20caso%20do%20Nubank%20%E2%80%93%20Hipsters%20%2332&t_d=M%C3%ADdias%20sociais%20e%20o%20caso%20do%20Nubank%20-%20Hipsters%20%2332%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=M%C3%ADdias%20sociais%20e%20o%20caso%20do%20Nubank%20%E2%80%93%20Hipsters%20%2332&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Olavo de Carvalho","comment":"Nossa achei show de bola pessoal. Conteúdo bastante relevante até porque a Nubank está deixando os bancos doidos rs.E uma coisa que vocês me fizeram lembrar foi sobre os novos atendimentos das imobiliárias. Hoje elas aderiram a atender seu público a partir das 21 horas. Muitos consultores não gostaram mas alguns começaram a fazer esse atendimento e ganharam muito com isso aumento demais suas vendas. Até porque com a correria do dia dia é o único horário disponível.  Acho a estratégia na Alura muito boa nas redes sociais em nenhum momento têm aquela agressividade da venda, mas pelos canais que vocês estão trabalhando como videos ao vivo e podcast, isso da maior interesse em comprar o produto."},{"author":"Thales Rodrigues","comment":"Nubank é um dos poucos casos de marketing viral no brasil.Ainda mais no setor que atua."},{"author":"Guilherme Tufaile","comment":"\n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n\n Tava analisando e encontrei essa gafe da catuaba hahaha"},{"author":"Murilo Oliveira","comment":"Faz um canal no Youtube (Y)"},{"author":"Éverton Augusto","comment":"Bom Dia!! Primeiramente quero dar os parabens a todos os integrantes e dizer que realmente conheci vcs atraves do podcast do jovem nerd, mas e desde então tento arrumar minhas contas para poder entrar no Alura, mas na vdd este post é mais para fazer um pedido, que se possivel, incluíssem na forma de pagamento o debito em conta parcelado, pq na vdd o cartão de credito ja utilizo em outros fins e necessito do credito dele e debito em conta, se não for atrapalhar me ajudaria e muito, pois quero muito estudar através do site do Alura, mas a melhor saida p/ mim seria o debito em conta."},{"author":"Paulo Silveira","comment":"ola Everton! Sao poucos meios de pagamento que oferecem o debito parcelado.... debito automatico etao é ainda mais impossivel: precisa conversar com os grandes bancos. mas manda um email pro contato@alura.com.br explicando essa situacao e perguntando se nao ha como usar um outro meio de pagamento que faça isso"},{"author":"Thiago Araújo","comment":"Seria muito bacana se esses podcasts fossem filmados.."},{"author":"Paulo Silveira","comment":"Thaigo, ja pensamos nisso. mas a camera parada entedia um pouco. usar mais de uma camera trabsformaria o trabalho em dificil, lento e caro :("},{"author":"Thiago Araújo","comment":"Acredito que não, Paulo.. Com uma câmera somente e parada, não entediaria não... Esses podcasts são muito bacanas... Façam um teste um dia...quem sabe?"},{"author":"AdrianoDefendi","comment":"Gosto bastante de vcs, o cast foi bem legal mas me incomodou o modo pejorativo como usaram o exemplo da prefeitura de Curitiba, lembro que não faziam humor apenas pelo humor, respondiam com transparência e procuravam resolver as questões. Acho complicado julgar a estratégia do outro sem conhecer  bem os objetivos. No mais, o podcast é incrível, parabéns!"},{"author":"Paulo Silveira","comment":"Adriano, confesso que conheci pouco do projeto e acabei vendo apenas os memes e posts engracados da prefeitura. Se havia posts focados nas questoes importantes da cidade, ja me parece fazer bem mais sentido. Eu deveria ter gastado um tempo e visto a pagina, em especial posts antigos, antes de comentar apenas o que conhecia superficialmente."},{"author":"Rodolfo Estevam","comment":"Cara, sem textão... Vocês são fodas!"},{"author":"Gabs Ferreira","comment":"Valeu Rodolfo ❤"},{"author":"Guilherme Breithaupt","comment":"Bom dia, após ouvir o podcast de como o Nubank se posiciona em relação ao atendimento ao cliente e geração de valor com o uso de tecnologias de \"social\",  resolvi fazer uma pergunta muito simples, pois, não identifiquei no site informações em relação as Certificações de Segurança , exigidas no mercado de pagamentos. Transcrevo o questionamento e a resposta. (P) - Bom dia, gostaria de saber qual a empresa certificou o Nubank nos padrões do PCI-SSC. (R) - Bom dia Guilherme! Temos todas as certificações que precisamos para rodar o nosso negócio e não abrimos o nome de nenhum de nossos parceiros.Não seria necessário dizer que as certificações devem ser demonstradas, não por evidências anedóticas e sim com a apresentação dos certificados e uso dos \"selos\" nos canais exigidos, não gostaria de ser grosseiro mas esta resposta soou para mim como \"la garantia soy jo\".Esta informação foi dada pelo usuário oficial do Nubank e fiz uma consideração após a resposta , disse que foi uma pena constatar que o discurso do Nubank é diferente da prática e possuo meios formais para obter esta resposta, pois,  ela é e deveria ser tratada como publica e verificável por qualquer um."},{"author":"Carlos Carvalho","comment":"Parabéns galera! Esse tema é sensacional! Muitas vezes as empresas tendem a correr diretamente na busca pela conversão de leads e esquecem de fazer um certo \"romance\" com os possíveis futuros clientes. Acredito que pelo fato de ser algo muito comum, alguns usuários, como eu, acaba não se \"convertendo\" de imediato. O Nubank pra mim foi mais direto porque eu tinha um exemplo em casa que possuía o cartão, a propaganda boca a boca foi quem acabou me convertendo.Pegando outro exemplo vivido por mim, eu tinha interesse em comprar os cursos da Alura, mas isso levou um tempo para que a conversão acontecesse. Os posts das redes sociais e os e-mails no meu caso já passam despercebido na maioria dos casos, talvez por conta da quantidade de publicações patrocinadas e e-mails que vejo/recebo diariamente. Então depois do hipsters, quando ouvi os primeiros podacasts foi que a atenção que eu tinha sobre a alura se tornou vontade. E claro, a experiência passada no pós conversão é que mantém o cliente."},{"author":"Paulo Silveira","comment":"wow! que depoimento bacana. vou mostrar pro pessoal aqui a importancia do hipsters :)"},{"author":"André Vieira","comment":"sem dúvidas o hipsters está sendo de grande vália junto com os cursos ministrados na alura! Essa semana eu estive em uma entrevista de emprego a vaga era para front end e o recrutador queria explorar meus conhecimentos sobre as tecnologias como react, webcomponents, e adivinham só tudo fresquinho na memória graças aos excelentes podcasts!!! :D"},{"author":"Bruce","comment":"Sempre bacana o PodCast, essa galera no NuBank é foda demais !!"},{"author":"Leonardo Amorim","comment":"Olá, primeiramente gostaria de parabenizá-los por mais um podcast! Continuem com o ótimo trabalho! Pois bem, espero que não interpretem a minha dúvida como uma afronta ou algo do tipo, é uma dúvida legítima.Estudo engenharia da computação, estou no primeiro semestre e há alguns meses comecei a estudar intensivamente toda a parte de desenvolvimento/programação por meio de fóruns, cursos e e-books gratuitos, mas agora quero assinar uma \"plataforma de aprendizado de TI\" online e o Alura é sem dúvidas a melhor opção do Brasil, porém há algum tempo eu venho fazendo cursos avulsos (gratuitos) de uma empresa americana (não citarei o nome pois não sei se é permitido), que fornece o programa Nanodegree, no qual eu acabei gostando de como funciona a plataforma no geral, e eu gostaria de saber quais são os diferenciais da Alura a destacam e me fariam optar pela mesma, levando em conta que a barreira da linguagem e o preço (a outra é expressivamente mais cara) não são problemas.OBS: Conheci a Alura pelo nerdtech, peguei um carinho muito grande por todo o pessoal que participa do podcast e acabei me tornando ouvinte do hipsters.tech também, sou um grande fã do trabalho de vocês."},{"author":"Paulo Silveira","comment":"oi Leonardo. Tem diversos cursos e formações online, tanto fora do brasil quanto no brasil, que a gente admira e considera de qualidade! O legal da educação é essa: você pode escolher o que é melhor em cada um, ainda mais em um mercado não regulado. Temos muitos alunos que fazem aula em mais de uma plataforma! Claro, queremos que a gente seja considerado o ambiente principal e melhor pelos nossos alunos, independente disso, por isso a  preocupação constante em ser melhor do que éramos ontem.Nosso maior diferencial não é nem a qualidade, nem a quantidade nem a atualização, que eu considero serem melhores que a maioria absoltua dos concorrentes. Eu dou destaque sim a comunidade: ao nosso forum, aos nossos podcasts, a forma que a gente abraça ao aluno e o torna parte da nossa comunidade. Espero vê-lo como aluno. Qualquer dúvida não deixe de mandar um email pra mim no paulo.silveira@caelum.com.br ou no contato@alura.com.br"},{"author":"Leonardo Amorim","comment":"Muitíssimo obrigado pela resposta, só me fez ter mais certeza que serei um futuro aluno da Alura! Abraço!"},{"author":"Olavo de Carvalho","comment":"Nossa achei show de bola pessoal. Conteúdo bastante relevante até porque a Nubank está deixando os bancos doidos rs.E uma coisa que vocês me fizeram lembrar foi sobre os novos atendimentos das imobiliárias. Hoje elas aderiram a atender seu público a partir das 21 horas. Muitos consultores não gostaram mas alguns começaram a fazer esse atendimento e ganharam muito com isso aumento demais suas vendas. Até porque com a correria do dia dia é o único horário disponível.  Acho a estratégia na Alura muito boa nas redes sociais em nenhum momento têm aquela agressividade da venda, mas pelos canais que vocês estão trabalhando como videos ao vivo e podcast, isso da maior interesse em comprar o produto."},{"author":"Paulo Silveira","comment":"Olavo, você resumiu bem o que a gente pensa: - usar as redes sociais como canal de divulgacao de conteudo e atendimento, em especial para horarios pouco convencionais.- evitar agressividade nas vendas (fundo do funil é raro aqui"},{"author":"Olavo de Carvalho","comment":"Acho muito boa essa estratégia de vocês. Creio que isso poderia ser mais utilizados em outros segmentos como agências de viagens que estão perdendo para internet. Creio que um bom atendimento e mais canais de comunicação nunca sairão de moda.Parabéns pelo trabalho de vocês, eu que não sou desenvolvedor fico admirado com cada podcast."},{"author":"Mateus Queiroz Correia","comment":"Vocês estão de parabéns pelo conteúdo diversificado! Gostei muito da filosofia proposta para as redes sociais e que ela deve ser utilizada, obviamente, para socializar - agregando conteúdo relevante para um público bem definido.Vocês pensam em fazer um novo podcast para falar um pouco mais de ferramentas para ajudar nessa gestão? Se utilizam alguma, se criaram etc.Muito legal a foto dos bastidores!"},{"author":"Eduardo Hommerding","comment":"Eai pessoal! Parabéns por mais um ótimo episódio.Muito bacana ouvir falar da Dobra por alguns segundos, ainda mais em uma conversa com a galera do Nubank. Nos inspiramos muito neles ao traçar nossas estratégias. Legal também saber que estamos atingindo um público foda como esse nos nossos ads do Facebook, hahaha. Abração"},{"author":"Paulo Silveira","comment":"valeu Eduardo! Só vi depois que citei errado que era do nordeste e é do sul."},{"author":"João Bomfim Jr","comment":"A ideia de mostrar os bastidores seria muito legal. Obrigado por trazem as pessoas e empresas do mercado para mostrar as suas experiências com diversas tecnologias. Chegar em um nível de engajamento do NuBank acredito que seja o sonhos de qualquer empresa. Poucas empresas se preocupam em trazer para a vida do cliente algo diferente, muitas ainda quem apenas vender."},{"author":"Juliano Soares","comment":"Acho que já dá pra mudar os \"ÚLTIMOS PODCASTS\" no sidebar por \"MAIS OUVIDOS\"."},{"author":"Paulo Silveira","comment":"está na fila das mudancas :). valeu juliano, faz todo sentido"},{"author":"Welton Vaz de Souza","comment":"Toda terça-feira, eu tenho o compromisso de ouvir Hipsters! O tema de hoje é muito ilustrativo da realidade que vivemos hoje. A Rede Social como ferramenta de apoio, suporte e vendas seria o ideal. Antes de comprar qualquer coisa, eu pesquiso nos sites de reclamação, no Twitter e algumas vezes no Facebook. Eu conhecia o Alura, pelo podcast do Jovem Nerd, mas não foi só isso que fez ser aluno da Alura, mas uma coleção de pequenas coisas. Uma impressão muito boa do Alura, e vc (Paulo) responder os cometários aqui no HIPSTERS. Outra delas e o atendimento, mandei um email e fui respondido muito rápido. E nos problemas e que conhecemos as verdadeiras empresas, aquelas que pensam no cliente é o lucro sendo consequência de um trabalho bem feito. Com relação a isso gostaria demostrar uma experiencia negativa, como estou desempregado no momento, estou aproveitando para ler e estudar muito. Sou assinante de outro curso online, entrei em contato com eles por email, não obtive resposta.  Mandei msg no Facebook no grupo restrito não obtive resposta, resolvi postar um msg whatsapp para o responsável pelo Curso e fui maltratado pelo mesmo! Com relação ao Nubank sei que existe um investimento em rede social e tecnologia muito alto para diferenciar o produto deles, mas infelizmente, eles tem o mesmo atendimento ruim e impessoal das outras operadoras de cartão, não consigo ver novidade, atendimento personalizado ou mesmo inovação!"},{"author":"Paulo Silveira","comment":"Welton, obrigado pelas palavras, fico contente de saber que foram esses detalhes que trouxeram você pra estudar com a gente. Quanto ao nubank, minha experiência foi diferente da sua, sempre tive um atendimento pra lá de diferenciado. Mas assim como nós aqui na caelum/alura às vezes falhamos, nenhuma empresa está a prova de dar umas vaciladas :)De qualquer forma, voce está dando um depoimento bem importante e que quisemos passar nesse episodios: a forma de atender e se relacionar, mesmo com quem ainda não é cliente, é fundamental mesmo que a conversão não apareça no primeiro instante."},{"author":"Welton Vaz de Souza","comment":"Eu entendi o tema do programa, \"a forma de atender e se relacionar\" sei também que perfeição não existe. O Nubank tem 100% de resposta no RECLAMEAQUI, 82.5% \"Voltaria afazer negócio\" e Índice de solução de 81,6%. Mas não é só isso que o cliente quer! Tem uma operadora de cartão que tem um site muito bonito de \"promoção\" de produtos para a compra com 50% desconto para cliente deste cartão, só que os produtos neste site custam o dobro ou o triplo do preço normal. É não adianta reclamar e pedir uma solução no atendimento ou ainda usando rede sociais. Como foi muito bem falado por vc, durante o episódio. Outra coisa, e que vc como diretor de empresa tem o atendimento personalizado, mas nem todo cliente passa por isso. Veja os bancos, empresa de aviação com atendimento \"Classic\" para uns e \"cata-jegue\" para a maioria. "},{"author":"Augusto Santos","comment":"Mias um ótimo podcast. Infelizmente muitas empresas não dão a devida importância a participação nas redes sociais. Hoje mídias como facebook e twitter tem papel essencial na relação entre empresa e cliente e empresas que fazem o uso correto destas ferramentas conseguem deixar seus clientes mais satisfeitos."},{"author":"Gabs Ferreira","comment":"Fato, Augusto! Ser bem atendido em qualquer canal realmente faz a diferença, né? :)"}]}