{"title":"Prototipação: erre cedo para acertar cedo – Hipsters #28","releaseDate":"24/01/2017","tags":["design","design & ux","Podcast"],"people":["Paulo Silveira","Thiago Vilaça","Natan Souza","Vitor Guerra","Demian Borba"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=683%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D683&t_u=https%3A%2F%2Fhipsters.tech%2Fprototipacao-erre-cedo-para-acertar-cedo-hipsters-28%2F&t_e=Prototipa%C3%A7%C3%A3o%3A%20erre%20cedo%20para%20acertar%20cedo%20%E2%80%93%20Hipsters%20%2328&t_d=Prototipa%C3%A7%C3%A3o%3A%20erre%20cedo%20para%20acertar%20cedo%20-%20Hipsters%20%2328%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Prototipa%C3%A7%C3%A3o%3A%20erre%20cedo%20para%20acertar%20cedo%20%E2%80%93%20Hipsters%20%2328&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Fabio Barboza","comment":"Excelente episódio... ótimas sacadas !!! ;)"},{"author":"Marquinhus Goncalves","comment":"Pessoal !!! Sensacional esse episódio parabéns !!!"},{"author":"Rafael Schettino","comment":"Gostei demais! Coloquem o link da página de comparativo de ferramentas de UX, por favor."},{"author":"Natan Souza","comment":"Delay monstruoso, mas é esse aqui: http://uxtools.co abcs!"},{"author":"Leandro","comment":"muito bom o episódio :) Parabéns galera!"},{"author":"valmir","comment":"Eu utilizo Linux Ubuntu. e todos os softwares de prototipação que já ouvi falar, são pra MAC ou Windowns.Alguém conhce um ferramenta boa para linux, parecido com: Figma, sketch, zeplin"},{"author":"Vitor Guerra","comment":"Dependendo do que precisa, é totalmente possível utilizar o Invision ou Marvel para prototipar. Nesse caso, estão uma etapa a frente do desenho em si."},{"author":"valmir","comment":"Obrigado! Vou dar uma estudada neles."},{"author":"Jaumzera","comment":"Tenho o mesmo problema aqui. Parque 100% Linux/Debian."},{"author":"valmir","comment":"Não é fácil essa vida, rsrsrEu uso http://pencil.evolus.vn/Nex... mais queria algo mais completo."},{"author":"Jaumzera","comment":"Tive uma XP muito parecida com a mencionada aos 12 minutos uma vez que apresentamos um wireframe pro cliente, feito em uma ferramenta web da qual não me recordo o nome, que imitava muito um papel rabiscado a mão. Quando entregamos o produto pro cliente, a indignação dele é que o visual não se parecia em nada com o protótipo. Tivemos que adaptar toda os artefatos de estilos da lib JSF que usávamos pra fazer o sistema ficar parecido com a p**ra do wireframe. kkkkkkk"},{"author":"Diogo Riker","comment":"balsamic?"},{"author":"Jaumzera","comment":"Yep... Balsamic."},{"author":"Vitor Guerra","comment":"Acho que é o Balsamic mesmo."},{"author":"Diogo Riker","comment":"Muito bom!! Mas... senti falta do Axure.. acho uma ferramenta incrivel e muito poderosa... pq não falaram?!??! :'("},{"author":"Vitor Guerra","comment":"Verdade! Axure é super difundida por aí. Particularmente não uso em minha rotina nem tenho tanta experiência com ela. Dito isso, tenho convicção que a ferramenta é o que menos importa no processo ;)"},{"author":"Diogo Riker","comment":"verdade.. ferramenta boa é aquela q a gente sabe mexer hehehe... mas seria legal citarem o axure :x"},{"author":"heitorspedroso","comment":"Muuuito bom gostei"},{"author":"Vitor Guerra","comment":"Que bom que curtiu!"},{"author":"Mauri Ribeiro","comment":"Prototipação é uma etapa essencial pra o sucesso do projeto. Ótimo episódio! :D"},{"author":"Vitor Guerra","comment":":)"},{"author":"Welton Vaz de Souza","comment":"Excelente episódio. Assisti, Curti e Compartilhei!"},{"author":"Vitor Guerra","comment":"Legal! :)"},{"author":"Fernando Valentini","comment":"Já usamos Origami para animações mas nosso fluxo perfeito agora é: Sketch + Principle + Zeplin"},{"author":"Vitor Guerra","comment":"O Principle quebra um galhão, né! Ainda mais quando bem integradinho com o Sketch"},{"author":"Fernando Valentini","comment":"Sim. Agora meu sonho é criar campos \"reais\" de input e controlar o fluxo dependendo do input informado e integração com os recursos de hardware do device. Mas por enquanto para nós da eNe é o melhor para criar o verdadeiro look and feel do protótipo. Além de ajudar demais para passar as animações para os dev."},{"author":"Vitor Guerra","comment":"Sobre ativar recursos nativos, o Prototype do Craft (Invision) faz isso no Sketch. Não é super completo, está em beta ainda, mas consegue usar a câmera, consultar álbum de fotos, Mail, Safari, Telefone e Mensagens (tudo no iOS).Pode dar uma olhada aqui: https://support.invisionapp...Abração!"},{"author":"Olavo de Carvalho","comment":"Olá pessoalAcho que vale a pena usar XD design, eu um leigo em desenvolvimento que ainda está aprendendo programação, consigo montar um MVP para apresentar no eventos de startup."},{"author":"Vitor Guerra","comment":"É bem por aí mesmo!"},{"author":"Paulo Silveira","comment":"acho que esse é um ponto importante: prototipar até chegar próximo do MVP!"},{"author":"Rubinho_sjr","comment":"Poxaa entrei crente que ia ser de PHP kkkk"},{"author":"Vitor Guerra","comment":"VIxi... espero que tenha gostado mesmo assim ;)"},{"author":"Rubinho_sjr","comment":"Gostei muito mudou minha visão de como projetar um sistema...Sempre fiz os meus projetos com desenhos de papel e varias vezes bati com a cara na parede exatamente pq eles não deixavam realmente claro oq tinha de ser feito... Agora eu vejo que se eu tivesse criado um protótipo mais especifico pras situações poderia ter me dado menos trabalho (e me rendido algum dinheiro pelos projetos que acabei não pegando)Só preciso aprender qual é a melhor forma  pra cada fase do desenvolvimento"},{"author":"Vitor Guerra","comment":"Se precisar de ajuda, me add no facebook: /vitorguerra"},{"author":"Paulo Silveira","comment":"hahaha. vai ter de esperar mais.... :P"},{"author":"Rubinho_sjr","comment":"shaushaus pois é, mas valeu a pena não ser PHP.PHP eu ja conheço, agora prototipagem é algo bem novo pra mim. Não tinha essa visão da importância de planejar assim."},{"author":"Júnior Silva","comment":"Muito bom."},{"author":"Vitor Guerra","comment":"Valeu!"}]}