{"title":"Pagamentos Digitais e o Paypal – Hipsters #29","releaseDate":"31/01/2017","tags":["infra","infraestrutura","Podcast"],"people":["Paulo Silveira","Rodrigo Dantas","Felipe Facchini"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=685%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D685&t_u=https%3A%2F%2Fhipsters.tech%2Fpagamentos-digitais-e-o-paypal-hipsters-29%2F&t_e=Pagamentos%20Digitais%20e%20o%20Paypal%20%E2%80%93%20Hipsters%20%2329&t_d=Pagamentos%20Digitais%20e%20o%20Paypal%20-%20Hipsters%20%2329%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Pagamentos%20Digitais%20e%20o%20Paypal%20%E2%80%93%20Hipsters%20%2329&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Emanuel Carvalho","comment":"Quem nunca tomou um chargeback do Paypal? Como dói viu..."},{"author":"Marquinhus Goncalves","comment":"Acredito muito que a segurança em relação ao pagamento é o fator que mais impulsionou e impulsiona o mercado digital. Excelente episódio parabéns aos envolvidos."},{"author":"Jo Santana","comment":"Ano passado fiz uma pesquisa com todas as plataformas de pagamento, e tive dificuldades para começar com o PayPal, por exemplo. Já com o Braintree, em dois dias já tinha tudo funcionando. Realmente, é muito mais fácil. A frustração veio quando fui criar minha conta e aí vi que não estava disponível para o Brasil.Aí,  quando vocês perguntaram quando o Braintree seria lançado no Brasil, o convidado dá uma volta e desconversa... :("},{"author":"Marcel Santos","comment":"Estou conversando e negociando com o pessoal do pagar.me.Algum dev já teve contato com as APIs deles?Inclusive preciso integrar meio de pagamento via cartão de crédito em um App que  estamos desenvolvendo."},{"author":"Alisson Reinaldo Silva","comment":"Acessei o link dessa plataforma, mas não tem uma tela com as taxas, e o formulário de preenchimento de dados para que eles entrem em contato é enorme, tem campos que só quem já tem um negócio funcionando vai conseguir responder.Não é uma boa opção para quem está começando um projeto. É interessante pra quem já usa algum método de pagamento e busca alternativas."},{"author":"matheus","comment":"Oi Pessoal!Muito obrigado pelo cast e pelo episódio!Gostaria apenas de deixar uma crítica.O convidado do Pay Pal foi muito bacana, mas ele falava como um robô dizendo coisas esperadas de alguém que está \"vendendo o seu peixe\" como que retiradas de uma página \"Sobre nós \".Obrigado e forte abraço !"},{"author":"Paulo Silveira","comment":"é complicado para alguem de uma empresa grande vir falar a primeira vez em um podcast. o felipe costuma ser bem mais solto, mas acho que ele foi muito bem para a primeira vez e trouxe uma historia bacana! proximo sera melhor :)"},{"author":"matheus","comment":"Você tem razão!Obrigado!"},{"author":"Gabriel Lopes Souza","comment":"Queria saber sobre boleto no PayPal"},{"author":"Paulo Silveira","comment":"olha, era um ponto bom pra gente ter colocado na pauta!"},{"author":"Marcos Costa","comment":"Putz gosto demais de ouvir vocês! Já ouvi todos e sempre estou compartilhando, Parabéns Hipsters :)"},{"author":"Diego G.","comment":"o PayPal fez tudo isso, mas implementar um sistema de troca de senha sou lembra senha, ainda não !!!"},{"author":"Marcos Paulo Reis","comment":"Paulo , vcs poderiam criar alguns cursos na Alura de integração com os principais meios de pagamento nas principais linguagens de programação. Acho que esse é um problema para a maioria dos programadores.Vlw"},{"author":"Paulo Silveira","comment":"é algo que a gente sempre quis. o problema é que as apis, integracoes e paineis mudam muito, o que tornaria os cursos muitissimos pereciveis :("},{"author":"Anthony Nalim","comment":"Paulo Silveira  Rapaz tão de parabéns, to sempre acompanhando, conheci aqui através de um Podcast lá no jovem nerd, conteúdo sempre de excelente qualidade, fico incomodado ao ouvir outros Podcasts desde conteúdo, tempo e a qualidade do áudio. Mas tem uma coisa cara kkkkk, eu sempre clico na imagem do podcast pra dar play e quando pauso clico lá de novo pra dar play, não é possível que sou o único kkkk"},{"author":"Paulo Silveira","comment":"hahaha. quando o podcast fizer um ano prometo dar um tapa no visual e UX por aqui!"},{"author":"Luciano Cavaleiro","comment":"Eu acho o checkout atual do paypal sofrivel. Desculpem a sinceridade. Só faltam pedir para o comprador colocar qtos cds Ivete ja lançou! Sinceramente, um checkout que é praticamente um convite ao abandono. Mtos campos de preenchimento. Eles que nao mudem para ver o q vai acontecer qdo stripe ingressar no Brasil! Braintree está no EUA...para o Brasil esse checkout medonho, pq?"},{"author":"Paulo Silveira","comment":"oi Luciano. Acho que todos os checkouts nao transparentes dos grandes players sao nesse estilo. O transparente do paypal é realmente muito superior (veja da alura.com.br)"},{"author":"Luciano Cavaleiro","comment":"Paulo...o podcast foi sensacional, contudo, o Felipe se esquivou por duas vezes sobre quando o braintree será lancado no Brasil. Rs Enfim, continuemos com esse checkout medonho no mobile. ;) Parabens pelo trabalho!"},{"author":"André Luis Gomes","comment":"Muito bom"},{"author":"Eduardo Medeiros Branquinho","comment":"Quando eu abro o link do Rodrigo Dantas, CEO da Vindi, eu sou levado ao twitter de um jogador de futebol.Ps: Quando você abre o site da Vindi, advinha quem está lá na página inicial? Nosso querido hoster, claro!"},{"author":"Rodrigo Dantas","comment":"Eu também jogo bola!"},{"author":"Paulo Silveira","comment":"o gabriel corrigiu o twitter dele, valeu!pois é, esse hipsters, vindi e cohosts é uma panelinha de lascar :P"},{"author":"Camila Costa","comment":"Gosto muito de ouvir os podcasts do hipsters, estou sempre acompanhando. Gostei especialmente desse porque na empresa onde trabalho já fiz vários checkouts e realmente alguns meios de pagamento voltam o site mais para o dono do negócio do que o desenvolvedor, por esse motivo já aconteceu de eu estar utilizando uma api ainda ainda em desenvolvimento sem saber, pois tinha mais de uma versão disponível em diferentes links, de qualquer forma serviu de aprendizado e ainda fui meio que \"tester\" deles rsrs. Quanto ao checkout transparente, desde que começamos a utilizar aumentou significativamente as vendas, eu particularmente prefiro muito mais fazer esse tipo de integração."},{"author":"Paulo Silveira","comment":"Eu tambem prefiro Camila, mas realmente imagino que em alguns casos particulares o checkout tradicional possa ser mais interessante"},{"author":"Rubinho_sjr","comment":"Que bruxaria é essa ?? Tava pensando ontem sobre soluções pra pagamentos online O.o tão de parabéns com essa analise de publico, ouvindo com gosto."},{"author":"Paulo Silveira","comment":":). sabiamos que o tema é algo que os ouvintes estão sempre procurando!"}]}