{"title":"Carreira em Tecnologia – Hipsters #31","releaseDate":"14/02/2017","tags":["carreira","Podcast","programação","web"],"people":["Paulo Silveira","Sergio Lopes","Guilherme Silveira","Fabio Akita"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=689%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D689&t_u=https%3A%2F%2Fhipsters.tech%2Fcarreira-em-tecnologia-hipsters-31%2F&t_e=Carreira%20em%20Tecnologia%20%E2%80%93%20Hipsters%20%2331&t_d=Carreira%20em%20Tecnologia%20-%20Hipsters%20%2331%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Carreira%20em%20Tecnologia%20%E2%80%93%20Hipsters%20%2331&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"DuShin","comment":"Quero dar um relato aqui, pra galera que começou no TI a pouco tempo e com um pouco mais de idade. Comecei a cursar ADS no IFSP aos 27 depois de ter largado o curso de economia. Consegui meu primeiro emprego CLT com dev aos 30 anos, e trabalhei em startups e em empresas grandes como B2W.O mercado não é fácil, então acho que o melhor que você faz é aproveitar o tempo na faculdade para ESTAGIAR. E pra conseguir um estágio você vai enfrentar um preconceito de idade. Então, crie projetos open source, vá a meetups pra criar um networking, \"force\" as pessoas de RH a não te ignorarem.Networking inclusive, voltando a faculdade, é uma das coisas mais importantes que você tira da vida acadêmica.Outra coisa que o mercado maior está em SP. Então acho que é bom levar em consideração mudar se você quer ter maiores chances. EU SEI que não é todo mundo que pode fazer isso, mas se você tiver a chance é bom considerar bastante.  A Lambda3 por exemplo é uma ótima consultoria, da qual eu já fiz parte, que dá muitas chances a pessoas independente de sexo e idade.Sejamos diretos: você está em desvantagem por ter mais idade que um moleque de 20 anos, então tenha consciência disso e ofereça vantagens aos empregadores, seja em conhecimento, seja em proposta salarial.Boa sorte a todos nessa luta."},{"author":"Sérgio Leitão","comment":"Como sempre comento com meus amigos: uma vez \"picado\" pelo bicho do desenvolvimento, já era!Perceber o momento é exatamente algo que estou passando, mas não pretendo cursar uma faculdade antes de buscar as certificações que pretendo...e a Alura está no meu caminho!Ótimo programa...comecei bem!Abraços!"},{"author":"Renato Web","comment":"Minha esposa expressa um grande interesse em iniciar uma carreira em TI.Eu trabalho com Desenvolvimento Web mas não consigo guia-lá a tentar encontrar algo que  possivelmente se adeque a ela.Ela já trabalhou com Finanças, Administração e Comerical.Disse para que pesquisasse algo como Qualidade em Software ou Gestão de Projetos.Alguma tem alguma dica por onde começar?"},{"author":"Rafael Martins","comment":"Nossa, eu pensava em aprender tudo de html depois css e depois para js. Vou mudar isso agora! Valeu."},{"author":"Murilo Xavier","comment":"muito bom o episodio, ja ouvi duas vezes, abriu muito meus olhos, so queria saber a idade que eles entraram na faculdade."},{"author":"Luis Sérgio","comment":"Gostei muito do podcast, mas tenho uma crítica ao comentado sobre o objetivo final de um de vocês ser a programação em si. Foi dito que muita gente tem objetivos finais viajar e consumir, e que tendo como caminho final a programação você está sempre desposto a sair do emprego pra ganhar menos e aprender algo novo.Concordo que muita gente trabalha sem gostar do que faz, e que querer se atualizar sempre é importantíssimo na nossa profissão. Mas colocar na mente de pessoas novas que esse é o único caminho é complicado. Afinal meu objetivo final é formar uma família com um certo padrão de conforto.Hoje meu filho tem um ano e meio, e diminuir a qualidade da escolinha (que está longe das melhores), cortar os alimentos saudáveis e parar de guardar dinheiro não é uma opção que tomaria por livre vontade (já passei dificuldades financeiras onde corte de gastos foram obrigatórios).A solução que eu encontrei para me manter atualizado foi encontrar uma empresa de TI que venda soluções com tecnologias que estão sempre se atualizando. Por ela precisar estar atualizada, vai investir para que os bons funcionários se mantenham atualizados. Diferente de um departamento de TI que vai sempre dar manutenção no que existe ou criar sistemas novos baseados no que a infra da empresa permite.E outra, se o objetivo é a programação por si só, não precisa se atualizar. Basta ficar resolvendo desafios de Hackathon, que pra mim seria o prazer máximo na programação, e viver de fotossíntese."},{"author":"Cassio Fabius Cambraia Ribeiro","comment":"Bem, vou deixar meu desabafo/textão (dividido porque o negócio tá dizendo que é spam) aqui, já que gostei tanto desse episódio do hipsters.tech e tenho sofrido um pouco sobre esse assunto.Entrei para Eng. Elétrica na UnB em janeiro/2008 (17~18 anos) e acabei me ferrando durante todo o curso por diversos motivos. Achava que gostava da área, mas não me dei bem nas matérias específicas. Fui desligado em julho/2015 (sim, 25 anos), fiz o Enem e voltei em janeiro/2016 pra UnB pro curso de Eng. de Redes de Comunicação. Os cursos são beeem parecidos, dentro do mesmo departamento, então aproveitei boa parte. Devo me formar no fim do ano que vem (completando longos 11 anos na universidade, com 27 para 28 anos)."},{"author":"Cassio Fabius Cambraia Ribeiro","comment":"Tive medo de largar Elétrica quase no fim (faltavam 3 semestres para me formar), mas acabei sendo desligado, então aproveitei para mudar de curso também. Quando fiz minha primeira disciplina de computação, já no curso de Redes (aprendi C++), um ânimo absurdo surgiu. Curti demais a parte de Redes também.Problema: por conta do meu rendimento em Elétrica, apesar de ter conseguido arranjar alguns estágios, os coordenadores nunca me liberaram para estagiar. Tive de trabalhar fora da área, como professor particular e professor de inglês durante esses anos."},{"author":"Cassio Fabius Cambraia Ribeiro","comment":"No fim do 1º semestre (junho/julho de 2016), já tava correndo atrás de um estágio na área. Sem experiência, com 26 anos, várias reprovações no histórico e tomando uns nãos de alguns processos seletivos, estava entrando em crise existencial, querendo saber como de nerd na escola eu fui virar um fracasso daqueles.Acabou que TIM e Oi abriram processos seletivos em agosto~setembro, meus sonhos de consumo de trabalho no Brasil. Fui selecionado para as dinâmicas delas. Como em quase todas as outras dinâmicas que participei no ano passado, eu era um dos mais velhos, senão o mais velho. Acabei não indo para a fase final da TIM (falta de esforço minha nessa, admito, pedia para fazer uma história criativa sobre super-herói e eu não tenho imaginação fértil), mas mandei bem na dinâmica da Oi (ser professor em sala me ajudou demais a melhorar minha oratória, há males que vêm para o bem) e acabei conseguindo única vaga!O coordenador de Redes foi bondoso e me liberou para estagiar também. Hoje estou mais tranquilo, trabalhando com a Gerência de Arquitetura de TI da Oi, aprendendo demais sobre DataCenter. Oportunidade foda! Mas continuo receoso ao pensar que terei de arranjar o primeiro emprego já com 28 anos."},{"author":"Cassio Fabius Cambraia Ribeiro","comment":"Uma coisa que curti demais no podcast foi o Fabio Akita falando sobre aprendizado (\"se esse é seu objetivo [aprender uma coisa e pronto], não aprende, não aprende nada, vai fazer outra coisa\" hahahaha). Eu sempre amei idiomas, então fiz cursos de inglês, alemão, italiano e francês enquanto eu estava no buraco negro da Elétrica. Percebia que os recrutadores gostavam dessa parte do meu currículo (apesar de eu dizer que o alemão e o italiano estavam enferrujadíssimos), provavelmente porque viam que eu gostava de aprender. Minha paixão por idiomas pode ter me aberto algumas portas. :DAcabei trocando os cursos de idioma no meio do ano passado pela matrícula na Alura para aprender outras linguagens de programação, já que me ajudaria muito mais profissionalmente. Boa parte do que aprendi sobre Javascript, Python e Linux foi lá, coisa que uso tanto no estágio quanto na graduação."},{"author":"Cassio Fabius Cambraia Ribeiro","comment":"Pro pessoal mais novo e mais adiantado do que eu, fica o pensamento otimista: segurem a ansiedade que vocês ainda estão melhores do que muita gente, cada um tem seu tempo. Não ser um mini-gênio é chato, mas não torna as coisas impossíveis. Entretanto não fiquem parados, continuem aprendendo e ganhando experiência, para não deixarem o tempo passar à toa. :DPro pessoal mais velho mudando de área, fica meu desejo de força e minha admiração, vocês são corajosos pra caralho! Eu tive um cagaço de trocar algumas disciplinas do currículo do curso com 25 anos, não consigo imaginar o quanto de coragem que vocês têm ao fazer uma mudança maior na carreira. Com determinação vocês vão chegar aonde desejam!"},{"author":"Paulo Silveira","comment":"oi Cassio! Que mensagem bacana, certamente vai inspirar a muitos. Tenho alguns colegas que demoraram muito para se formar ou entrar no mercado de trabalho e há sim um preconceito/barreira. Mesmo no seu caso, que já demonstrava o esforço com os idiomas e estudando em uma das mais prestigiadas universidades do brasil, essas barreiras apareceram. Mas dá sim para passar por elas."},{"author":"Carlos Henrique Fructuoso de M","comment":"Já fiz o que o Akita comentou, de baixar o salário para aprender uma tecnologia que não tinha experiência, corri o risco e simplesmente depois a empresa não me valorizou, precisei trocar de empresa para ser mais valorizado. Enfim nunca espere que a empresa vai te valorizar, valorize-se você mesmo."},{"author":"Paulo Silveira","comment":"Carlos Henrique, tambem acho um risco a dica do Akita, mas certamente em muitos casos tambem dá certo."},{"author":"Cassio Fabius Cambraia Ribeiro","comment":"Bem, vou deixar meu desabafo/textão aqui, já que gostei tanto desse episódio do hipsters.tech e tenho sofrido um pouco sobre esse assunto.Entrei para Eng. Elétrica na UnB em janeiro/2008 (17~18 anos) e acabei me fodendo durante todo o curso por diversos motivos. Achava que gostava da área, mas não me dei bem nas matérias específicas. Fui desligado em julho/2015 (sim, 25 anos), fiz o Enem e voltei em janeiro/2016 pra UnB pro curso de Eng. de Redes de Comunicação. Os cursos são beeem parecidos, dentro do mesmo departamento, então aproveitei boa parte. Devo me formar no fim do ano que vem (completando longos 11 anos na universidade, com 27 para 28 anos).Tive medo de largar Elétrica quase no fim (faltavam 3 semestres para me formar), mas acabei sendo desligado, então aproveitei para mudar de curso também. Quando fiz minha primeira disciplina de computação, já no curso de Redes (aprendi C++), um ânimo absurdo surgiu. Curti demais a parte de Redes também.Problema: por conta do meu rendimento em Elétrica, apesar de ter conseguido arranjar alguns estágios, os coordenadores nunca me liberaram para estagiar. Tive de trabalhar fora da área, como professor particular e professor de inglês durante esses anos.No fim do 1º semestre (junho/julho de 2016), já tava correndo atrás de um estágio na área. Sem experiência, com 26 anos, várias reprovações no histórico e tomando uns nãos de alguns processos seletivos, estava entrando em crise existencial, querendo saber como de nerd na escola eu fui virar um fracasso daqueles.Acabou que TIM e Oi abriram processos seletivos em agosto~setembro, meus sonhos de consumo de trabalho no Brasil. Fui selecionado para as dinâmicas delas. Como em quase todas as outras dinâmicas que participei no ano passado, eu era um dos mais velhos, senão o mais velho. Acabei não indo para a fase final da TIM (falta de esforço minha nessa, admito, pedia para fazer uma história criativa sobre super-herói e eu não tenho imaginação fértil), mas mandei bem na dinâmica da Oi (ser professor em sala me ajudou demais a melhorar minha oratória, há males que vêm para o bem) e acabei conseguindo única vaga!O coordenador de Redes foi bondoso e me liberou para estagiar também. Hoje estou mais tranquilo, trabalhando com a Gerência de Arquitetura de TI da Oi, aprendendo demais sobre DataCenter. Oportunidade foda! Mas continuo receoso ao pensar que terei de arranjar o primeiro emprego já com 28 anos.Uma coisa que curti demais no podcast foi o Fabio Akita falando sobre aprendizado (\"se esse é seu objetivo [aprender uma coisa e pronto], não aprende, não aprende nada, vai fazer outra coisa\" hahahaha). Eu sempre amei idiomas, então fiz cursos de inglês, alemão, italiano e francês enquanto eu estava no buraco negro da Elétrica. Percebia que os recrutadores gostavam dessa parte do meu currículo (apesar de eu dizer que o alemão e o italiano estavam enferrujadíssimos), provavelmente porque viam que eu gostava de aprender. Minha paixão por idiomas pode ter me aberto algumas portas. :DAcabei trocando os cursos de idioma no meio do ano passado pela matrícula na Alura para aprender outras linguagens de programação, já que me ajudaria muito mais profissionalmente. Boa parte do que aprendi sobre Javascript, Python e Linux foi lá, coisa que uso tanto no estágio quanto na graduação.Pro pessoal mais novo e mais adiantado do que eu, fica o pensamento otimista: segurem a ansiedade que vocês ainda estão melhores do que muita gente, cada um tem seu tempo. Não ser um mini-gênio é chato, mas não torna as coisas impossíveis. Entretanto não fiquem parados, continuem aprendendo e ganhando experiência, para não deixarem o tempo passar à toa. :DPro pessoal mais velho mudando de área, fica meu desejo de força e minha admiração, vocês são corajosos pra caralho! Eu tive um cagaço de trocar algumas disciplinas do currículo do curso com 25 anos, não consigo imaginar o quanto de coragem que vocês têm ao fazer uma mudança maior na carreira. Com determinação vocês vão chegar aonde desejam!"},{"author":"Victor Mattos Dimen","comment":"Já ouço o podcast desde o primeiro episódio e pelo jeito vou continuar ouvindo :D. Obrigado e parabéns.Tenho uma dúvida quanto ao desenvolvimento na carreira. Já consegui entrar na área de desenvolvimento à dois anos e adoro desenvolver e criar, mas no intuito de quebrar a primeira barreira da área, que é o ingresso no mercado, acabei entrando em empresas que não prezam pelo desenvolvimento e passam o dia a dia correndo atrás do rabo (resolvendo bugs gerados por fix de outros bugs) num interminável carrossel XGH.O problema é que, por mais que eu preze por código elegante e não aceite o \"faz de qualquer jeito para entregar rápido\", me parece que, aos olhos das empresas mais sérias, estou ao mesmo tempo cru demais e corrompido com métodos toscos para ser considerado para uma vaga.O ponto é que acho que existem dois mercados de desenvolvimento, os sérios, mais voltados para os que veem a tecnologia como fim, e os menos preocupados com a profissão, que acham que a tecnologia é o meio para outras coisas como dinheiro. E migrar entre esses dois não é fácil (digo por experiência própria).Minha dúvida é: como mudar de mercado sendo que você não pode mais diminuir sua condição, pois ela já é a mínima possível, para entrar num lugar para aprender (mas aprender a fazer do jeito certo)?"},{"author":"Rancha","comment":"poxa,eu imagino que seja difícil, mas pensando em pessoas saem de uma área nada a ver com tecnologia e programação para entrar nesse mercado e conseguem acho que o processo de migração deve ser similar, como o Lucas e o DuShin descreveram, com a vantagem que vc já tem a faca na mão, só falta o queijo"},{"author":"Lucas Palma Stabile","comment":"Caramba, eu passei por isso também. É complicado, as vezes ouvimos aqui no hipsters e outros lugares sobre novas tecnologias, ferramentas e processos e na nossa experiência profissional continuamos \"correndo atrás do rabo\", me dando a mesma impressão dos dois mercados que você comentou. Realmente gostaria de dicas nessa situação, mas creio que uma das soluções seria aprender e testar novas tecnologias com melhores práticas por fora, no tempo live, ir aos encontros e fazer networking, trabalhar com open source."},{"author":"Clayton Passos","comment":"Sempre com informações muito relevantes,Se me permitir gostaria de deixar uma sugestão para o https://hipsters.jobs/Puxar os dados do Linkedin :D E login com perfil do linkedin, ter de decorar outro login/senha ou anotar mais um no gerenciador de senhas é doido em...Quanto a estudar, se preparar pro mercado, cuidado pra não ficar sempre estudando, buscando a perfeição e nunca ir pro mercado. Tudo tem um meio termo, é bom sempre lembrar que: \"Progresso é melhor que perfeito\", \"Perfeição não é ruim, mas é caro e freia o progresso\"https://medium.com/desk-of-...Concordo quanto a mudança na carreira, comecei com programação no Microsoft Access :D Migrei pro Delphi, então PHP, Java e agora me mantenho com TypeScript/JavaScript (Angular 2) e Java/Spring"},{"author":"Eduardo Dos Santos Marinho","comment":"Excelente conteúdo abordado, este podcast deveria ser escutado por todos que tem interesse em aprender a programar. Comecei a estudar pela Alura e depois iniciei a faculdade confesso que fiquei com a duvida se era necessário faculdade ou se somente um curso especifico atenderia.Hoje tenho a certeza de que ambos são excelentes pois são complementares me dando muita facilidade em aprender qualquer matéria. Parabéns!!"},{"author":"mfdavid","comment":"Adoro o hipsters.tech! Parabéns mesmo pelo trabalho!Mas dois pontos me chamaram muito atenção neste episódio:1- Condições de trabalho:Pessoas, não sejam capachos de empresas. Não aceitem trabalhos medíocres. Não aceitem condições ruins de trabalho. Não aceitem ser explorados EM HIPÓTESE ALGUMA. Se a empresa não consegue te dar o mínimo necessário para sobreviver bem, não lhes dê o seu tempo de vida; a sua força de trabalho. Continue procurando: ainda existem empresas que tratam decentemente seus funcionários.Um grande mal da nossa área é ainda termos MUITA gente aceitando condições absurdas de trabalho. Não aceite ser PJ se seu trabalho constituir uma relação empregatícia. Ex: se você trabalha 8h por dia para uma empresa e possui um chefe, é *ILEGAL* ele te contratar como PJ - sei que isso não foi abordado no podcast, mas é só um exemplo - eles são OBRIGADOS POR LEI a te contratar como CLT. Se até as empregadas domésticas conseguiram se unir para forçar receberem seus direitos trabalhistas, pq nós ainda temos dificuldade? Não aceite \"vale gasolina de 1000 reais\" (sim, já me ofereceram, muitos anos atrás, um valor abusado de vale combustível onde eu só precisava comprovar 5% dos gastos).Não aceite trabalhar por um valor que mal paga o aluguel de sua casa de 1 cômodo. Não venda seu tempo para enriquecer pessoas que não se importam o suficiente com você.2- IdadeO Uncle Bob tem um video muito bacana onde ele fala sobre várias coisas, inclusive um pouquinho sobre isso. Segundo ele, um dos grandes problemas da computação foi JUSTAMENTE começarmos a diminuir demais a idade dos desenvolvedores... Então pra galera mais velha: calma, nem todo mundo pensa como o Akita. Tem gente que vai sim te valorizar. Link (ele começa a falar sobre o assunto lá pros 34min): \n\n\nReproduzir\n\n\n Ocultar\n\n\n\n\n"},{"author":"Alisson Moraes","comment":"Muito massa!Aguardando os próximos podcast's, excelente ponto de vista de todos vocês... Um forte abraço e muito sucesso!!!"},{"author":"Daniel Moura","comment":"Muito bom o Podcast vou ficar de olho no Hipster Ponto Jobs atrás de umas vagas de estágio que está difícil arranjar. Parabéns continuem com o ótimo trabalho.."},{"author":"Black Power Dog","comment":"Ótimo episódio ! Sou programador há 25 anos e vivo de vender apps em DELPHI, que muita gente fala que tá morto há anos. Tenho uma empresa de uma única pessoa (eu) e os apps Win32 em DELPHI continuam me sustentando (e muito bem) até hoje. Claro que sei que não vai durar para sempre e por isso comecei a estudar programação para web há uns 4 anos, para migrar meus apps aos poucos. Aprendi o básico de PHP para o backend e o trio CSS+HTML+JS para o frontend. Já migrei alguns dos meus apps, que continuam atendendo bem meus clientes. Nunca estudei o framework da modinha, não sei nada de Angular, React, Blablabla etc e nunca me fez falta ! O que importa é seu app atender seu cliente, afinal ele não faz idéia como funciona debaixo do capô. Não me sinto mal por ter essa postura, porque no final o meu objetivo é atendido e meu cliente fica satisfeito, seja o app feito em DELPHI ou em com o básico de JS puro mesmo. Fico vendo um monte de programador ralando todo mês pra aprender a tecnologia da modinha e ganhar 3k por mês e não vejo o menor sentido nisso ; com meu DELPHI e básico de web ganho muito mais que isso e ainda fico tranquilo à noite ao invés de virar madrugada pra aprender o framework da modinha. Foco no produto é o que importa e se o produto cumpriu seu papel, o objetivo foi atendido. Acho que a maioria dos programadores deviam ter uma visão mais empreendedora e menos escravo de empresa dos outros. Sem querer criar polêmica, só minha opinião :)"},{"author":"Paulo Silveira","comment":"Falou tudo funky dog! Nao vejo mal algum em fazer delphy ou php purao ou o que for. O produto tem de atender as necessidades do cliente. Obvio que a manutencao de um produto desses pode ser mais dificil se tiver escassez de profissionais daquela tecnologia, mas se é um saas ou revenda sua, o problema é seu e voce sabe medir esse risco.Excelente depoimento."},{"author":"Hiran Neri","comment":"Muito foi falado sobre iniciar em uma linguagem mainstream dar o start na carreira, porém as vagas no mercado para estágio/júnior/trainee pedem muito mais do que, HTML, CSS,  e Javascript, OOP, apis java e SQL, e então qual é a stack de tecnologias necessárias para começar no mercado?"},{"author":"Paulo Silveira","comment":"oi Hiran. Sempre tem as vagas malucas para estágio que pedem uma lista com 20 tecnologias alem de frances e ingles fluentes :). Mas eu realmente vejo emrpesas serias que pedem o minimo de conhecimento em JavaScript e html. Realmente nao é a maioria, mas se voce estiver com esses 3 um pouco afiados, acredito que seja facil que uma empresa seria reconheça suia capacidade/talento."},{"author":"Hiran Neri","comment":"Obrigado Paulo por ter respondido, fico agradecido. Porém em sites conhecidos de vagas de emprego, sinceramente eu não nenhuma pedindo somente os \"três mosqueteiros\" da web (html+css+js). Ter somente eles como requisito para vagas de backend não seria uma utopia?"},{"author":"MelissaMoreira","comment":"Nenhum desses três é essencialmente back end, Hiran.Essas são as 3 tecnologias base do front. Se você quer entrar na área como back end acredito que o ideal seja você começar a aprender php, que é a linguagem de back com a menor curva de aprendizagem e com bastante mercado."},{"author":"Hiran Souza","comment":"Concordo contigo MelissaMoreira  realmente os três não são requisitos para backend, mas infelizmente vejo muitas vagas pedindo o conhecimento do básico desses três. Atualmente estou me aprofundando em JAVA, mas sei que só JAVA não é essencial para iniciar como jr. por isso estou me especializando em JAVA e aprendendo pelo menos o essencial de PHP. Eu só não concordo muito com o que disseram porque na realidade é pedido muito mais do que HTML,CSS,JS."},{"author":"DuShin","comment":"Quero dar um relato aqui, pra galera que começou no TI a pouco tempo e com um pouco mais de idade. Comecei a cursar ADS no IFSP aos 27 depois de ter largado o curso de economia. Consegui meu primeiro emprego CLT com dev aos 30 anos, e trabalhei em startups e em empresas grandes como B2W.O mercado não é fácil, então acho que o melhor que você faz é aproveitar o tempo na faculdade para ESTAGIAR. E pra conseguir um estágio você vai enfrentar um preconceito de idade. Então, crie projetos open source, vá a meetups pra criar um networking, \"force\" as pessoas de RH a não te ignorarem.Networking inclusive, voltando a faculdade, é uma das coisas mais importantes que você tira da vida acadêmica.Outra coisa que o mercado maior está em SP. Então acho que é bom levar em consideração mudar se você quer ter maiores chances. EU SEI que não é todo mundo que pode fazer isso, mas se você tiver a chance é bom considerar bastante.  A Lambda3 por exemplo é uma ótima consultoria, da qual eu já fiz parte, que dá muitas chances a pessoas independente de sexo e idade.Sejamos diretos: você está em desvantagem por ter mais idade que um moleque de 20 anos, então tenha consciência disso e ofereça vantagens aos empregadores, seja em conhecimento, seja em proposta salarial.Boa sorte a todos nessa luta."},{"author":"AkitaOnRails","comment":"E depende da empresa. Por exemplo, se for de Natal, Teresina, Anápolis, Goiânia, Novo Hamburgo, Sorocaba, Campinas, além de São Paulo, tenho escritórios em cada um desses lugares."},{"author":"Felipe","comment":"Como sempre um podcast com assunto excelente, mas que me fez ficar ainda mais preocupado, pois tenho 32 anos e estou terminando minha graduação em Engenharia da Computação e ao ouvir do preconceito em contratar pessoas mais velhas é angustiante."},{"author":"AkitaOnRails","comment":"Meio atrasado na resposta, mas vi que várias pessoas ficaram preocupadas com o tal \"bias de idade\". O problema de tentar generalizar sempre é complicado porque a gente procura termos simples pra explicar algo complicado e isso acaba injustiçando alguma parcela da população.Dando a explicação mais longa, o que se vê - na média - é que o povo mais novo, que acabou de sair da faculdade ou está no primeiro emprego, tem consciência que sabe muito pouco e que precisa estar ativamente aprendendo mais. Mas quem já está na área há mais anos, naturalmente começa a achar que já sabe bastante coisa e todo novo aprendizado fica parecendo que você está \"jogando fora\" o que demorou pra aprender antes, então é sempre um bloqueio.Mas de novo, isso vai da pessoa. Tem gente nova que acha que sabe tudo. Tem gente mais velha (de idade) que tem prazer em ser provado errado e aprender coisas novas.O perfil é mais importante do que a idade. Se a atitude for sempre de \"meu copo está cheio, não cabe mais nada\", não importa a idade, você não evolui. Se a atitude for sempre de \"posso derramar um pouco pra continuar enchendo mais\", aí você não tem limites.Uma coisa que não deve ter ficado muito claro: eu sou um desenvolvedor \"velho\" (tenho 40 anos). Se for preconceito com idade, eu deveria ter preconceito comigo mesmo ;-)(agradecimentos ao amigo Fabio Kung que me relembrou do tema, eu deveria ter respondido aqui antes)."},{"author":"Paulo Silveira","comment":"oi Felipe! Realmente há um preconceito, mas como falamos há forma de voce demonstrar seu conhecimento e, como pode ver aqui em diversos comentáriso de pessoas na sua situação (na verdade de pessoas bem mais velhas) tem muita gente contratando independente do perfil de idade."},{"author":"Felipe Nogueira","comment":"esse podcast foi o mais desmotivacional que eu ja vi. Vocês realmente são carrascos na hora de contratar kkkk'  Quer dizer então que eu tinha que estudar física e matemática pra entra em uma federal há 4 horas de distância da minha casa para só no quarto ano ( depois de ter morrido de fome porque eu sou pobre ), eu serei contratado pra ganhar 800 reais?Meus sinceros..ok pra vocês. A faculdade federal ser dificil pra entrar, não é um mérito, é uma deficiencia desse país e vocês com certeza estão vendo pelo ENORME número de péssimos programadores, que essa técnica é uma BOSTA. Vestibular não prova nada. Só prova que o riquinho pagou uma escola e pré-vestibular e entrou 2 anos na frente do cara que estudou um monte de merda e perdeu tempo.o resto do podcast ok. Nota 6 pra esse podcast."},{"author":"amaurisjunior","comment":"Felipe, eu venho de família humilde, formei em faculdade particular e nunca tive problemas para encontrar empregos. Nas entrevistas o que conta não é a Federal, ou sua pós nos EUA ou sua fluência em inglês, mas sim sua experiência, o que pode agregar para a empresa e se mostrar ser uma pessoa comprometida e aberta a aprender coisas novas. Atualmente sai de anos programando em PHP para entrar em uma empresa que trabalha com C# e Oracle (tecnologias que nunca trabalhei), minha bagagem anterior fez com que eu conseguisse a vaga.Antes que fale \"ah mas vc já trabalhou antes então tem exp\", eu estagiei na faculdade aos 17 anos de idade, quando eu mal sabia HTML e javascript era uma tremenda novidade. Aprendi a programar por curiosidade para um projeto de férias do estágio e hoje tiro meu sustendo disso. enfim, não ache que não estar em uma federal vai fazer a diferença.. com o Paulo disse, creio que vc não absorveu bem o que foi falado, sucesso no mercado."},{"author":"Felipe Nogueira","comment":"eu absorvi, eu só acho injusto esses chefões poderosos desprezar quem vem de faculdade de pobre. Parece que eles tem um prazer interno em desprezar as pessoas pobres. É por isso que partidos como o PSOL ganham tanta força. E cara, eu sei TUDO, eu praticamente posso me chamar de fullstack dev, mas mesmo assim, os cara desprezar quem veio da pobreza.Os chefes que eu tive, tinham prazer em aparecer com os carros deles na hora que eu chegava e falar \" o café ja esta pronto?\" enquanto os outros estagiários de escola USPERIANA, eles só faltavam se ajoelhar e chupar esses mulquetes que não sabiam de nada."},{"author":"Paulo Silveira","comment":"oi Felipe. Acho que voce nao captou direito a opiniao dos diversos convidados, que inclusive eram antagonicas em alguns pontos. Nao precisa fazer a faculdade, varia de pessoa pra pessoa, varia o timing e tem gente que tem oportunidades bem melhores que os 800 reais e bem mais cedo que no 4o ano."},{"author":"Rafael da Costa Pereira","comment":"Ótimo podcast, comecei minha carreira com Delphi (Delphi vs VB), depois migrei para o C# (C# vs Java), hoje trabalho com c# e Angular (Angular vs React vs Vue vs VariosOutrosFrameworksJS) e sempre cuidei pra nunca desenvolver esse raciocinio de rivalidade entre tecnologias. Hoje com 10 anos de carreira penso que conhecer várias linguagens melhora e muito o raciocinio lógico e deixa o programador mais maleavel e com mais agilidade em resolucao de problemas."},{"author":"Cristina Barbosa da Silva","comment":"Gostei, mas foi foda ouvir que existe um preconceito em contratar pessoas mais velhas, pois elas não seriam flexíveis em aprender. Se for assim, não vou ter a minha primeira oportunidade, tenho 34 anos e mudei de carreira há menos de 1 ano. #Chateada!"},{"author":"Diego Parente","comment":"Oi Cristina!Acho que a pegada não foi essa 😁!O que entendi é que tem gente mais velha que acha que sabe tudo, mas o mesmo acontece com quem é mais novo!O segredo é ter sede por conhecimento de forma infinita!Obs.: tenho 31 anos e ainda não não trabalho como programador, mas tá perto! 😉 sucesso para nós!!"},{"author":"Júlio Silva","comment":"Não veja por esse lado Cristina, o que eu entendi foi que quem já sabe mto talvez tenha certa dificuldade em inovar nesses assuntos."},{"author":"Kaique de Miranda","comment":"Acho que o que ele quis dizer não foi exatamente isso, pelo menos não foi assim que entendi, ao meu ver, se você teve a coragem de mudar de carreira, acho que já um mega começo para provar ao contrario do que eles falaram, ter essa coragem já te faz diferente moça \\o"},{"author":"AkitaOnRails","comment":"Exatamente. Eu tenho um desenvolvedor Rails que tem seus mais de 40 anos! Ele tem pouca experiência ainda, nem era programador alguns anos atrás. Mas correu atrás. Ele ganha a mesma coisa que um programador nível junior, mas ele se dispôs a querer aprender na prática. A gente se encontrou no meio do caminho, nem ele, nem eu. Agora só depende da vontade dele de continuar crescendo. O que não rola é o cara que tem 20 anos de VB6 nas costas, decidiu que quer ser programador Node.js mas quer continuar ganhando a mesma coisa que o banco que ele trabalha paga por 20 anos de carreira. Não vai acontecer."},{"author":"ALEXANDRE ATANES DE JESUS","comment":"Os trabalhos em grupo na Universidade são fundamentais para essa garotada que hoje em dia não está tão acostumada a lidar \"diretamente\" com outras pessoas e vão precisar desse \"convívio\" mais pessoal com seus parceiros e colegas de trabalho quando estiverem no mercado!!"},{"author":"ALEXANDRE ATANES DE JESUS","comment":"Parabéns pelo \"discussão\" senhores, muitos dos assuntos que vocês estão debatendo eu tento trabalhar com meus alunos na Universidade Metodista de São Paulo e acho que estamos em um bom caminho, pois nosso trabalho vai muito ao encontro das dicas e informações que vocês passam nesse podcast!!"},{"author":"Bruno Lellis","comment":"Um ponto que pode ser considerado uma verdade absoluta na área de TI, mas pode não estar tão claro para quem está começando, é a questão do inglês. Se a faculdade pode ser \"deixada de lado\" por uma questão de timing, conforme o Akita citou, o inglês é indicustivelmente essencial."},{"author":"Sérgio Lopes","comment":"Bem lembrado. Em especial o inglês tecnico pra leitura, esse absolutamente essencial. Se conseguir escrever tbm, otimo. E, claro, proeficiencia pra falar e etc sao legais mas não tão essenciais."},{"author":"Bruno Lellis","comment":"Boa! Concordo com essa separação :)"},{"author":"Ednilson Campos","comment":"O Fabio Akita faz juz ao nome do podcast, no quesito mudar de emprego.Parabéns a todos"},{"author":"Ricardo Aleixo","comment":"Olá pessoas, mais um ótimo Podcast, tirou algumas dúvidas que eu tinha.  Tenho quase 43 anos e passei grande parte da minha vida profissional trabalhando com redes de dados em grandes operadoras,  mas minha paixão é programação e tenho investido muito nisso, tenho faculdade na área mas aprendo com muita facilidade, sempre que há necessidade faço sistemas no trabalho pra facilitar análise de dados,  já fiz vários cursos na Alura e sou consumidor voraz por livros na área, não preciso nem dizer minha frustração ao ouvir que existe essa discriminação por causa de idade... Mas não tem problema, continuo acreditando, ótimo Podcast, abraços "},{"author":"AkitaOnRails","comment":"Não é \"discriminação\", veja minha resposta acima: http://disq.us/p/1g7fnb2"},{"author":"AkitaOnRails","comment":"Aproveitei que fui relembrado do tema, para complementar mais sobre isso: http://hipsters.tech/carrei..."},{"author":"Ulisses de Castro","comment":"Mesmo dilema, tenho 37  e estou me empenhando para mudar da área de banco para a área de programação, realmente parece que as empresas preferem os mais jovens,  mas não vou desistir. Confesso que algumas vezes causa frustração."},{"author":"Rafael Geronimo","comment":"Ricardo, também me senti frustrado ao ouvir isso. Tenho 33 anos, fiz alguns cursos da Alura, estou cursando Sistemas para Internet e pretendia seguir carreira na área. Saber que empresas só contratam os mais jovens me fez repensar se vale a pena o esforço. E se eu não conseguir freelas?"},{"author":"Sérgio Lopes","comment":"Cara eu acho que vc está no caminho certo. Eu nao vejo tanto problema pra contratacao por causa da idade somente. O que pode atrapalhar é que geralmente a pessoa com 30/35 anos ja tem uma vida que exige mais grana. E ai comecar do zero pode atrapalhar. Mas aqui mesmo na Caelum: semana passada contratei uma estagiaria de 29 anos, no meio da faculdade de TI. (ja era formada, trabalhava, ganhava mais, mas queria mudar de area, estava disposta a voltar a ser estagiaria)"},{"author":"Cristina Barbosa da Silva","comment":"Legal saber Sérgio, eu estou buscando estágio e no momento não estou muito preocupada com grana e sim em aprender e ter uma oportunidade, mas é lógico que eu já tenho uma bagagem e não posso ocultá-la, ou seja, tenho uma personalidade e um jeito de trabalhar e isso a gente carrega. Gostei muito da discussão sobre a questão do trabalho em equipe. Abraço"},{"author":"Ricardo Aleixo","comment":"Opa Rafael, também fiz Sistemas para Internet, mas não desanima não, eu tenho o firme propósito que vou seguir essa carreira, se não for como programador, talvez como empreendedor, onde o conhecimento adquirido também vai ser importante, quem sabe. A maior dificuldade no meu caso acaba sendo o famoso trabalho em grupo, por outro lado, já que não tenho equipe, acabo aprendendo de tudo um pouco pra fazer sozinho, e acredite, com persistência a coisa anda, a discriminação acaba sendo só um obstáculo a mais, mas eles existem pra serem superados, se eu não posso mais ser um garoto de programa, quem sabe um tio.. kkkkkkk"},{"author":"Sérgio Lopes","comment":"Desanima não. Ve esse meu comentario la embaixo: http://disq.us/p/1g64hye"},{"author":"Leonarde Firmino","comment":"Tenho 22 anos, e durante 4 anos eu estudei em um curso que depois não era meu perfil, simplesmente pela oportunidade de bolsa que apareceu quando terminei o ensino médio, mesmo sabendo desde o inicio que não era o meu perfil, durante boa parte desse tempo eu me enganei para continuar no curso, e acabei concluindo-o. Então, nos últimos semestres eu acabei decidindo que iria fazer algum dos cursos da área de tecnologia como eu queria desde a época do colégio, e que eu sempre gostei, mas nunca havia estudado a fundo, e esse semestre vou começar o curso de Sistemas de Informação.O que mais me assusta, é que escutando os diversos NerdTech's, os NerdCast sobre profissão programador, e obviamente o Hispters.tech, o assunto idade acabava entrando pauta e é sempre falado dos jovens, de 16, 17, 18 ~ 20 anos, como até também foi falado nesse episódio, e pelo que é dito, todos já contam com uma gama de informação e experiência bem avançado, conhecimento de diversas linguagens, etc. E eu aqui, indo pros 23, começando a aprender, sem nenhuma experiencia... e empolgado pelo inicio das aulas, enquanto isso, buscando podcasts, videos, cursos(gratuitos por enquanto) e qualquer meio que possa trazer mais informação a respeito...Obrigado, desculpem o textão, e parabéns pelo episódio(que veio em boa hora) e pelo podcast no geral."},{"author":"Vinicius Duarte","comment":"Cara, estou mais ou menos no mesmo patamar que o seu, mas desde de moleque já tinha em mente em trabalhar com TI, e fui amadurecendo essa ideia até entrar no curso tecnico e começar aprender programação. Mas atualmente eu estou na fase de \"TEM COISA PARA CARAIO NESSA ÁREA\" e acabo me sentindo burro e ignorante em diversos assuntos, mas eu decidi que iria seguir na linguagem Java pelo o que mais pede em vagas de empregos.E sempre me sinto pra trás também, tenho quase 22 anos e há 4 tento entrar na area de desenvolvimento, e já desenvolvi vários projetos que são usados no meu trampo atual (que é na área administrativa), mas ainda sim me sinto como programador Crtl+C e Crtil+V orientado a StackOverFlow, e cara, me sinto pior ainda, de não saber desenvolver algo do zero sem consultar alguma fonte de exemplo e etc.E pra não me deixar na bad evito pensar que existe pessoas com 25 anos seniors e ganhando salários de 5 dígitos. Sem contar com vagas de JUNIOR pedindo BARACHEL em ciencias da computação. O negócio mesmo é ignorar e continuar estudando mesmo."},{"author":"Sérgio Lopes","comment":"Cara fica tranquilo. Vc ta nao ta velho nao. Toca ai esse seu plano que me pareceu bem bom. Boa sorte!"},{"author":"Emanuel Carvalho","comment":"Um cara do gabarito do Fabio Akita deve ganhar muita grana não!?"},{"author":"Black Power Dog","comment":"O problema é que independente do gabarito do cara, enquanto ele for funcionário de empresa dos outros não vai ganhar dinheiro. Só empreendedor ganha $ nesse país, infelizmente."},{"author":"Paulo Silveira","comment":"eu imagino que deveria ganhar sim, mas hoje o Akita é empreendedor, aí depende de muitos fatores."},{"author":"benLopes","comment":"Parabéns pelo postcast, ótimo papo. E até que enfim o Guilherme participou, que ele dê a cara mais vezes no podcast..."},{"author":"Mauricio Mutte","comment":"Sou bem novo, tenho 16 anos e gosto de aprender novas tecnologias por diversão mas não sei se devo só continuar estudando assim até a faculdade ou se arranjo algum emprego na área mas também não sei se empresas contratam gente com a minha idade. Eis minha duvida, eu devo continuar só estudando? Ou tentar buscar experiência em algum trabalho?"},{"author":"Sérgio Lopes","comment":"Cara eu comecei com essa idade tbm e ninguem ia me dar emprego full (e nem minha mãe ia deixar). Então eu fui pegando freelas pra tudo que é coisa. Nem ganhava muito dinheiro, mas ganhei muita experiência. Fiz sistema pro escritorio do meu pai, pra um professor do colegio e ate o site do colegio (tudo isso freela pago mesmo, com usuarios reais, nao projetinho de teste)."},{"author":"Mauricio Mutte","comment":"Vou continuar estudando e criando projetos \"pra mim\" enquanto não surge algum freela ^^"},{"author":"Cassio Fabius Cambraia Ribeiro","comment":"Maurício, mas corre atrás, oportunidades não caem do céu. :DExistem sites para você tentar pegar esses freelas, não sei se você já conhece:www.getninjas.com.brwww.upwork.comwww.br.freelancer.comBoa sorte!"},{"author":"Guilherme Rodrigues","comment":"sobre o fw da vez de Js,  o vueJs tem crescido muito na comunidade Brasileira."},{"author":"Monica Vasconcelos","comment":"Ruby x Python! O que começar? Escolhi Python. Fiz certo?"},{"author":"Sérgio Lopes","comment":"Dificil opinar sem saber o resto do cenario. Mas la vai: Se vc ja conhece uma das linguagens mainstream (Java, .NET, Front-end) e ta querendo uma nova, Ruby e Python sao legais sim. Nao recomendo como 1a linguagem porem. Se vc quer arrumar emprego depois, ai no Brasil o Ruby me parece mais usado no mercado (apesar de eu gostar mais de Python)"},{"author":"Monica Vasconcelos","comment":"Pois é, já tenho conhecimento intermediário em Java. Quero trabalhar com IA e Análise de Dados e, pelo menos nas pesquisas que eu fiz em sites brasileiros e estrangeiros, Python é fortemente recomendado."},{"author":"Sérgio Lopes","comment":"Boa, me parece uma boa escolha! Realmente Python é bem forte nessa comunidade, muito mais que Ruby"},{"author":"Monica Vasconcelos","comment":"Certamente!!!"},{"author":"Vagnerlandio Nunes","comment":"Tive a mesmo dúvida e escolhi Ruby. O problema que encontro é que para nós que  estamos começando, a gente encontra muitos profissionais que já usaram e abusaram dessas linguagens e agora dizem que existem alternativas melhores aos propósitos para as quais elas for feitas. "},{"author":"Monica Vasconcelos","comment":"Na minha resposta acima, para o Sérgio, está motivo pelo qual escolhi Python."},{"author":"Olavo de Carvalho","comment":"Olá pessoal sou formado em administração, e minha carreira têm dado uma reviravolta pois a demanda de tecnologia é tão grande que eu no cargo de analista de CRM na aréa comercial automaticamente tive que aprender javascript para facilitar minha vida. Pois chega uma hora que o excel já não está dando mais conta dos processos do dia a dia. Acho que todo mundo deveria aprender a programar, até para solicitar uma aplicação nova com o TI fica muito mais fácil."},{"author":"Hilton Mendes","comment":"Eu também fui da área da administração e acontecia a mesma coisa comigo. No final acabei vindo para o desenvolvimento de software. Acho que é bem possível e interessante conciliar as duas coisas"},{"author":"Olavo de Carvalho","comment":"Olá Hilton acho que vale muito a pena pq você têm a visão de empreendedor e a visão de desenvolvimento. Consegue achar várias soluções."},{"author":"Elton Silva","comment":"Não conhecia o hipsters.tech e gostei muito do que ouvi. Podcast´s como este nos ajudam a colocar a bola no chão e levantar a cabeça antes de dar o próximo passo. Obrigado!"},{"author":"Diego Brocanelli","comment":"Excelente episódio, que conteúdo fantástico.Tenho visto já há algum tempo há \"comunidade\" expressando desprezo por cursar uma faculdade e neste episódio deixa claro a importância dos estudos para a carreira, muitos confundem o papel da faculdade com um curso técnico ou cursos \"hands on\", onde trará resultados práticos mais rápido, porem os conceitos aprendidos na faculdade são fundamentais, temos a vertente também que muitos que entram na universidade tem lá seus 18 ou 20 anos e com isso pouca bagagem para convívio com pessoas e a faculdade bem o mau também agrega valor e experiência nesse quesito, infelizmente a impressão que fico da comunidade que menospreza a faculdade é por terem preguiça e/ou falta de comprometimento para ingressar e cursar o nível superior.Parabéns a todos os envolvidos no episódio :)"},{"author":"Estevam de Moraes Rodrigues","comment":"Guilherme seu artigo é muito bom também, está me ajudando muito!Abraços"},{"author":"Estevam de Moraes Rodrigues","comment":"Muito bom!! O Akita é foda, inspira aprender a aprender! E Guilherme muito bom seu artigo está me ajudando demais!!Abraços"},{"author":"wagner_JR","comment":"Como sempre mais um belo podcast. Fiquei com um pouco de medo quando o amigo falou que não é muito interessante estudar javascript com NodeJs, pessoalmente resolvi entrar justamente para aprender o javascript consequentemente estou usando ele no front end também. (Estou na minha ultima matéria de programação da minha faculdade)."},{"author":"Sérgio Lopes","comment":"\"Se conselho de podcast fosse bom, não era de graça.\" hahahaLembra de relevar tudo que comentamos e adaptar pra sua propria realidade. Eu acho mais arriscado apostar em Node como 1a linguagem/plataforma pra quem ta comecando e precisando se alocar rapido no mercado. Mas nao quer dizer que é impossivel nem que vc faça errado. Pese aí todas essas opiniões e, o caminho que escolher, siga em frente com bastante dedicação!"},{"author":"Philipe Cortez","comment":"ótimo podcast pessoal, vcs vieram preencher a lacuna do grok no meu coração =)"},{"author":"Vagnerlandio Nunes","comment":"Saudades do grok até um tempo atrás eu esperava eles lançarem novos episódios. Mas aí fui em buscar de novos podcasts e das dezenas que escutei apenas um ou dois me deixava satisfeito. Foi então que eu conheci o Hipster.tech, ainda no segundo episódio deles você já via eles como uma referência de qualidade, ganhou mais um fã. 😁"},{"author":"Milton Jacomini Neto","comment":"Muito show galera, isso vale não só para os novos na área, trabalho já a um tempo com desenvolvimento e há momentos que não sabemos mais que rumo tomar, a voz dos mais experientes sempre ajuda com aquela luz para clarear novos caminhos...vocês estão de parabéns pelos podcasts!! sempre muito top!"},{"author":"Raul Pereira","comment":"+1 ótimo podcast, além da ótima surpresa noi lançamento do site de vagas, belo tiro em não apostar em aplicativos e sim num site responsivo para mobile. Sugestão para melhorias: Apostaria num cadastro para candidatos a vagas e suporte para cadastrar notificação de buscas filtradas, tudo usando WPA, nada de novo aplicativo para instalar por favor... :)Abraço."},{"author":"Rodrigo Caneppele","comment":"Oi Raul, obrigado pelo comentário.Nesse primeiro momento teremos apenas o cadastro de empresa e vagas, mas é bem provável que futuramente teremos também o cadastro de currículos dos profissionais.Hoje é possível se cadastrar para receber alerta de vagas, mas o alerta é apenas por email.Abraços!"},{"author":"Raul Pereira","comment":"Show! Confesso que não percebi essa opção via celular, vou procurar navegando via desktop... ;)"},{"author":"Thadeu Cotts","comment":"Pessoal, compartilho de boa parte do pensamento do Bruno Menezes ... No meu caso eu já atuo na área de TI porém trabalho há mais de 10 anos na área de Infraestrutura mas desde quando comecei a aprender mais sobre desenvolvimento, optei por começar a adquirir conhecimento nesta área e em breve procurar estágios em dev. Antigamente havia feito uma faculdade de SI porém tranquei depois do sexto período e estou retornando para a faculdade em um Tecnólogo de Análise e Desenvolvimento de Sistemas para poder entrar nesse ramo de atuação à princípio com um estágio.Quero atrelar o conhecimento que comecei no Alura com um diploma para poder realizar este projeto pessoal, porém tenho o mesmo receio pois atualmente com 32 anos, fico imaginando como a idade pode acabar sendo um ponto contra e também um bom tema para ser abordado."},{"author":"Bruno Menezes","comment":"Olá pessoal do Hipsters, sempre acompanho os podcasts de vocês e esse especialmente me fez querer comentar aqui. Apesar da minha idade (33), estou começando agora na área de Tecnologia (segundo ano de SI). Quando eu decidir mudar minha carreira anterior (professor de Física), eu optei por fazer uma faculdade. Tentei estudar por conta própria, mas ter o compromisso de ir para a aula todo dia e sempre ser cobrado, me fez com que eu assumisse melhor o compromisso de aprender e estudar.O preconceito com quem é mais velho realmente existe nessa área. Ano passado, comecei procurar estágios e, praticamente, em todos que procurei, eu já era eliminado logo de cara por causa da minha idade.Se vocês permitem, gostaria de sugerir uma pauta para o programa: \"pessoas mais velhas entrando no mercado de tecnologia.\" (Acho que daria uma boa discussão, quais são as dificuldades e os \"pré-conceitos\" que existem.)É isso, continuem com o ótimo trabalho!"},{"author":"DuShin","comment":"Bruno, mudei de carreira também e comecei em análise de sistemas com 27 anos em 2011 e meu primeiro estágio em dev com 30. Hoje estou colocado como frontend dev. Persista sempre. Forte abraço."},{"author":"Thiago +","comment":"Idem aqui, mudei de área com 28 anos, novas perspectivas e desafios. 👏"},{"author":"Sérgio Lopes","comment":"Ótima sugestão Bruno. E quase caindo no chavão de \"persista que tudo vai dar certo\", te digo que aqui na Caelum e na Alura já tive *muitos* alunos mais velhos (bem mais que voce inclusive). Por experiencia de ver esse pessoal, digo que a area de tecnologia, apesar dos problemas que vc citou, é ainda uma dar mais abertas pra esse tipo de guinada. Um ultimo aluno que conversou comigo semana passada ainda: tem 52 anos hoje, 6 cursos na Caelum e dezenas na Alura. Era administrador e eu dei o primeiro curso pra ele e lembro da imensa dificuldade dele e de eu mesmo ter (erradamente) pensado que ele nao chegaria longe. Hoje faz freelas na cidade dele, continua evoluindo um monte e conseguiu mudar a vida dele. Mega exemplo de vida pra mim, como varios outros alunos que conheci dando guinadas parecidas"},{"author":"Mário Augusto Requejo Júnior","comment":"Por falar em freelas, vai ter um podcast a respeito?"},{"author":"Bruno Menezes","comment":"Sim, apesar dos problemas que eu citei, eu sei que é uma das melhores áreas para fazer essa mudança de carreira.Bom saber que ainda tenho futuro na área e, com isso, continuar meus estudos com mais afinco.Obrigado pelo incentivo!"}]}