{"title":"Startups, Marketplaces e Desapego – Hipsters #30","releaseDate":"07/02/2017","tags":["Podcast","startup"],"people":["Paulo Silveira","Bernardo Carneiro","Guilherme Cirne","Eduardo Ferreira"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=718%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D718&t_u=https%3A%2F%2Fhipsters.tech%2Fstartups-marketplaces-e-desapego%2F&t_e=Startups%2C%20Marketplaces%20e%20Desapego%20%E2%80%93%20Hipsters%20%2330&t_d=Startups%2C%20Marketplaces%20e%20Desapego%20-%20Hipsters%20%2330%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Startups%2C%20Marketplaces%20e%20Desapego%20%E2%80%93%20Hipsters%20%2330&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Carlos Carvalho","comment":"Sensacional como sempre!Ps: aos 12:49 ouvi o barulhino da notificação fiquei pirado procurando no meu pc... hahaha."},{"author":"JoaoRicardo_RM","comment":"Olá, tive o prazer de conhecer o pessoal dá OLX la na Campus Party, se não estou enganado falei com o Eduardo na bancada deles. Todo mundo super gente boa e deu pra notar que tem um setor de tecnologia bem legal :)Queria ver o pessoal do hipsters, mas ou não foram ou eu saí no dia :/Abraços"},{"author":"Mateus Queiroz Correia","comment":"Uma pergunta: qual a lei que vocês disseram que a arquitetura do software irá refletir na arquitetura da organização? \"??? law\"..."},{"author":"Paulo Silveira","comment":"Conways law! https://en.wikipedia.org/wi...  Adicionei no post"},{"author":"Luiz França Dos Santos","comment":"Uma pergunta pro Pessoal da OXL: Como eles veem a ideia de usar Progressive Web App em relação aos app nativos? Eles pensam em usar Progressive Web App em algum ponto no futuro? Será PWA pode ser um tendência no Brasil?"},{"author":"Guilherme Cirne","comment":"Opa Luiz!Até o momento não entramos nessa discussão sobre usar ou não Progressive Web App. Hj temos apps nativos para Android e iOS além de 2 versões do nosso site: uma tradicional e uma mobile. Um próximo passo que pretendemos dar é unificar as 2 versões do site numa única versão Responsive."},{"author":"Luiz França Dos Santos","comment":"Entendi Guilherme, obrigado pela reposta! Em relação as APP nativas, algum motivo específico para não usar algo tipo Ionic ao invés de manter as duas apps?"},{"author":"peleteiro","comment":"Muito bom!"},{"author":"Olavo de Carvalho","comment":"Muito bom o podcast , não sou desenvolvedor mas gosto de ficar por dentro do assunto. A minha vizinha mora em NY e lá existe uma stratup parecido com a OLX só que assim têm uma opção que você paga 100 doláres por ano.Após esse valor pago você ganha algumas caixas para você colocar o que está atrapalhando dentro de sua casa.Depois disso a startup leva embora e tira foto e posta na plaitaforma, aonde voce consegue verificar o que têm guardado seu.O lance legal é que se você não quiser mais aquele item, você pode colocar pra vender automaticamente dentro da plataforma. Você têm a opção também de solicitar aquele produto, dai eles entregam na casa em 3 horas.Acho muito fera."},{"author":"Rafael Cunha","comment":"Podcast show demais sobre como a OLX está mudando seus sistemas monolíticos em microserviços, suas squads e OKRs."},{"author":"Mauricio Mutte","comment":"Excelentíssimo episódio como sempre, é muito interessante saber o que há por trás dessas grandes startups"},{"author":"Guilherme","comment":"Terça feira, isso que eu chamo de pontualidade..."}]}