{"title":"Mulheres na Tecnologia – Hipsters #34","releaseDate":"07/03/2017","tags":["business","carreira","Podcast","programação"],"people":["Carla de Bona","Paulo Silveira","Iana Chan","Mariel Reyes","Carine Roos","Vanessa Tonini"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=778%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D778&t_u=https%3A%2F%2Fhipsters.tech%2Fmulheres-na-tecnologia-hipsters-34%2F&t_e=Mulheres%20na%20Tecnologia%20%E2%80%93%20Hipsters%20%2334&t_d=Mulheres%20na%20Tecnologia%20-%20Hipsters%20%2334%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Mulheres%20na%20Tecnologia%20%E2%80%93%20Hipsters%20%2334&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Kamilah Santos","comment":"já gosto de podcasts...falando sobre mulhares na ti então <3"},{"author":"Edson Carli","comment":"Para as mulheres que tem medo de errar em programação. Eu criei uma pergunta uma vez que sempre repito quando percebo que alguém ficou desajeitado com errar, é \"Sabe a frase mais falada entre os desenvolvedores?\" - Então respondo : -  \"Agora vai\" , ai questiono \"Sabe a frase menos falada entre os desenvolvedores?\" - Então eu mesmo respondo :- \"Agora foi\" . Pois precisa de mil erros pra acertar uma vez. Errar faz parte do processo, não só do processo de aprendizado mas também do acerto :)"},{"author":"Edson Carli","comment":"Excelente episódio, espalhei =)"},{"author":"Luana Sousa","comment":"o link Artigo “Quando os computadores largam as mulheres“ está quebrado :/"},{"author":"Melissa \"Galgameth\" Correa","comment":"Adorei o material disponibilizado. Aliás, seria uma boa fazer uma área pra fazer atualizações de materiais. Vez ou outra podem ver algo que teria sido interessante mostrar ou alguma atualização sobre um podcast. Eu gostaria de acompanhar. Isso vale para os outros temas também. Novas matérias, livros e etc."},{"author":"Arkhanjo Adriell","comment":"Que podcast Incrível, é por causa de podcasts assim que amo essa forma de  mídia"},{"author":"Gabi Vilamar","comment":"Obrigada meninos!!! Ouvir sobre a necessidade de mais mulheres em TI e que existem projetos sobre nos apraz a alma assim como nos dá esperança!  As vzs na faculdade, em algumas aulas me vejo sozinha no meio de um monte de homens e acaba rolando uma bad de estar errada ali quando na verdade isto deve servir de estímulo para chamar mais mulheres para a área.  É um caminho longo e difícil,  as questões não são mesmo de falta de capacidade como bem foi falado mas, de problemas sociais históricos e que só com muita luta poderemos vencer.Um super abraço!!! "},{"author":"Sebastião Relson Reis da Luz","comment":"Em 2011 (putz tem mais de 5 anos) gravamos com o /mnt também sobre o assunto, dividimos em 2 partes parte 1 https://goo.gl/2erlu0 e a parte 2 https://goo.gl/1dtdV1 o conteúdo é bom, se tirar a parte dos hosts falam o conteúdo é bacana reforço :D"},{"author":"Jéssica Zuchi","comment":"Estou na luta, e adivinha? Unica mulher da turma!"},{"author":"Aline Pacheco De Oliveira Lima","comment":"Amei o pod e ele me deu um incentivo pra tentar me aventurar nessa área da tecnologia! Sou da área das biológicas mas estou procurando agora na pós graduação como conciliar os dois mundos, mais especifiamente na bioinformatica. Sempre fiquei receosa de como seria essa transição bio>exatas, mas como sempre tive um certo interesse acabo acompanhando paralelamente algumas coisas (oq eu consigo), como o projeto do pylades e programaria... Agora devo confessar q o podcast me deu o empurraozinho final que faltava pra q eu pudesse me jogar de cabeça mesmo! Ja estou procurando cursos online e vou passar a me dedicar um tempinho a desbravar essa nova area de conhecimento, agora, com mto chão pela frente ai...Obrigada meninas, o pod foi sensacional, o time estava completissimo e vcs foram inspiradoras!! Abraços a todas! <3"},{"author":"Marco A. S. Reis","comment":"Essa discussão é muito válida e, apesar de todos esses problemas, fico feliz de saber que estamos avançando rumo ao equilíbrio. Apesar de alguns ainda pensarem que há diferenças entre os sexos, claramente estamos andando para frente. Mesmo que mais devagar do que queremos.Não faz mesmo sentido salários diferentes para homens e mulheres, muito menos essa questão da gravidez, não podemos mais aceitar isso. Tenho uma filha e espero que quando adulta ela viva em um mundo sem essas diferenças e, se possível, que ela sequer saiba que isso aconteceu um dia."},{"author":"Lucivânia Ester da Costa","comment":"Me formei em computação no final do ano passado, e de 8 pessoas que formaram, 5 eram mulheres. :)"},{"author":"Weverton Timoteo","comment":"Dá para incluir o RailsGirls (http://railsgirls.com/) também na lista :)"},{"author":"Dayana Mi Suzuki","comment":"Recomendo fortemente o documentário \"Mulheres HTML\" do GNT.Infelizmente, é de um canal pago. Mas quem puder veja."},{"author":"Ana Beatriz Cruz","comment":"Adorei o podcast! Só discordo em um ponto: foi dito que as mulheres recebem menos que os homens porque não entram nas áreas em que eles estão. Eu discordo fortemente disso. Uma mulher com a mesma formação e que atue na mesma área que um homem pode receber menos no mesmo cargo. Além disso, normalmente homens recebem mais promoções que as mulheres. Precisamos trazer mulheres para área de computação, mas isso não resolveria o problema da desigualdade salarial."},{"author":"Hermes Passer","comment":"Creio que tivemos a mesma professora na etec. Ela ainda está na ativa."},{"author":"Paulo Silveira","comment":"Ela esta sim Hermes! Eu tive aula com a professora Emilia quando ela ainda dava aulas na extinta Delta Informatica, com um Apple II :), hoje uma reliquia"},{"author":"Abner","comment":"Sugestão: adicionar um \"Click to enlarge\" na imagem no post do podcast. A imagem do post foi reescalada e está ilegível."},{"author":"Carlos Eduardo","comment":"Muito bom o PodCast Parabéns mulheres pelas palavras e pelos exemplos!"},{"author":"Augusto Santos","comment":"Foi um bom poadcast. Entendo todo o contexto apresentado e reconheço que no inicio da \"era do desenvolvimento\" o preconceito com mulheres nesta área era imenso (que na verdade me parece ter sido herdado da área de engenharia elétrica, eletrônica, matemática, etc). E esse preconceito persistiu por algumas gerações. Hoje isso diminuiu bastante e muitos homens inclusive criam ou participam de programas para aumentar a participação de mulheres na área de TI. Eu mesmo recomendei algumas mulheres para o processo seletivo (para estágio) na empresa onde trabalho . Infelizmente poucas mulheres chegam a participar até poucas mulheres cursam algo relacionado a área de TI. O que é necessário dizer é que mesmo com a diminuição desse preconceito muitas mulheres ainda evitam ingressar na área. Neste posto vejo um pouco de culpa também das mulheres. Claro os motivos pra isso podem ser muitos mas algumas mulheres olham para a área com certo preconceito acreditando que a área de TI é pra pessoas que não tem amigos, que são reclusas, que se trancam numa sala e ficam olhando para o PC o dia todo. Nisso preferem seguir pra medicina, direito ou outras áreas. O engraçado é que nessas outras áreas preconceitos e barreiras contra elas também existem porém parecem ser mais \"superáveis\".Então é bom deixar claro que o próprio preconceito contra a área vindo da parte da mulher também deve ser combatido. E ai programas como o Pyladies são essenciais para mostrar o valor da área.Então o que deve ser combatido é o preconceito vindo de fora e o vindo da própria mulher.Embora não seja adepto de tantas divisões sociais como \"o grupo das mulheres brancas\", \"das mulheres negras\", \"das mulheres trans\", \"dos homens negros\", \"dos homens negros homo\" e vários outros que acabam apenas dividindo as pessoas e colocando um grupo como o causador dos males do outro concordo com grande parte dos pontos apresentados aqui. Parabéns a todos pelo poadcast."},{"author":"Ana Eliza B. Freitas","comment":"Concordo que tenha uma parte que venha das próprias mulheres, e acho mto bacana da parte dos homens, que seja incentivadores da igualdade e por vezes são os que vão abrir a mente das próprias mulheres...Espero mesmo que o preconceito diminua, pois as mulheres precisam acreditar que tem mto a acrescentar na área e que são competentes tanto quanto os homens...Mto obrigada pela sua opinião a favor do movimento, precisamos de pessoas assim!!!"},{"author":"Gabriel Darezzo","comment":"Bacana o Podcast,Tem uma iniciativa da WebSchools legal focada em ensinar Js para a mulherada...http://webschool.io/js4girls/"},{"author":"Marcos","comment":"Coincidência ou não, a pessoa em que eu me inspiro para programar também é uma mulher. É uma pena que existem pessoas com a capacidade de pensar tão limitada a ponto de excluir os outros de ter oportunidades iguais."},{"author":"Renato Dinhani","comment":"Interessante, mas mais interessante ainda seria trazer mulheres para participar com mais frequência do podcast para falar dos assuntos corriqueiros da área de tecnologia.Dos 34 episódios, só vi que houve participação feminina nos episódios #34, #32, #23, #14 e #8."},{"author":"Hugo","comment":"Entrei para fazer o mesmo comentário, obrigado por ter se adiantado Renato =).Uma vez ouvindo uma entrevista da Trisha Gee, conhecida evangelista da Jetbrains, ela comentou que o problema começava quando ela só era chamada quando o tópico era \"Mulheres em tech\" e que o que ela realmente queria era ser chamada para qualquer tópico, sobre o que conhecimento que ela acrescentava.De toda forma, excelente episódio e que continue o excelente trabalho pessoal."},{"author":"Paulo Silveira","comment":"exato, tava na pauta quando eu fiz o mea culpa da empresa tambem citar que tinhamos poquissimos episodios com mulheres mas ficou de fora (tem mais alguns com mulheres, como o #5 e outros, mas mesmo assim pouquissimos)"},{"author":"temonteiro","comment":"Olá, me chamo Thalita Monteiro sou desenvolvedora e tenho um site de empregos na área de TI chamado QueroWorkar(http://queroworkar.com.br/b....Eu fiquei muito intrigada quando vocês questionaram porque a mulheres largam a carreira e quando eu penso nisso só me vem a cabeça: MATERNIDADE.Muitas mulheres quando chegam nessa etapa da vida, na grande maioria das vezes, ficam balançadas em deixar os seus filhos para ficar fazendo hora extra  porque o projeto não foi planejado da maneira correta e a equipe é obrigada a trabalhar de domingo a domingo por meses pra cumprir o prazo do projeto. Eu mesma já me peguei pensando em quando eu tiver filhos como será pra mim conciliar esses prazos loucos do mercado de TI e ter um convívio saudável com a minha cria.O mesmo questionamento vale quando pensamos porque temos poucas mulheres participando de eventos de TI? A maioria dos eventos são nos finais de semana ou a noite e muitas passam a semana longe dos filhos, muitas mulheres não podem deixar os filhos com os pais, porque muitos ainda acham que isso é coisa de mulher. Enfim, já me peguei pensando muito nisso, mas ainda não cheguei em uma conclusão para ajudar a resolver esse problema.Deixa eu terminar de ouvir que eu parei no meio só pra comentar :D"},{"author":"Jucy Cabrera","comment":"ThalitaEu sou dev e sou mãe. Meu filhinho tem 5 anos e graças a Deus trabalho em uma empresa com horário flexivel e faço home office 2 vezes por semana. Isso me possibilita participar de reuniões na escola, passar mais tempo com meu filho, levá-lo às consultas. Houve um tempo que não pude fazer essas coisas simples pela falta de flexibilidade. E claro conto muito com o meu marido e minhã mãe. Então ter uma boa estrutura de apoio e atuar numa empresa com flexibilidade de horários me ajuda a não faltar como mãe."},{"author":"Carlos Carvalho","comment":"Queroworkar <3 xodó dos \"fortalezences\" de TI"},{"author":"temonteiro","comment":"<3"},{"author":"Kete Martins Rufino","comment":"Thalita, eu ligaria isso ao fato, também colocado no podcast, sobre a cobrança exagerada que fazemos a nós mesmas (me identifiquei muito com esse ponto e to chocada). As mulheres que escolheram trabalhar depois de terem filhos, se cobram muito pela falta de atenção que eles recebem durante a semana. Ja ouvi de algumas amigas \"ah, não posso gastar 30min depois do trabalho com uma corridinha (mesmo insatisfeita com o corpo ou com a saúde), pq só penso em chegar em casa e dar atenção ao meu filho\", imagine aí passando um fim de semana inteiro em um evento de TI? Ver um homem indo jogar futebol com os amigos toda semana sem toda essa cobrança, é mais comum."},{"author":"Paulo Silveira","comment":"Oi Thalita! Poxa, que legal seus pontos e observações! realmente essa é uma das barreiras (e ela aparece sim mais pro fim do podcast :))"},{"author":"Welton Vaz de Souza","comment":"Parabéns por mais excelente Podcast, eu pessoalmente conhecia pouco do Universo Feminino na Computação, olha que trabalho com programação desde 1987. Eu conhecia a Ada Lovelace por causa do nerdcast 211, agora conheço o filme Hidden Figures('Estrelas Além do Tempo' ) e muito outras joias da computação, meu abraço e meu respeito a todas elas!"},{"author":"Pedro Souza","comment":"Muito o bom o episódio, um dos melhores até o momento.Inclusive, estou fazendo um curso na Unicamp e na minha sala deve ter 7 meninas, de um total de 50 alunos. Negros tem apenas dois, que são homens. É preciso discutir sim, temos que saber o porquê de haver poucas mulheres, poucos negros, na área de TI."},{"author":"Camilla Camilla","comment":"É inspirador ouvir tantas histórias bacanas! Aquele relato sobre a entrevista é perfeito. Não houve uma entrevista que eu tenha participado sem que o RH (sendo o entrevistador homem ou mulher) não tenha me perguntado se eu tinha filhos ou se estava planejando em ter. E isso é uma invasão. Fiz muitos cursos de programação online, semana passada iniciei meu primeiro curso presencial na Caelum. Era uma turma de 10, eu era a única mulher, todos me trataram muito bem! Quando a aula terminou, os alunos das outras turmas ficaram me olhando com surpresa, foi engraçado. É preciso ter maturidade para conquistar espaço, pois o problema é cultural e nós mesmas nos tolimos muitas vezes."},{"author":"Paulo Silveira","comment":"oi Camilla! Legal seu depoimento e fico feliz que tenha sido bem tratada na Caelum, não esperava menos do que isso por aqui :)"},{"author":"Camila Costa","comment":"No meu caso fui parar na área de informática meio que sem querer. Entrei para um curso de informática sem saber nem da existência da programação e quando conheci simplesmente me encantei. Durante o curso só estudei com outras meninas no primeiro período, nos demais sempre eu era a única e sinceramente isso nunca me fez desanimar ou me questionar se estava no ambiente certo. Vale ressaltar que os homens que estudaram comigo e professores sempre me respeitaram e não me trataram diferente por causa do meu sexo, e isso realmente faz muita diferença. Concluí o curso, consegui um emprego (inclusive onde trabalho tem outra mulher de ti), e logo em seguida já comecei a faculdade na área. Na faculdade onde estudo, em todo o curso de Sistemas de Informação tem menos de 10 mulheres. Confesso que não converso muito com todas elas mas o que percebo é que boa parte delas não gostam da faculdade não pelo ambiente, mas por não se identificar com o área e ainda tem outras que estão lá só por achar legal está no meio de homens. Acho interessante esses programas de incentivo para que mulheres entrem na área, mas sinceramente acho que para trabalhar na área tem que gostar e levar \"jeito\", independentemente de ser homem ou mulher."},{"author":"Inaldo Brandão","comment":"Muito boa a discursão, parabéns a Alura, mais uma vez com um tema pertinente e necessário. Na minha época de faculdade tentei por vezes priorizar nomes e temas que ligassem a mulheres nos trabalhos mais teóricos e etc. É um assunto extremamente necessário, principalmente para ser trabalhado nas faculdades, etc. Fui de uma turma que formou 3 mulheres, e que por vezes fizemos um trabalho para motivá-las a continuar e concluir o curso."},{"author":"Fernando Gonçalves","comment":"Gostei bastante do Podcast. Juro que meu sonho e trabalhar com uma programadora(s), mulheres são mais pacientes para encontrar problemas (eu imagino). Já tentei de tudo para minha esposa aprender a programar, mesmo que fosse para passar o tempo, sempre usa as desculpas de que isso não foi feito para ela. No demais, ótimo episodio, e parabéns para as mulheres que não desistem, vocês são um exemplo."},{"author":"Ana Eliza B. Freitas","comment":"Meu marido (na época namorado) quemme ensinou a programar, agora tá eu aí, na area... kkkkk"},{"author":"Fernando Gonçalves","comment":"kkkkk que legal. Já tentei ensinar para ela. Quem sabe um dia, ou para meus filhos. kkkkk"},{"author":"Ana Eliza B. Freitas","comment":"Bota ela para ouvir o PodProgramar, quem sabe ela se anima?"},{"author":"Fernando Gonçalves","comment":"Que legal, valeu. Vou indicar."},{"author":"Fernando Boaglio","comment":"Gostei do assunto abordado, mas gostaria de ver um podcast sobre os bastidores desses projetos sociais de programação, acho muito interessante. Lembro que na faculdade tinham algumas mulheres do departamento de matemática, mas de computação só tinha uma e era uma das poucas que sabia realmente ensinar."},{"author":"Paullo Norato","comment":"Eu tbm tenho mt vontade de contribuir nesses projetos Girls on tech <3"},{"author":"Ana Eliza B. Freitas","comment":"Paulo Silveira olha pauta aí para mim e para vc! Rsssss"},{"author":"Rafael","comment":"Muito fraco. Sou mulher \"empoderada\", mas se não tiver filme ou propaganda eu não sigo a carreira. Pega lá e resolve um bug(projetos opensource) foda e pega sua fatia do mercado."},{"author":"Pedro Souza","comment":"Apaga que dá tempo!"},{"author":"Rafael","comment":":("},{"author":"Alda Rocha - mjcoffeeholick","comment":"A gente ta tentando resolver um bug, um bug enorme que são pessoas como vc. É por conta de pessoas tipo vc, com esse pensamento raso sobre as coisas e resumem de uma forma tão boba, beirando a infantilidade, que temos tanta dificuldade de fazer essa roda girar, mas relaxa que vai dar certo pra gente, vamos ser a maioria um dia e parar de \"reclamar\" ;)"},{"author":"Camilla Camilla","comment":"Muito fraco e muito triste mesmo é ler este tipo de coisa.Por favor, diz pra mim que é só uma zoeira sem noção, vai, diz."},{"author":"Ana Eliza B. Freitas","comment":"Fraco? É sua opinião, mas na minha, eu tô tendo que quebrar mtas barreiras para conseguir um espacinho de luz ao sol, eqto para os homens isso é super tranquilo... Te faço uma pergunta, vc tiraria uma duvida com um homem ou uma mulher, sendo q teria ambos sabendo as mesmas coisas?As oportunidades a gnt tem q cavar na unha, machucando, sangrando e seguindo... Tomara que vc tenha mais empatia e nos ajude a termos mais espaço e talvez um pouco mais de respeito no mercado."},{"author":"Rafael","comment":"Moça sou um merda na área, sou a última pessoa que vc pediria ajuda(nem por isso choro na internet). Vai no StackOverflow e se tiver dúvida crie um nickname genérico sem foto e tenha seus problemas resolvidos."},{"author":"Eduardo Medeiros Branquinho","comment":"Você não concorda que só o fato de ter que criar um nickname genérico já é um problema? Porque eu, como homem, nunca passei por uma situação aonde teria que criar um nickname genérico, o que já não é verdade pra algumas meninas.Cara, imagina isso como uma corrida de obstaculos que nós vemos nas olimpiadas. Imagina que pra um homem, tem 2 obstaculos. Pra uma menina, tem 6. Ai chega no final da corrida 4 homens e uma mulher, e vc fala \"po meninas, tem que se esforçar mais hein, só tem uma aqui enquanto tem 4 caras. Porque vocês não se esforçam mais e chegam aqui por merecimento proprio, sem eu ter que ir lá tirar 4 obstáculos da pista de vocês?\"."},{"author":"Rafael","comment":"Cara, isso tá ficando cada vez mais psicodélico. Vc conhece uma Mariana Macedo Branquinho de BH?"},{"author":"Ana Eliza B. Freitas","comment":"E se não tiver disponível o Stackoverflow? Estou tratando uma hipótese com vc, caso não tenha entendido... Por isso q estou te pedindo para ter empatia, entender o nosso lado, para a gnt continuar a entender o seu! ;) Bjos!"},{"author":"Rafael","comment":"Se o stackoverflow não resolver o seu problema quem dirá eu. Em um caso hipotético em que sou a única saída, terei o maior prazer.Eu tenho empatia, só acho que é o caminho errado o jeito que estão fazendo."},{"author":"Ana Eliza B. Freitas","comment":"Putz... Vc não tá entendo o q estou querendo dizer... Esquece... Fica o dito pelo não dito e siga com esta opinião... \"vc vai longe\"..."},{"author":"Tomas Vasquez","comment":"Isso depois de passar por um bilhao de barreiras discutidas no episodio, que acredito nao ter escutado apropriadamente."},{"author":"Ana Eliza B. Freitas","comment":"Né?! Com certeza está faltando empatia, mas mto obg por estar junto!"},{"author":"Paulo Silveira","comment":"É uma opinião que nós discordamos :)."},{"author":"Rafael","comment":"Já ouvi no nerdcast que vc lutou contra o status quo para criar a Alura. O mundo é feito de quem entrega valor."},{"author":"Alda Rocha - mjcoffeeholick","comment":"O mundo é feito de pessoas que respeitam as outras!"},{"author":"Rafael","comment":"Em qual ponto desrespeitei?"},{"author":"Alda Rocha - mjcoffeeholick","comment":"Neste aqui: \"Muito fraco. Sou mulher \"empoderada\", mas se não tiver filme ou propaganda eu não sigo a carreira. Pega lá e resolve um bug(projetos opensource) foda e pega sua fatia do mercado.\" neste ponto vc desrespeitou todas essas mulheres que falaram no podcast. Eu acompanho faz uns anos a trajetória delas e elas lutam MUITO, fazem tudo ai que vc deu como sugestão e fazem MUITO mais e mais que muita gente de TI junta. Então quando vc resume a conversa delas a um simples \"pega tua fatia do mercado\" e \"O mundo é feito de quem entrega valor\", vc ta faltando com respeito pelo trabalho dessas mulheres e de muitas outras que ao contrário do que vc ta tentando, não estão falando sobre esse assunto pq ta na moda e sim pq é necessário e ENTREGA VALOR pra muita gente. Sugiro que vc de uma lida mais profundamente na participação dessas mulheres dentro da comunidade, dentro do opensource, capaz de vc até achar elas ensinando pra muita gente e inclusive fazendo post de tutoriais no Stackoverflow."},{"author":"Camila Futamata","comment":"\"Pega lá e resolve um bug(projetos opensource) foda e pega sua fatia do mercado.\" Is the new \"Quero ver carregar um saco de cimento\""},{"author":"Rafael","comment":"Eu como ouvinte achei fraco o argumento.Na minha opinião elas deveriam focar mais na ação, no que na vitimização. Uma se autodeclarou Forest Gump.Uma parte boa foi o peso do erro para a mulher. Isso é um dado qualitativo que nunca ouvi falar e que pode ser trabalhado.Agora faltou um quantitativo do motivo de largar a área ou pq não mudar o curso de engenharia/matématica/etc para computação. Colocar culpa no pai, na propaganda(de empresas americanas, se no Brasil nem passou essas propagandas), CEO, etc é jogar no outro a responsabilidade pelo seus próprios atos.O fato de achar falta de respeito(da minha parte) por não gostar deste episódio e não gostar dos argumentos, ratifica minha opinião."},{"author":"Pedro Souza","comment":"Cara, basta você se perguntar: Quantas mulheres existem no ambiente em que eu trabalho/estudo? Por que isso acontece?Ninguém está colocando a culpa no pai, na propaganda, estão colocando a culpa na nossa CULTURA, nossa cultura é machista, principalmente na área de TI, as oportunidades e condições não são as mesma entre homens e mulheres. Mas com certeza as coisas estão mudando e as mulheres estão cada vez ganhando mais espaço."},{"author":"Ana Eliza B. Freitas","comment":"Que bacana o episódio, e como foi rico conversar com mulheres, e tomara que incentive ainda mais as mulheres, e muito obrigada por indicar nosso podcast: https://mundopodcast.com.br...Parabéns pelo episódio!"},{"author":"Paulo Silveira","comment":"Ana! Deixei o link agora direto no post!"},{"author":"Ana Eliza B. Freitas","comment":"Muitíssimo obrigada Paulo!!!!"},{"author":"João Antônio","comment":"Infelizmente ainda temos esse tipo de discussão sobre a capacidade das mulheres. Cara, minhas professoras na faculdade foram excelentes, minhas colegas de trabalho são super capacitadas e não ficam atrás de ninguém, mas realmente, ainda há muita resistência principalmente do pessoal das \"antigas\". Ótimo podcast, curtir bastante!"},{"author":"Ana Eliza B. Freitas","comment":"Sim João... Ainda temos que ter um dia especial, para sermos lembradas, temos q ter episódios especiais para lembrar das nossas capacidades, e mto obrigada por fazer parte das pessoas que percebe a igualdade!"},{"author":"Matheus Montenegro","comment":"Nossa! Quanta coisa bacana discutida viu?! Eu mesmo tenho referências mulheres na área de tecnologia que me deram apoio e foram minhas facilitadoras. Agora, só um ponto: acho q o pessoal da Alura poderia melhorar a nomenclatura dos termos. Algo q abranja tanto os homens quanto as mulheres. Termos como desenvolvedor, para desenvolvedor(a) e assim por diante. Afinal, não temos apenas homens na programação ne verdade?! Opinião minha ne?! Abraços."},{"author":"Paulo Silveira","comment":"oi Matheus, faz todo sentido. Onde a gente conseguir melhorar, desde a redação até as vagas e instrutoras, é um avanço"},{"author":"Matheus Montenegro","comment":"Exato! Parabéns pelo trabalho de vocês!"}]}