{"title":"O Reino encantado do JavaScript – Hipsters #38","releaseDate":"04/04/2017","tags":["front-end","Podcast","programação","web"],"people":["Paulo Silveira","Mauricio Balboa Linhares","Jaydson Gomes","Flávio Almeida","Sérgio Lopes"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=827%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D827&t_u=https%3A%2F%2Fhipsters.tech%2Fo-reino-encantado-do-javascript-hipsters-38%2F&t_e=O%20Reino%20encantado%20do%20JavaScript%20%E2%80%93%20Hipsters%20%2338&t_d=O%20Reino%20encantado%20do%20JavaScript%20-%20Hipsters%20%2338%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=O%20Reino%20encantado%20do%20JavaScript%20%E2%80%93%20Hipsters%20%2338&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Pedro Scursel","comment":"toda vez que o Flávio fala, me vem ele na cabeça no canto inferior esquerdo, com fundo de chromakey, que nem nas aulas da alura heheheheheh"},{"author":"Pedro Scursel","comment":"*inferior direito :s"},{"author":"Flávio Henrique Almeida","comment":"É cangaceiro pra todo lado...esquerda, direita, cima baixo...kkk"},{"author":"José Luiz","comment":"\"Mas vem cá, será que tem como melhorar nosso código?\" kkkk"},{"author":"Ronan","comment":"Olá, poderia citar alguns exemplos de situações em que equipes que trabalham com outras linguagens back-end optaram por adotar Node para determinada solução?Em outras palavras: em quais situação que uma aplicação baseada em Java, Python, PHP precisou optar por Node?"},{"author":"Maurício","comment":"É um sonho distante, mas seria maravilhoso ver um curso da Alura sobre IoT e Node.js Embedded (https://tessel.io/)"},{"author":"Rafael Antonio da Silva","comment":"Alura deixa a desejar nos cursos!!Sugeri há mais de 3 meses o curso de AWS e nunca foi feito! (sendo mais votado na pesquisa)"},{"author":"Flávio Henrique Almeida","comment":"Boa notícia!https://cursos.alura.com.br...Sucesso e bom estudo meu aluno!"},{"author":"Flávio Almeida","comment":"Olá! nesses 2 meses, estamos trabalhando no curso de AWS focado no EC2 e outro focado no S3. E estamos planejando mais."},{"author":"Rafael Antonio da Silva","comment":"Obrigado pela resposta! Sou aluno e estou super esperando conteúdos sobre AWS.Fico no aguarde destes citados e dos próximos, abraço!"},{"author":"Flávio Henrique Almeida","comment":"Saiu hojehttps://cursos.alura.com.br..."},{"author":"Clayton Passos","comment":"Fim da guerra dos browsers? Quando isso acabou que eu não to sabendo?Tenho de lidar com IE, Edge, Firefox, Chrome, Neon/Opera no desktop, sem falar que a nova versão do Chrome (56 e 57) quebrou um monte de coisas que funcionavam, pra piorar, hoje tenho que lidar com o mobile  que me impôe as mesmas variações em celulares, tablets, e smart TV, e no mobile ainda tem o navegador do Android que nem não é nenhum desses que comentei anteriormente.Tudo bem que os browsers pararam de impor seus próprios padrões, mas para mim, programador, o fato de cada um implementar a parte da especificação que desejar, me traz o mesmo problema, pois eu tenho de prever oque funciona e oque não funciona em cada um, e escolher o meu contorno pra cada situação.Não posso simplesmente programar, testar no Chorme e ter a certeza de que vai funcionar no Firefox  tanto no desktop e no Mobile, mesmo nos \"browsers modernos\".Ao meu ver a guerra dos browsers só piorou, nunca acabou.Mas tudo bem, no final tenho programado usando Java + Spring, Vue + JavaScript e Angular + TypeScript :D"},{"author":"Maurício Linhares","comment":"Esse comentário foi apagado."},{"author":"Maurício Linhares","comment":"Nope, C, C++ e Java continuam sendo mais rápidos, sendo single thread ou não. Tem várias soluções que usam event-loops nessas linguagens (e bem anteriores ao NodeJS, inclusive) como o Netty no Java."},{"author":"Zava","comment":"Tinha q dar um tapa na cara desse cara quando fala q prefere Java no back em vez de Node. (uma crianca morre na africa cada vez que vc nao usa node no back)"},{"author":"Flávio Almeida","comment":"Não era um bebê foca? Saindo do mundo da treta e vido mais para o mercado, o Java  apesar de ser uma linguagem mais verbosa que o JavaScript e outras do mercado, conseguiu consolidar plataforma. Há zilhões de empresas que investiram em treinamento e infraestrutura em Java. O Node.js hoje frequenta ambientes corporativos, mas com o advento das Web APIS (micro serviços), no final das contas o dev faz sua API com a tecnologia que for melhor para aquele problema específico. Há espaço para todos.. feliz é aquele dev que sabe transitar em cada uma das tecnologias e aplicar aquela certeira para o problema. Aliás, qualidade de um bom cangaceiro desenvolvedor.Abraço Zava!"},{"author":"Jose Paulo","comment":"Galera sou dev backend, e já tentei me aventurar no front(não deu certo rsrsrs). Qual a real relevância do nodejs, vale a pena começar um projeto com node hoje, ou uma linguagem(sei que nodejs não é uma linguagem) com mais tempo, ou mais madura, como php ou python. Valeu"},{"author":"Flávio Almeida","comment":"Tem que perguntar para a Microsoft, Paypal, Wallmart, Twitter e outras grandes empresas corporativas que usam Node.js em produção :)Sem puxar a sardinha pro lado do JavaScript, talvez seja interessante investir naquela que tem mais oferta de emprego perto de você. Há também o fator motivação. É balancear a necessidade do mercado e seu gosto. Só não esqueça que dominar JavaScript é mais de meio caminho para aprender a plataforma Node.js.Abraço João!"},{"author":"Jose Paulo","comment":"Vlw cara agradeço a ajuda e orientações"},{"author":"Vagner Araújo","comment":"JS JS JS JS"},{"author":"Samuel Rocha","comment":"Excelente cast pessoal, parabéns, pena que a treta não foi maior :)Não teria como falar sobre todo o universo Javascript em uma hora, são tantos frameworks que eu nem sei contar hehehe.Jaydson e o Felipe mandam muito bem no BrazilJs, a conferência é incrível, só estou esperando a desse ano \\0/"},{"author":"Flávio Almeida","comment":"Nem podia ter muita treta com o cangaceiro aqui! Ninguém iria me encarar :)"},{"author":"Edy Silva","comment":"Adoraria um sobe Python"},{"author":"Maurício Linhares","comment":"Tá vindo!"},{"author":"Marlon Baptista de Quadros","comment":"Ainda está vindo? Não esquece de nós! hehehehe =P"},{"author":"Maurício Linhares","comment":"hahaha, tá sim, estamos organizando a fila :D"},{"author":"Juliano Soares","comment":"pray for python"},{"author":"Jose Paulo","comment":"aguardo anciosamente"},{"author":"Edy Silva","comment":"Muito show! Estou viciado nos podcasts. E sou fã do Python estou esperando ansioso"},{"author":"Gustavo Edny","comment":"Que coisa linda! Tava já pedindo pra fazer um podcast sobre JS. Muito bom!"},{"author":"Eduardo Henrique","comment":"Poderiam ter mencionado o Electron.js que ta começando a dominar o mundo desktop também. Podcast 10/10"},{"author":"Flávio Almeida","comment":"Algum passarinho me contou que terá alguma coisa de Electron numa das melhores plataformas de ensino online. Vamos aguardar!"},{"author":"Maurício Linhares","comment":"Hahah, falta de react e react native, angular, ember, electron, tanta coisa boa :D"},{"author":"Flávio Almeida","comment":"Tem uma surpresa de Electron... vindo por ai. Não é minha, mas estou acompanhando. Aguardem!"},{"author":"Ulisses de Castro","comment":"Ontem, estava estudando sobre ele, muito interessante, fiquei mais animado porque consegui integrar um projeto angular js nele."},{"author":"Paulo Silveira","comment":"valeu Eduardo! mas varios acabaram ficando de fora mesmo :("},{"author":"Junior Osho","comment":"Tenho certeza que o titulo foi dado pelo Paulo Silveira..Adorei O Reino Encantado do Java Script, tomara que venha depois O INFERNO DO TYPESCRIPT !kkk"},{"author":"Paulo Silveira","comment":"fui eu mesmo :P"},{"author":"Junior Osho","comment":"Abraço  Paulo.."},{"author":"trumae","comment":"Nao dah pra fugir do JS no Browser. No backend eu tenho problemas com JS. Mas tambem tenho problemas com Ruby e Python :). Esse tipo de linguagem eh otimo pra prototipos e prototipos eternos. Mas se o sistema fica de porte medio, vira um inferno. A desculpa eh que se escreve muito menos do que em linguagens com tipagem mais forte como C++ ou Java, mas parecem que nao contam a montanha de codigo de testes a mais que se tem que escrever em JS ou Python. Em linguagens  menos \"dinamicas\" precisamos escrever muito menos testes.Mas sempre podemos escrever rapidamente uma goiaba sem escrever testes, neh? :)"},{"author":"Flávio Almeida","comment":"\"Em linguagens menos \"dinamicas\" precisamos escrever muito menos testes.\". Linguagens menos dinâmicas, você diz as com tipagens estática? No número de testes não tem relação com essa ou aquela linguagem, porque se você faz teste unitário, esta testando a menor unidade testável de seu sistema, se você faz teste de interação, esta testando algo maior. Aliás, pesquisa recente do Eric Eliot ao levantar projetos nas mais diversas linguagem apontou que linguagem estáticas como java e C# são as que possuem maiores issues abertas, um número menor do que projetos feitos dom JavaScript. Ou seja, a tipagem estática não protege o seu runtime, ou seja, só um teste pode demonstrar se o seu código faz corretamente o que ele deveria fazer. Então, na minha experiência e pegando carona na pesquisa do Eliot, não faz muito sentido dizer que linguagens \"menos dinâmicas\" escrevem menos testes. É treta!!!!!!!!! :)"},{"author":"trumae","comment":"Acho dificil entender algumas atitudes: na hora de automatizar tarefas no desenvolvimento, o pessoal de Ruby, Python e JS manda muito bem. Mas usar tipagem? Nao, isso eh o demonio!"},{"author":"trumae","comment":"Flavio, eu nao escrevi que TDD nao eh  necessario. Soh que parte do que se escreve em linguagens dinamicas jah eh feito pelo compilador das linguagens com tipagem forte. E isso eh pouco discutido.Procurei esse Elliot, li um artigo dela ha respeito. Li o do Uncle Bob que originou tudo. Concordo com o Uncle Bob. TDD eh necessario. E bons programadores devem usa-lo. Meu ponto eh que linguagens estaticas jah provam varios \"teoremas\" sobre seu codigo, e isso torna possivel escrever menos testes. Muitos desses teoremas sao bem mais forte que testes baseados em casos. Obvio que nao eh prova de corretude, ate pq o compilador nem saberia que teoremas provar pra isso. Alem da dificuldade de provar a grande maioria das proposicoes interessantes.O TDD inventado pelo pessoal do SmallTalk, de acordo com o Bob, e o melhor que nos temos. Donald Knuth, ao escrever o Tex, fez algo muito parecido e estava usando uma linguagem fortemente tipada."},{"author":"Flávio Almeida","comment":"Tem uma coisa que não disse, que acho que é o lado que você estava se referindo. Se programamos com uma linguagem dinâmica e queremos garantir que o tipo recebido é aquele que esperamos, temos que realizar uma série de testes (aqui sai dos testes unitários...ou escopo). Nesse caso, se o programador for por esse lado, ele escreve sim, um monte de código que não existiria se a linguagem fosse estaticamente tipada."},{"author":"Flávio Almeida","comment":"Ah, e por ser linguagens dinâmicas, você não precisa usar mocks ou outros artefatos bizarros para dar uma volta no compilador e poder testar seu código.    Sendo assim, o burdem para testar linguagem \"menos dinâmicas\" (eu entendi que você quis dizer estáticas) é bem maior."},{"author":"Flávio Almeida","comment":"\" Em linguagens menos \"dinamicas\" precisamos escrever muito menos testes.\". Se você se referiu a linguagem estaticamente tipadas, há uma surpresa aqui.Estatic typing não blinda seu runtime :) Aliás, o que acontece é o posto! Pesquisa realizada pelo titio Elliot demonstrou que projetos feitos em Java ou C# possuem muito mais issues abertas do que projetos com linguagens dinâmicas. Qual o motivo? A cobertura de testes.A cobertura de testes não muda para uma linguagem dinâmica ou uma estaticamente tipada. Teste unitário continua sendo teste unitário, teste de integração, continua sendo de integração.Sua experiência diverge da minha. Mas hipsters é treta!"},{"author":"Diogo Machado","comment":"Muito bom esse podcast! Já vou seguir os participantes no Twitter, me amarro em Javascript."},{"author":"Juscilan Moreto","comment":"Só a nata. #Js"},{"author":"Vinícius Santos Albuquerque","comment":"Muito bom o podcastSugestão: Coloquem configuração de velocidade de execução no player. Eu sempre tenho que baixar para rodar em 2x no computador."},{"author":"Sérgio Lopes","comment":"Vinicius, tem uma gambiarra que eu faço: abre o console do chrome e cola: `document.querySelector('audio').playbackRate = 2`"},{"author":"Leandro Severino","comment":"Parabéns pelo EXCELENTE podcast. Com certeza está nos favoritos do que eu já assiti.Visite também a nossas página no Facebook:- https://www.facebook.com/ma...Visite também o nosso grupo no Facebook:- https://www.facebook.com/gr...E também o nosso blog: - http://profissionaldetecnol...Ob: Este material já está publicado lá no grupo ;)"},{"author":"ricardo","comment":"Porra massa o site e o podcast, vou seguir"},{"author":"Patrícia Lima","comment":"Melhor episódio! Vocês poderiam fazer mais episódios assim, mostrando o contexto da linguagem, desde que ela foi criada até o Boom dela. Ajuda a entender algumas coisas. Parabéns pelo podcast e pelo episódio!"},{"author":"Douglas dos Santos","comment":"Concordo! Sugiro o Ruby on Rails."},{"author":"Paulo Silveira","comment":"queremos ter mais destes!!"},{"author":"Pedrinho Aoki","comment":"Gostei bastante do podcast e concordo com o Sérgio em relação ao Node.Muitos acham que é bala de prata para o back-end. Mas é necessário entender melhor os requisitos decada projeto, são diversas variáveis que podem influenciar na decisão de usar Node ou não.Faltou falar de typescript ( Em quais situacoes devo migrar meu codigo para TypeScript? Qual area que o Typescript veio atender que o JS nao atende?)"},{"author":"Maurício Linhares","comment":"PureScript é muito mais legal :D"},{"author":"Mateus Queiroz Correia","comment":"Também senti falta do Typescript, mas como a turma da Alura é tão inteligente, deve estar preparando um episódio sobre o tema, uma vez que ele é mais amplo.Quando forem falar, talvez vale a pena comentar que a própria google adotou o typescript para o Angular 2^"},{"author":"Alexandre Costa","comment":"galera tive dificuldade no node.js principalmente na organização da sua estrutura dos arquivos então pergunto o que devo saber antes de sair do javascript front para o back tipo saber mvc, O.O e etc."},{"author":"Maurício Linhares","comment":"Olha, é bom ter uma idéia de MVC mas se você pegar um framework como express ele já deve ajudar a abstrair um bocado desse entendimento inicial. Meteor.js é uma boa pra começar também."},{"author":"Flavio","comment":"Qual é o projeto do github pra acompanhar a evolução da linguagem?"},{"author":"vitornogueira","comment":"https://github.com/tc39/ecm..."},{"author":"Flavio","comment":"Obrigado! "},{"author":"Daniel, o Conte - Caps","comment":"Queria um sobre Django. Mas não é mais hipster :/"},{"author":"Paulo Silveira","comment":"é sim! está nos planos, mas ainda sem agendamento :("},{"author":"Leo Cavalcante","comment":"Query selector foi inspiração da jQuery? Não foi da especificação do CSS que a jQuery implementou no JS?"},{"author":"Sérgio Lopes","comment":"A ideia de usar seletores CSS pra selecionar elementos no JS foi do John Resig em 2005: http://ejohn.org/blog/selec...Claro, ja existiam os seletores no CSS, mas na epoca o JS nem tocava nisso. Ai veio o jQuery e a ideia foi padronizada no querySelector. O primeiro rascunho da spec (na epoca document.matchAll() ) saiu em 2006: https://www.w3.org/TR/2006/..."},{"author":"Osmar Petry","comment":"Flavião é meu herói"},{"author":"Flávio Almeida","comment":"Tamo junto, cangaceiro! :)"},{"author":"João Felipe Alves","comment":"deveria ter uma conversa assim como aula 1 de todos os cursos."},{"author":"Paulo Silveira","comment":"um por carreira! é uma boa ideia"},{"author":"Ricardo Lima","comment":"Só acho que faltou chamar o Suissa para participar o podcast.. para ele JS é algo divino. kkkk"},{"author":"Sérgio Lopes","comment":"Ia ter que colocar muito Piiii na edição hahaha.Brincadeiras a parte, precisava mesmo, quem sabe numa proxima :)"},{"author":"Welton Vaz de Souza","comment":"@flaviohalmeida Obrigado Professor!  Agora no hipsters! Vc foi é a pessoa que me ensinou Javascript que mais gostei, transformou o aprendizado em diversão! Obrigado também @paulo_caelum e equipe da Alura."},{"author":"Flávio Almeida","comment":"Fala cangaceiro! No fundo, eu que tenho que agradecer por você ter sido meu aluno. Aliás, não existe professor sem aluno. Fico muito contente em saber que pude aliar o bom humor à aprendizagem de uma tecnologia e tornar esse sertão da aprendizagem menos chato.Sucesso e bom estudo meu aluno!"},{"author":"Denis Candido","comment":"Podcast está reproduzindo?"},{"author":"Cesar Lemos","comment":"Faz um podcast \"Batalha das linguagens\"...só pela treta"},{"author":"Maurício Linhares","comment":"Rust acaba com todo mundo, não ia ter graça."},{"author":"Flávio Almeida","comment":"Ah, não exagera querido co-host! Eu sei um \"pouquinho\" de Rust. Ela não compete com as outras. É treta!!!!!! :)"},{"author":"Sérgio Lopes","comment":"Ruby ja era #prontofalei #treta"},{"author":"Cesar Lemos","comment":"Delpli vs VB"},{"author":"Fanime Fartoon","comment":"Tanto já era que nem aparece ngm pra defender mais #ooooooooooolokors"},{"author":"Fanime Fartoon","comment":"Queremos ver treeeeeeeeeeeeeeeeeeeeeetaaaaaaaaaaaaaa \\o/"},{"author":"Flávio Almeida","comment":"Ai não vale, se não terei que falar de Rust Lang! :)"},{"author":"Cesar Lemos","comment":"kkkk,"},{"author":"William Oliveira","comment":"Fala, galera!Também fiz um post, em PT-BR, com um geral sobre ES6: https://medium.com/@wolivei..."},{"author":"Diogo Barros","comment":"Excelente material!"},{"author":"Paulo Silveira","comment":"valeu william pelo link e pelo post!"}]}