{"title":"Startups, Blockchain e Bitcoins – Hipsters #40","releaseDate":"18/04/2017","tags":["Podcast","startup"],"people":["Paulo Silveira","Mauricio Balboa Linhares","Rodrigo Dantas","João Paulo Oliveira"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=859%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D859&t_u=https%3A%2F%2Fhipsters.tech%2Fstartups-blockchain-bitcoins-hipsters-40%2F&t_e=Startups%2C%20Blockchain%20e%20Bitcoins%20%E2%80%93%20Hipsters%20%2340&t_d=Startups%2C%20Blockchain%20e%20Bitcoins%20-%20Hipsters%20%2340%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Startups%2C%20Blockchain%20e%20Bitcoins%20%E2%80%93%20Hipsters%20%2340&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"SonySantos","comment":"Sugestão: falar sobre Web Descentralizada, via blockchain, torrent ou outras tecnologias. Uma grande fonte de referências sobre isso está em https://github.com/gdamdam/.... Particularmente eu gostei do Gun JS Database: https://gun.eco/#step1"},{"author":"Rodrigo Kiepert de Oliviera","comment":"moeda de mentira kkk sendo q dinheiro no geral é só especulação e uma ficção jurídica."},{"author":"infoslack","comment":"A ideia de comprar Bitcoins para diversificar investimentos e assegurar um pouco de privacidade pelo visto não funciona na Foxbit."},{"author":"Olavo de Carvalho","comment":"Muito bom o podcast sobre o tema bitcoin, realmente me fez pensar em criar algo do varejo para bitcoin. Um airbnb de bitcoin algo do tipo, vejo que sempre a dificuldade de onde gastar o bitcoin no offline é muito dificil de achar, e quando acho não encontro nenhuma análise do estabelecimento. Acho que seria legal o google mostrar os locais que aceitam. Me aguardem rs =D."},{"author":"Mateus Queiroz Correia","comment":"Parabéns por terem conduzido um tema complexo de forma leve, lúdico e muito enriquecedora!!!"},{"author":"Rafael","comment":"O lastro do bitcoin é o limite da geração do hash"},{"author":"silivio","comment":"Errado, o lastro é a segurança e confiança de que ninguém pode lhe tomar. Simplesmente é a matemática."},{"author":"Paulo Silveira","comment":"mas acho que ele tava falando no sentido do que da valor mesmo. tipo, se todo o blockchain for sequestrado, da pra trocar os bitcoins que temos por algo que tem valor? nos eua, a ideia antiga era que dava pra trocar o dolar pelo ouro que o pais tinha. mas o ouro em si tambem nao tem lastro. bem, nao manjo desse economiques, é complicado :)"},{"author":"Rafael","comment":"O lastro do ouro é limite de se extrair ou \"estocá-lo\".Se eu comprar \"o enésimo bitcoin\", até o fim do bitcoin ou eu vender (o que vier primeiro) esse n será para sempre parte de m.Ações de empresa não tem lastro, tem vários golpes relacionados a isso. Por exemplo, emitir mais papeis para cobrir dívida.Aguardando os especialistas"},{"author":"josé marcos","comment":"Parabéns pelo podcast, pessoal! A escolha do tema foi excelente!Achei que poderiam ter explorado mais o tema de Blockchain e outras cryptomoedas. Espero que tenha uma continuação."},{"author":"Paulo Silveira","comment":"acho que merece um episodio só sobre blockchain!"},{"author":"Ítalo Araújo Siqueira","comment":"Ótimo tema. Uma duvida \"offtopic\": O Paulo Silveira trocou de microfone? melhorou muito o áudio dele."},{"author":"Paulo Silveira","comment":"eita! o meu é sempre o mesmo..... que estranho."},{"author":"Criptomoedas Fácil","comment":"Parabéns pelo podcast !Precisamos desse tipo de conteúdo para levar o BTC aos usuários mais leigos !!"},{"author":"Caio Ribeiro Pereira","comment":"Muito bom esse podcast!Infelizmente ainda não da pra viver no Brasil de bitcoins como moeda oficial, porém como trader, fazendo compras/vendas de bitcoins e altcoins da pra gerar um bom lucro com pouca grana investida, é tudo questão de acompanhar bem as oscilações, direto acompanho via https://watchcoins.net e http://coincap.io seus valores."},{"author":"Tet","comment":"Sobre blockchains:http://www.multichain.com/b...---http://eprints.maynoothuniv... -> TL;DR: o consumo, na época da publicação, era equivalente ao uso de energia INTEIRO da Irlanda.https://en.wikipedia.org/wi...---O Bitcoin foi uma ideia interessante. Foi divertido, eu aprendi sobre deflação e inflação (ok, um pouco). Mas honestamente, é uma tecnologia redundante para quase tudo que se propõe. E o fato de todas as brigas que começaram em 2014, AINDA não terem sido resolvidas em 2017, só mostra quão frágil ela é. E sendo frágil, ela não serve como moeda. Como investimento, só os malucos.Mas é bem verdade que só o mercado de apostas é ENORME. Só que quem aposta hoje, vai para Las Vegas, Macau, etc. Os pequenos até usam bitcoin, mas os jogadores de poker que acompanho não usam bitcoin.E se for para ser hipster, olha o que o pessoal fez: https://np.reddit.com/r/Bit...Traduzindo, colocaram as informações sobre o Massacre de Tian'anmen (conhecido em português como Praça da Paz Celestial) na blockchain. Que é algo censurado pelo partido comunista chinês. Talvez a única motivação para alguém comprar bitcoins seria para spammar isso. Se não fosse tão caro.---Enfim, desculpa o rant, mas o fato da tecnologia ser redundante me deixa irritado Desde que comecei a acompanhar a tecnologia, lá em 2012, só ficou mais complicado ver quem defende o Bitcoin. As origens, acredito eu, são honestas, mas mudou muito. O discurso é bonito, na prática é mais complicado."},{"author":"Paulo Silveira","comment":"fique tranqulo com o rant! é justo isso que buscavamos no episodio, polemica :)"}]}