{"title":"Tecnologias na Netflix – Hipsters #41","releaseDate":"25/04/2017","tags":["Podcast","programação","startup"],"people":["Paulo Silveira","Mauricio Balboa Linhares","Fabio Kung","Bruno Tavares","Cassiano Coria"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=866%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D866&t_u=https%3A%2F%2Fhipsters.tech%2Ftecnologias-na-netflix-hipsters-41%2F&t_e=Tecnologias%20na%20Netflix%20%E2%80%93%20Hipsters%20%2341&t_d=Tecnologias%20na%20Netflix%20-%20Hipsters%20%2341%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Tecnologias%20na%20Netflix%20%E2%80%93%20Hipsters%20%2341&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"João","comment":"Gostaria de saber, pq o netflix usava silverlight ate mais ou menos meados de 2016?"},{"author":"Micael","comment":"DRM - https://www.infoworld.com/a..."},{"author":"Luiz Eduardo Amorim","comment":"Eu tenho a mesma pergunta. É uma tecnologia tão ultrapassada e em desuso."},{"author":"Jose Cordeiro (Junior)","comment":"Fala Pessoal, tudo bem?Estou fazendo um TCC de Pós graduação em TI e gostaria muito da ajuda de vocês para responder um questionário acadêmico sobre microsserviços.Segue o link abaixo da pesquisa:https://pt.surveymonkey.com...No final, existe a opção de receber o resultado via e-mail.Obrigado.Abraços,José C. B. Jr"},{"author":"Felippe","comment":"Fui com muita expectativa escutar este episódio, já que admiro muito o Netflix e como eles inovaram a forma como assistimos tv hoje, mas infelizmente achei os convidados muito desanimados. Por mais que o Paulo e o Maurício tentassem mandar perguntas interessantes a entrevista não rendia ...acho que os caras estavam cansados, sei lá.  :-("},{"author":"Nei","comment":"Muito oportuno a trilha sonora (DareDevil) no final do episódio. Parabéns por mais um excelente podcast o/"},{"author":"Marquinhus Goncalves","comment":"Parabéns pelo episódio e pelo conteúdo é muito bom poder ouvir sobre o queacontece em uma empresa que faz parte dos nossos dias e como as coisas funcionam por lá, fora a parte técnica que o assunto foi em alto nível, episódio d emuito aprendizado. Valeu."},{"author":"lucas draichi","comment":"qual a dificuldade de vcs em falar portugues? kkk"},{"author":"Filipe Teixeira","comment":"xD"},{"author":"Renato Cesar Rego","comment":"Muito legal o Podcast, Paulo Silveira! Comecei a acompanhar o Hipsters Ponto Tech depois que me matriculei na Alura e o conteúdo desse Podcast é muito bom! Continue mantendo o nível e se consolidando como uma excelente fonte de conhecimento de TI. Parabéns e sucesso!Grande abraço."},{"author":"Paulo Silveira","comment":"oi Renato! Valeu a mensagem. Faz a gente trabalhar ainda mais empolgado :). E te vejo la na Alura"},{"author":"Gabriel Carafizi","comment":"Aaushuahsuashuhasuh tavam jogando Ace of Spades (buildandshoot) la pelos 30:00 quem tava jogando?"},{"author":"Paulo Silveira","comment":"pior que nao, tavam todos na camera, foi uma comida de maçã :)"},{"author":"Sebastião Relson Reis da Luz","comment":"Eu assisto no xbox 360 ainda, quase nunca atualiza, mas direto tem alteração na interface, muito bom o episódio"},{"author":"Samuel Rocha","comment":"Momento thug life do cast:Paulo todo feliz falando:- Então eu posso criar uma aplicação em React e buildar pra dispositivos específicos?Team Netflix diz: - VOCÊ NÃO, A GENTE PODE kkkkkkkkkkkkkkkkkk"},{"author":"Paulo Silveira","comment":"cortaram meu barato. eu achei que era uma deixa para \"sim! e agora está opensource em github.....\""},{"author":"Tetrade Desenvolvimento","comment":"Existe, nos planos da  NETFLIX, de fazer \"maratona\" de filmes? algo como o usuário criar sua playlist de filmes, sinto bastante falta disso (creio que outras pessoas também)."},{"author":"tiagocesar","comment":"Nunca tinha pensado nisso, agora quero"},{"author":"Fernando Boaglio","comment":"Muito bom podcast... melhor que ele só o 3% ! kkk"},{"author":"Gaspar Barancelli","comment":"Mais um ótimo podcast.Toda terça eu baixo o podcast e compartilho com o pessoal aqui da empresa, todos curtem muito.Gostaria de dar uma sugestão, poderiam gravar um podcast sobre o spring falando mais em específico sobre spring boot+cloud que utiliza boa parte das tecnologias open source da netflix.O meu muito obrigado e um abraço a todos envolvidos por disponibilizar um podcast de alto nivel."},{"author":"Andre Lopes","comment":"Episodio massa! só achei meio estranho escutar no começo alguem comendo uma maça kkkk"},{"author":"Eridani Campos","comment":"Ia comentar isso agora..rs"},{"author":"Paulo Silveira","comment":"caramba! teve mesmo. eh que como eles estavam em uma sala de microfone aberto, nao imaginaram que ia sair no audio hahhaa."},{"author":"Abraão Borges Neves","comment":"Muito bom ! Cada dia que passa o hipsters.tech, tem me ajudado mais e mais, abrindo minha mente, colaborando com novas ideias e direcionando caminhos.Muito obrigado galera, minhas terças tem sido constantemente revolucionarias, colaborando de mais."},{"author":"fabiokung","comment":"s/SDN/CDN/, desculpem pelo escorrego!Foi um prazer participar e bem divertido. Muito obrigado pelo convite!"},{"author":"Philipe dos Santos Pompeu","comment":"Muito bom esse episódio! O que eu acho mais interessante é imaginar que tem brasileiro desenvolvendo em empresas como a Netflix, acho muito maneiro."},{"author":"Paulo Silveira","comment":"alto nivel dos brazucas!"},{"author":"Fabrício Cabral","comment":"A melhor parte é quando o Maurício Linhares fala: \"É TRETAAA\" e joga e treta no colo dos convidados! Fica aí a sugestão: ter em todo o podcast o momento \"Treta do Linhares\", no qual ele joga a treta e grita o bordão: \"É TRETAAAA!!\" :D"},{"author":"Victor Menegusso","comment":"No final joga a risada gravada"},{"author":"Maurício Linhares","comment":"Mas esse povo gosta de uma treta viu!"},{"author":"Fabrício Cabral","comment":"São as tretas que movimentam a internet, Maurício Linhares! :)"},{"author":"Paulo Raimundi","comment":"Sempre quis saber quais tecnologias a netflix usa para seus serviço, e como eu imagina, me surpreendeu muito, vlw hipsters, vlw netflix :D"},{"author":"Welton Vaz de Souza","comment":"Nossa um episódio sobre o NETFLIX, das tecnologias da Internet que na minha modesta opinião essa empresa é a mais revolucionaria de todas, não só pela qualidade do serviços, mas principalmente pelo preço e quantidade possibilidades: de filmes, series e documentários disponibilizados pelo serviço. Minhas series favoritas do NETFLIX sempre disponíveis é formidável também. Apesar do toda a pressão do operadoras de quebrar o crescimento do streaming da NETFLIX no Brasil. Outro ponto importante, só por \"House of Cards\" já valia pagar duas vezes a mensalidade, agora ainda tem a produções da própria NETFLIX, e eles ainda colocam a disposição todo mês algo acabou de sair no EUA. Minha serie favorita atualmente é \"Designated Survivor\" que um excelente contraponto ao Presidente FDP, mas que todos adoram, Francis J. \"Frank\" Underwood, nesta série - \"Na noite do discurso do Estado da União, uma explosão tira a vida do presidente e todos os membros do Gabinete, exceto o Secretário de Habitação e Desenvolvimento Urbano dos Estados Unidos Tom Kirkman, que foi nomeado o sobrevivente designado. Kirkman é imediatamente empossado como presidente sem saber que o ataque é apenas o começo do que está por vir\". Parabéns pela escolha do tema, é muito obrigado!"}]}