{"title":"Small Data, Big Data, Open Data – Hipsters #42","releaseDate":"02/05/2017","tags":["infraestrutura","Podcast"],"people":["Paulo Silveira","Marcelo-Mauricio Balboa Linhares","Tiago Peczenyj","Marcelo Soares"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=871%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D871&t_u=https%3A%2F%2Fhipsters.tech%2Fsmall-data-big-data-open-data-hipsters-42%2F&t_e=Small%20Data%2C%20Big%20Data%2C%20Open%20Data%20%E2%80%93%20Hipsters%20%2342&t_d=Small%20Data%2C%20Big%20Data%2C%20Open%20Data%20-%20Hipsters%20%2342%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Small%20Data%2C%20Big%20Data%2C%20Open%20Data%20%E2%80%93%20Hipsters%20%2342&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Caio Flores","comment":"Maurício Linhares e Paulo Silveira  primeiramente parabéns pelo(s) Podcast(s)! Escuto direto e o conteúdo é sempre muito relevante e ajuda muito no meu dia a dia.Hoje sou gerente de produto em uma Startup que também trabalha com Dados Abertos, o Sigalei (http://sigalei.com.br/), então achei válido deixar registrado aqui!O Sigalei é basicamente um sistema para fazer o monitoramento de proposições que tramitam em nível federal e estadual, para que organizações possam monitorar o seu risco legislativo.Tiramos alguns insights bem legais dos nossos dados e postamos frequentemente no nosso Blog (https://blog.sigalei.com.br/) pra quem tiver interesse."},{"author":"Alexandre Andrade","comment":"Acho(*) que falou o link para o Open Knowledge International https://okfn.org/"},{"author":"Cristian Mendes Firmino","comment":"Podcast fantástico! Eu não sou da área de TI embora apaixonado por ela, trabalho muito com análise de dados (porém em departamentos da empresa), aprendi muita coisa no Excel, passei para o QlikView e agora estou utilizando o R. Já fiz várias melhorias dentro da empresa e acho fantástico como podemos retirar informações dos dados que estão espalhados por aí. Estou estudando NodeJS, aprendendo a fazer crawling, exatamente para retirar informações úteis dos dados na internet e publicar de alguma forma. Ouvindo esse podcast me trouxe várias idéias sobre esses meus \"trabalhos\"."},{"author":"Nailan Ferreira","comment":"Então você trabalha com TI meu filho.."},{"author":"Junior Osho","comment":"Ótimo podcast ! a parada das Arvores e sacanagem né ?"},{"author":"Welton Vaz de Souza","comment":"Vcs estão de parabéns a cada podcast que ouço fico mais ansioso para ouvir o da próxima semana, sou fã de todos vcs, tá ficando muito legal, parabéns para toda equipe Hipsters, do Alura e ao sensacional Léo Lopes do Radiofobia."},{"author":"Alex Souza","comment":"Olá, HipstersMeu nome é Alex tenho 29 anos e sou formado em Sistemas para Internet um Web Developer Junior!.Quero deixar aqui meu agradecimento pelo o excelente podcast, ouvinte assíduo desde do primeiro episódio este foi o primeiro podcast que conheci em uma época que eu nem sabia o que era podcast,  Outro dia estava pesquisando sobre outros podcast para enriquecer meu conhecimento e encontrei o SciCast que chamou a minha atenção. Comecei a maratona para ver todos os episódios deles pois acho que assuntos relacionados a ciência não expira ou pode auxiliar na percepção do atual momento da vida. Bom toda esse indagação é para dizer que no episódio 16 do SciCast do dia 14/02/2014 no momento que eles estão lendo os comentários dos ouvintes eles anunciam o comentário do Maurício Linhares  achei sensacional o efeito em cadeia, comecei a ouvir podcast com o Hipsters e descobrir que o Cohost deste projeto deixou um comentário em um episódio do SciCast de 2014 e agora em 2017 eu ouvi o seu comentário é mega curioso, demonstra que em 2014 o Mauricio já estava se preparando para no futuro ser integrante de um podcast. Junto com o  Paulo Silveira desenvolvem este super podcast sobre tecnologia.Parabéns a todos que fazem o Hipsters.PS: Com esse descobrimento notei que dados podem ser eternos, por isso tomem cuidado ao postar aquela foto de infância na internet."},{"author":"Paulo Silveira","comment":"hehehe! excelente depoimento para se ler! valeu alex"},{"author":"Rubinho_sjr","comment":"Caramba que loco esse cast, tenho estudado bastante sobre big data pensando até em uma pós na área.Mas curti ainda mais as aplicações que o Marcelo deu, não sou uma pessoa muito fã de politica exatamente pela dificuldade de se conseguir informações concretas em um mundo tão polarizado e essas aplicações são exatamente a solução pra isso.Os números não mentem, mas cabe a nós agrupar e analisar todos pra ter uma visão real.Tenho um projeto pra fazer algo parecido com isso na minha cidade, verificar a presença dos vereadores nas reuniões da câmara e os votos de cada um. Mas conversando com um vereador ele me disse que seria bem difícil de ter arquivado (e me passarem) esses dados.Mas pelo que entendi existe uma lei que garante o acesso a essa informação? Alguém poderia me informar qual é essa lei? Eu pesquisei um pouco mas não achei nada muito especifico (confesso que não sou tão bom em entender leis então posso ter lido ela e não vi)Parabéns pelo cast Paulo Silveira Maurício Linhares e toda equipe o/"},{"author":"João Paulo","comment":"Ótimo podcast!Sou um programador querendo entrar no mundo do BigData, e quando estou em debates eu sempre falo para o pessoal que tentem deixar um pouco essa mania de pdf. Pois dificulta muito, mais eu acho que com alguns ajustes e avanços nos sistemas os dados poderão ser expostos para utilização bem mais fácil. E queria abrir uma observação a respeito do que falaram sobre consultar o salario de um servidor publico. Se uma pessoa sabe o nome completo e o cpf de um servidor, ele pode fazer a consulta do salario sem problemas através do portal da transparência."},{"author":"Abelardo","comment":"Muito bom o podcast! Se não me engano, o Marcelo falou que possui uma base com histórico de nomeações de ministros de estado - sabem se essa base é pública(ou pode ser publicada)?"},{"author":"Romulo Martins Da Silva","comment":"Poderiam ter chamado o Caio Gomes"},{"author":"Paulo Silveira","comment":"verdade! avisei ele de um de seriados, vou pingar  novamente, topamos o assunto que ele quiser :)"},{"author":"William","comment":"Muito bacana, Faltou falar do Repasse *_* http://repasse.ufabc.edu.br/"},{"author":"Vinícius Carneiro","comment":"Massa!!"},{"author":"Abraão Allysson Dos Santos","comment":"Ótimo episódio, parabéns. Deixo um link abaixo sobre um evento sobre que tem tudo a ver com o podcast(tecnologia e transparência) que vai acontecer em João Pessoa/PB.https://www.facebook.com/ha..."},{"author":"Diogo Medeiros","comment":"Ótimo episódio.Pra mim foi um dos melhores... interessantíssimo criar novas perspectivas ao enxergar dados."},{"author":"Paulo Silveira","comment":"valeu diego o apoio!"},{"author":"Doctor_Brown","comment":"Ótimo ver o Marcelo Soares participando de um podcast sobre estatística. O canal Numeralha é um dos meus favoritos no Medium."},{"author":"Marquinhus Goncalves","comment":"Parabéns pelo episódio, um assunto muito interessante que faz parte dos nossos dias e são tão importantes para certas decisões. O que mais curti foi o episódio trazer alguns pontos sobre o assunto em que em nunca havia pensado. Valeu pessoal."},{"author":"Garfield","comment":"Só um adendo sobre o Serenata de Amor... eles financiaram o projeto através de crowdfunding, ou seja, não trabalharam de graça, o que não tira em nada o mérito do projeto, pelo contrário, já que teve apoio da sociedade!"},{"author":"Paulo Silveira","comment":"boa observacao"},{"author":"Francisco Sokol","comment":"Paulo, você não postou o link da notícia sobre as pesquisas que ninguém consegue mais reproduzir :-)"},{"author":"Paulo Silveira","comment":"Chico! Verdade. Ta aqui, e é chocantehttp://www.nature.com/news/..."},{"author":"²He","comment":"Especial do Hipster com algumas horas de duração com o pessoal da Op. Serenata de Amor.Eles ja participaram de um anticast mas foi mais voltado na parte histórica e politica do que na técnica. Acho que além disso eles conseguiriam alguns colaboradores sendo vistos por aqui.Otimo programa esse ^^"},{"author":"Paulo Silveira","comment":"está na minha longa lista!"},{"author":"²He","comment":"Pode riscar da lista Paulo Silveira !"},{"author":"Paulo Victor Dantas","comment":"Deveria ter uma listagem dos podcasts no site. Fica dificil acompanhar em ordem sem uma listagem."},{"author":"Rafael Geronimo","comment":"Aqui também trabalhamos com a LAI e realmente, muitas das informações provenientes de alguns estados vem em PDF com imagens de planilhas impressas e escaneadas (!!!), onde é quase impossível a leitura!"},{"author":"Paulo Silveira","comment":"só magica mesmo!"},{"author":"Fanime Fartoon","comment":"Tiago é uma das lendas ainda ativas no GUJ=)"},{"author":"Paulo Silveira","comment":"temos um gujeiro aqui!"},{"author":"Fanime Fartoon","comment":"Seria legal um especial com a galera das antigas, pra saber como o/os fórum/fóruns os ajudaram, o que mudou nesse tempo todo com o aumento das redes sociais, por onde andam e que fazem hehe:)"},{"author":"Victor Mattos Dimen","comment":"Algo que poderia ajudar na maturidade social do uso de dados é facilitar sua aquisição e garantir um certo nível de qualidade.Imaginei algo como uma plataforma única de disponibilização de dados públicos, quase um github de dados.Também seria mais fácil de exigir dos responsáveis a disponibilização desses dados."},{"author":"Rafael Vicio","comment":"Ainda não pude conferir o podcast, mas dei uma olhada nos links. Ja vi muita coisa do portal da transparência fora do ar por \"falta de financiamento\". http://www.excelencias.org.br/"},{"author":"Carlos Carvalho","comment":"Achei super bacana o papo. Mas não sei se estou mal acostumado, mas fiquei sentindo falta de qualquer comentário sobre tecnologias referentes ao assunto, ou alguma referência a bibliotecas utilizadas, enfim.Eu tive um problema tentando coletar dados no portal da transparência onde uma prefeitura do interior do PI enviou uma quantidade enorme de PDF's protegidos por senha!! A intenção da pesquisa era identificar onde os gastos da merenda escolar eram mais aplicados (cereais, leite...). Como se já não bastasse ser em PDF ainda era protegido por senha. Até hoje espero a liberação desses dados. Estamos apenas engatinhando no Brasil nesse quesito de dados públicos."},{"author":"Maurício Linhares","comment":"Foi, focamos mais no processo mesmo, vamos gravar outros sobre big data pra falar mais do ferramental mesmo."},{"author":"Rafael Vicio","comment":"Eu tenho a impressão de que eles fazem isso de proposito, muitas vezes eles liberam algumas coisas apenas para gerar algumas noticias, mas logo depois esses projetos são esquecido, por eles e ate por nos mesmos."}]}