{"title":"Internet das Coisas, Android e até Cerveja – Hipsters #43","releaseDate":"09/05/2017","tags":["hardware","Podcast","startup"],"people":["Paulo Silveira","Mauricio Balboa Linhares","Neto Marin"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=878%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D878&t_u=https%3A%2F%2Fhipsters.tech%2Finternet-das-coisas-android-e-ate-cerveja-hipsters-43%2F&t_e=Internet%20das%20Coisas%2C%20Android%20e%20at%C3%A9%20Cerveja%20%E2%80%93%20Hipsters%20%2343&t_d=Internet%20das%20Coisas%2C%20Android%20e%20at%C3%A9%20Cerveja%20-%20Hipsters%20%2343%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Internet%20das%20Coisas%2C%20Android%20e%20at%C3%A9%20Cerveja%20%E2%80%93%20Hipsters%20%2343&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"erickson marinho pr","comment":" Ola! muito show os podcast. gostaria se puderem,abordarem sobre o flash,actionscript e se vcs usariam o flash para games. o flash morrerá? o adobe animate aderiu ao html5 pra competir ou pra não perder a grandeza no nome? eu to realizando um projeto aplicativo de ingles para android no flash cc,e percebo que é mais agil que os pacotes javas. o que to desenvolvendo é um app voltado ao aprendizado de english com jogos puzzles,quebra_cabeças,e tudo em um. terminarei em setembro. sou desenvolvedor \"amador\",faço curso de c#.ja fiz java,php,e c++.sou do Parana,um abraço"},{"author":"Paulo Silveira","comment":"oi erickson. a vida do flash esta no fim mesmo... o animate so tera forca se ficar em html5. nao recomendo voce se aprofundar em flash e actionscript mais. algumas tecnologias, mesmo interessante e pioneiras, acabam morrendo :("},{"author":"erickson marinho pr","comment":"É...Mas tô codando o mesmo app em c#. também e percebi que ocorreu uma pequena sequência de loops ja que to usando o unity. valeu pela resposta. "},{"author":"Taichou12","comment":"As imagens dos episódios estão com uma resolução baixa quando baixo aqui no pocket casts. Eu sei que não afeta o conteúdo do programa, mas é quase um toc rsrsrsrs."},{"author":"Paulo Silveira","comment":"vi que o meu pocket casts nao mostrar nenhuma capa de episodio, so do show principal.... sera que é por causa do seu ser iphone?"},{"author":"Taichou12","comment":"É uma opção que você habilita lá em: Settings > Appearance > Use episode artwork. E não, não uso iphone rsrsrs. Vou baixar o episódios outra vez, talvez tenha sido algum tipo de bug."},{"author":"Paulo Silveira","comment":"vou ver isso! tb uso pocket e nao percebi!!"},{"author":"Fabrício Stahelin","comment":"\n\n\nReproduzir\n\n\n Ocultar\n\n\n\n"},{"author":"Maurício Linhares","comment":"Muita gente perguntou do bife, olha aí como é o processo. Bife de picanha, alecrim, alho, sal e pimenta do reino.\n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n \n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n \n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n \n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n "},{"author":"Alison de Amorim","comment":"Joule Sous Vide, interessante... porem eu fico com uma duvida (não entendo de cozinhar eu só gosto de comer )..... Referente a historia que componentes plásticos podem soltar substancias cancerígenas em alta temperatura, isso não irá te fazer um mau gigantesco futuramente ?"},{"author":"Maurício Linhares","comment":"tem que usar plástico próprio pra cozionha e sem BPA."},{"author":"Fabio de Simoni","comment":"To pensando em comprar um... Esse eh o Joule Sous Vide? Recomenda comprar esse modelo mesmo? Ja fez sem embalar a vacuo como o cara mostra nos videos? Faz tanta diferenca mesmo?Obrigado,Fabio"},{"author":"Maurício Linhares","comment":"E o aparelho tanto faz, eu gosto do Joule, mas já usei Gourmia e funciona bem também."},{"author":"Fabio de Simoni","comment":"Que pena, aqui na europa eh tudo 220v e o Joule eh 110v.Vou ter que esperar o lancamento do 220v....Obrigado pela dica e pelo retorno!Abracos"},{"author":"Maurício Linhares","comment":"Já, tem o método da água também que dá pra fazer com ziplocks comuns: http://www.seriouseats.com/..."},{"author":"Junior Osho","comment":"Parece um morcego...kakak"},{"author":"Junior Osho","comment":"http://mundoestranho.abril...."},{"author":"Fanime Fartoon","comment":"\"Nossa, 10$ vem tudo isso ...\"Parecia aqueles apresentadores de tv qdo apresentam produtos da Polishop hahahaha"},{"author":"Paulo Silveira","comment":"e olha que falei com sinceridade!!!"},{"author":"Luiz Pansarini","comment":"Que delicia de Podcast!!Sou um lover de IoT, e já trabalho com Arduino a quase 7 anos. É realmente um grande sonho ver essa crescer cada vez mais no ano passado e nesse ano.O podcast foi ótimo, mas acredito que faltou dar uma pincelada sobre o GitHub, Hackster.io e o Instructables que são ótimas ferramentas, não só para IoT, que pode ajudar as pessoas que são novas na área, a entenderem o quão grande é esse mercado.Como um professor da faculdade disse para mim: \"Para a tecnologia, o céu é o limite, ou não (literalmente)\".Parabéns e sucesso a todos!PS: seria legal ter uma participação de alguns usuários no Podcast ou ter uma sessão de emails com dicas também."},{"author":"Paulo Silveira","comment":"que incrivel esse hackster!a secao de emails é uma ideia, mas vai ficar pra mais pra frente. e participacao é sempre bem vinda! se tiver um assunto mais focado que quiser conversar de iot, manda um email pra gente!"},{"author":"Luiz Pansarini","comment":"Quem dera, não sou tão expert assim. Mas quem sabe daqui um tempo!Sucesso e abraços"},{"author":"Antonio Campos","comment":"Gosto muito do cast de vcs, sou desenvolvedor java raiz em um Banco hehehe e moro em Aracaju - SE e entusiasta Maker.Só um adendo sobre a origem do termo \"Internet of things\", o entrevistado disse q o termo já era utiliza muito tempo atras em artigos acadêmicos sobre compartilhamento de impressora na década de 70. Já pesquisei sobre isso - quem cunhou o termo - e nunca achei essa referência que vocês comentaram. O que eu sempre encontrei é que o termo foi cunhado por Kevin Ashton um dos responsáveis pela especificação do RFID. Se puderem me passar essa informação sobre a origem do termo, fico agradecido."},{"author":"Paulo Silveira","comment":"opa!! vou ver se acho a referencia"},{"author":"Vagner Pagotti","comment":"1999. http://www.rfidjournal.com/..."},{"author":"Daniel Kist","comment":"Parabéns pessoal, o episódio foi muito bacana.Apenas uma adendo. Vocês falaram de coisas para se fazer em casa e pularam para lançamento de produtos através de compra coletiva.Uma dica que pode ser interessante é tentar pequenos projetos aplicados nas empresas que o pessoal trabalha.Imagino que a maioria daqui trabalha direta ou indiretamente com TI, então é possível dividir a carga do aprendizado com o time da empresa (em projetos paralelos mesmo).Aqui onde trabalho fiz um dispositivo simples para monitorar o café. Por ser na empresa, consegui vários insights com o time para melhorar o produto.E esse foi o resultado final:https://www.linkedin.com/hp..."},{"author":"Fernando Boaglio","comment":"parabéns Daniel, tem publicado em algum lugar mais detalhes técnicos do seu projeto ?"},{"author":"Daniel Kist","comment":"Olá Fernando. Não, mas pessoal está pedindo. Vou ver se consigo escrever um post detalhando o hardware e as tecnologias que utilizei. Assim que fizer isso já posto o link aqui."},{"author":"Paulo Silveira","comment":"ô louco! o snoopy deve passar o dia inteiro te agradecendo :)"},{"author":"Daniel Kist","comment":"Já perdi a primeira posição no ranking faz tempo. Tem gente levando a sério a competição..kkk"},{"author":"Carlos Carvalho","comment":"O Arduino teve e ainda tem um papel muito importante na popularização do \"faça você mesmo\". Conheço o projeto desde os primórdios. Dei muita aula com ele. Mas hoje, quase dez anos depois de conhecê-lo, eu não recomendo-o mais para projetos definitivos. A menos que seja para aprender. Existe uma infinidade de plataformas mais baratas e muito mais robustas e com muitas possibilidades. Na época do \"bum\" do Arduino no mundo todo, uma placa com recursos idênticos era vendida pela texas instruments por 20% do valor.Hoje por exemplo estou trabalhando em um projeto com o Omega2 Plus uma plataforma de 9 dólares com linux embarcado, contra 70 dólares do arduino yún. E no kickstarter tem projeto novo toda hora com preços muito baixos. Até o próprio PI já é bem superior e com custo bem menor.Não estou tentando tirar o mérito do projeto Arduino, até porque eu mesmo aprendi e fiz muita coisa com ele. E até hoje para iniciantes é o que eu recomendo. Mas somente para iniciantes. Pois mesmo em projetos super leves com o mínimo de processamento necessário já existem plataformas muito mais eficientes e mais baratas no mercado."},{"author":"Fausto Blanco","comment":"vocês falaram que \"Arduino não\", porem a linksprite lançou e ainda da suporte as placas mais antigas, o pcDuino, http://store.linksprite.com... eu tenho e uso, e considero melhor que rasp e muito... o que vocês me dizem sobre isso?Esse eu tenho em casa -> http://store.linksprite.com...A Mini PC with Arduino type Interface powered by ARM Pro Spec:CPU: 1GHz ARM Cortex A8GPU: OpenGL ES2.0, OpenVG 1.1 Mali 400 coreDRAM: 1GBOnboard Storage: 2GB Flash (4GB after 02/01/2014), SD card slot for up to 32GBVideo Output: HDMIOS: Linux + AndroidExtension Interface: 2.54 mm Headers compatible with ArduinoNetwork interface: RJ45 and built-in WiFi"},{"author":"Fernando Gonçalves","comment":"Muito bom o episodio, caiu bem na minha madrugada. Já estava querendo brincar nessa área, gostei dessa iniciativa do google, vai me ajudar, é muito nessa jornada."}]}