{"title":"UX: Pesquisa com o Usuário – Hipsters #44","releaseDate":"16/05/2017","tags":["design & ux","front-end","Podcast"],"people":["Paulo Silveira","Luciana Terceiro","Elisa Volpato","Carla de Bona","Natan Souza"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=887%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D887&t_u=https%3A%2F%2Fhipsters.tech%2Fux-pesquisa-com-o-usuario-hipsters-44%2F&t_e=UX%3A%20Pesquisa%20com%20o%20Usu%C3%A1rio%20%E2%80%93%20Hipsters%20%2344&t_d=UX%3A%20Pesquisa%20com%20o%20Usu%C3%A1rio%20-%20Hipsters%20%2344%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=UX%3A%20Pesquisa%20com%20o%20Usu%C3%A1rio%20%E2%80%93%20Hipsters%20%2344&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Fernando Liell","comment":"UX ta sendo a área mais importante nesse momento para o meu negócio."},{"author":"Thiago Grespi","comment":"Cada podcast desses deveria gerar um certificado no assunto. Show de bola!"},{"author":"Afonso Lage","comment":"Muito bom!"},{"author":"Patric Pires","comment":"Ótimo episódio, eu gosto muito de frontend, algumas ideias nunca haviam passado pela minha cabeça como as de pesquisas com os usuários, pra mim o que eu testava já estava legal e pronto. Parabéns."},{"author":"Bruno Katekawa","comment":"Gostei muito do episódio!! Convidados mais do que especiais! =] Parabéns pelo trabalho!! Obrigado!"},{"author":"Alex Silva","comment":"Episódio, muito bom! Parabéns. Fiquei curioso em saber como vocês escolhem as pessoas pra fazer os testes. Poderia ser uma pessoa comum como eu por exemplo?"},{"author":"Natan Souza","comment":"Oi Alex, valeu! :) Tudo depende do seu produto e do seu objetivo, mas o ideal é ter uma ideia de corte. Por ex, um app de FGTS e voce seleciona um adolescente de 15 anos pro teste, será que faz sentido? Primeiramente vem um `nao` na cabeca, mas e se o seu intuito com o app é justamente mostrar a ideia do FGTS para jovens? Abcs!"},{"author":"Alex Silva","comment":"Valeu Natan, e se eu quiser participar de um, tem algum formulário?"},{"author":"Samanta Miranda","comment":"Episódio muito bom! Estou migrando para a área de UX desde o começo do ano.Me identifiquei muito com as rotinas e formas de pensar e desde que comecei a estudar UX nunca mais consegui navegar da mesma forma (comprar passagens aéreas então nem se fala rsrsrs).Estou achando muito bacana trabalhar nesta área e este episódio foi um incentivo a mais para mim :)"},{"author":"Cezar Carneiro","comment":"Muito bom!Gostaria de sugerir um episódio focado nas novidades anunciadas neste Google I/O."},{"author":"Edgar Salazar","comment":"Excelente episódio. Podem me dizer qual a música em 16:10?"},{"author":"PP CarvalhoF","comment":"Ótimo episódio! Como sempre...Só me restou uma dúvida: existe algum lugar onde possamos nos inscrever pra sermos \"cobaias\" para esses testes de UX? Sempre vejo umas interfaces que... Ninguém merece! Um bom exemplo é no EAD da Estácio. Nunca consegui descobrir qual era a minha \"evolução\" nas matérias e quais eu estava atrasado...Abraços!Carvalho. "},{"author":"Natan Souza","comment":"Valeu! Conheco a https://www.usertesting.comUma boa dica é fazer um estudo a respeito do EAD da sua facu e publicar em algum lugar com uma solucao legal, ai vai gerando seu portfolio! "},{"author":"Vitor Panuci","comment":"Pra ser cobaia eu não sei, mas existem sites que te pagam para fazer este trabalho =D. Não sei se posso divulgar links aqui mas é so dar uma pesquisada que você encontra, muito bacana!"},{"author":"Milton Jacomini Neto","comment":"show!"},{"author":"Felippe","comment":"Excelente episódio! Esse foi um daqueles que a gente torce pra não terminar... (deveria ter uma parte II).Vocês conseguiram reunir convidados com muito conteúdo e principalmente didática. Parabéns pelo Podcast!"},{"author":"Felipe Lorenzoni","comment":"Link da poésie sobre escolha com ajuda do cartão de crédito.http://aneleira.poesie.com.br/"},{"author":"Rômulo Innocêncio","comment":"Aqui no meu trampo tem um cara que se diz Design e UX, mas as vezes dói o olho no contraste, e outras coisas que ........... não tem teste antes, não tem estudo em cima, é tudo o achismo. Eu não manjo quase nada, mas eu sei quando um botão não tem cara de botão, e quando mistura coisas demais no site. =/Enfim, A/B nem pensar. Nem microcopy, nada de evolução. As vezes desanima. Eu tento aqui aplicar umas coisas, mas é tenso."},{"author":"Natan Souza","comment":"comeca a introduzir a ideia de UX na sua empresa voce mesmo romulo, uma ex-aluna minha fez um post sobre isso http://blog.caelum.com.br/d...e sobre o parça do seu trampo, infelizmente muito designer entrou na vibe de UX e nao pensa nem no minimo de usabilidade, como a contraste mesmo que voce falou :/da uns toques pra ele que tenho certeza que serao bem recebidos!"},{"author":"Liordino Neto","comment":"Ótimo episódio! Apesar de não ser um profissional da área de UX eu advogo pela contratação de bons serviços e profissionais dessa área em todo lugar que passo, porém infelizmente sem sucesso, o que acredito que deve acontecer com muita gente. Acho que isso vem do fato de (assim como em outras áreas) os responsáveis pelas decisões não enxergarem o valor que há nisso, principalmente (mas não só) em termos financeiros mesmo, que afinal é o que acaba balizando muita decisão. Ai tenho uma pergunta: há estudos que mostrem o resultado em termos financeiros da aplicação de boas práticas de UX? E em outras áreas menos quantitativas, como a satisfação do cliente? Obrigado pela discussão!"},{"author":"Lucas Palma Stabile","comment":"Trabalhei em lugares em que você descreveu também. Havia um Designer na empresa (não sei se era focado em UX) mas logo depois ele saiu e nunca contrataram outro Designer, nosso layout ficou baseado em um template pronto de HTML que alterávamos conforme pessoal desejava, mas mesmo assim, alguns conceitos e coisas que melhorariam a experiência do usuário ficavam negligenciadas pelos prazos e falta de visão para essa questão."}]}