{"title":"Startups, Venture Capital e Investimentos – Hipsters #45","releaseDate":"23/05/2017","tags":["business","Podcast","startup"],"people":["Paulo Silveira","Rodrigo Dantas","Flavia Bicalho","Rodrigo Baer"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=917%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D917&t_u=https%3A%2F%2Fhipsters.tech%2Fstartups-venture-capital-e-investimentos-hipsters-45%2F&t_e=Startups%2C%20Venture%20Capital%20e%20Investimentos%20%E2%80%93%20Hipsters%20%2345&t_d=Startups%2C%20Venture%20Capital%20e%20Investimentos%20-%20Hipsters%20%2345%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Startups%2C%20Venture%20Capital%20e%20Investimentos%20%E2%80%93%20Hipsters%20%2345&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Rick Wolff","comment":"Eu fico com um pé atrás quando o assunto começa a falar que o funcionário também é um sócio da startup. Quando fala que \"é só ser focado e comprometido e assim o funcionário será recompensado\". Eu traduzo isso como: \"você (dev) vai suar sangue até a startup crescer e, se você não der resultados, a gente vai cortar você na boa, pq a gente gosta de pessoas focadas, pq nós somos cool/hipsters\".E juntando isso ao discurso de que \"o dev tem que estar focado no propósito maior da empresa de ajudar o seu público, sem pensar inicialmente em dinheiro\". Isso eu traduzo como: \"você vai trabalhar mais do que seria saudável e vai ganhar menos do que seria aceitável. E, se não der resultados, será cortado.\"Sinceramente, eu até acho que isso é um problema do próprio capitalismo/consumismo, que obriga as empresas a sobreviverem enxugando os recursos. Mas parece que esse nome \"startup\" mascarou esse abuso dos funcionários. Vocês comentam que o funcionário é um sócio da empresa, que ele vai ter os lucros da empresa. Mas vocês também comentam que as startups começam a dar dinheiro de verdade depois de 5 a 7 anos. O cara acaba fazendo um investimento de sangue e saúde para a empresa sair do chão. E às vezes o cara é cortado depois de 4 anos, pq a empresa ainda não chegou nesse ponto onde ela começa a dar lucro. E a pessoa já se esgotou de tanto trabalhar, ou quer começar uma família, ter uma vida mais calma. Eu penso que isso pode estar criando uma geração bastante esgotada no futuro. Me parece que essa cultura da \"startup que não é só puff\" está mascarando um comportamento bem ruim para a vida das pessoas a médio e longo prazo. O que vocês acham disso? Concordam? Discordam?   :)Parabéns pelo ótimo trabalho! Só o fato de gerar essa discussão na minha cabeça já é incrível. São coisas que eu paro pra pensar e realmente não sei se esse pensamento é \"certo\" ou \"errado\". E nem sei se existe resposta. =P"},{"author":"Rick Wolff","comment":"Fazendo um PS aqui: Vocês comentaram sobre as stock options. Vocês sabem dizer qual a dificuldade para implementar isso? Custos, parte jurídica e etc.Eu não tinha ouvido sobre isso ainda e fiquei curioso sobre qual o momento que uma empresa pequena consegue dedicar tempo/dinheiro para pensar nesse assunto.Thanks! ;)"},{"author":"gfg","comment":"Tive que reouvir algumas vezes pra cair a ficha. Os caras pegam 150 milhões, investem em pelo menos 15 startups, já com produto funcional e clientes. Ficam com 20% da empresa, e esperam um retorno de pelo menos 150 milhões em CADA UMA DELAS....  Desculpem o termo, mas parece uma grande filhadap*tagem. Se o cara já tem a empresa andando não é muito mais viável um empréstimo? Até agiota me parece melhor nesses termos."},{"author":"Alex Farias","comment":"Não é bem assim...GRANDE parte do sucesso é ter os contatos certos, experiência para errar menos e fôlego pra aguentar a concorrência. Esses caras não oferecem só o dinheiro, a orientação pode valer até mais que isso."},{"author":"Rodrigo Baer","comment":"Acontece que sao poucas as empresas que sao consideradas \" sucesso\", ou seja, que retornam o fundo. A media de mercado é 1/3 quebrar, 1/3 andar de lado e 1/3 ser algum nivel de sucesso. Em media, bons fundos retornam de 3-4 vezes o capital investido - em 7 a 10 anos . A media do mercado eh soh retornar o capital. Ou seja, considerando o risco, nao me parece uma filhadap*tagem...Alem do mais, se o nosso retorno for de $150 Mi na empresa, significa que o nosso dinheiro viabilizou uma empresa de $750 Mi ser montada. "},{"author":"gfg","comment":"Ok. 1/3 de prejuízo, considerando que no segundo caso se consiga ao menos recuperar o valor inicial investido com correção de inflação. Me parece um mercado de opções de longo prazo. Sendo que provavelmente o fundo não reposto só de 7 em 7 anos.   Ainda não vejo o montante oferecido compensar a diluição.De qualquer forma , grato pela atenção."},{"author":"Leonardo Cavazzani","comment":"Trabalho no carreira beauty que comentaram no poscast como dev android. Realmente trabalhar em startup nao é so puff e jogar ping pong igual muitos acham. Tem q ser bem focado e acreditar no produto!"},{"author":"brianrequarth","comment":"Parabéns pelo podcast. Cubriram temas bem importantes. Acho que esta initiativa é algo super positivo para o ecossistema brasileiro. Os 4 agregaram bastante para todo mundo interessado no tema de startups e venture capital"},{"author":"rgarbin","comment":"Muito top o epsódio, recomendo o tema: Inovação digital e MVP''s =)"},{"author":"Kelvin Dules","comment":"Um dos meus eps favoritos! Me lembrou muito das cagadas que acontecem na série Silicon Valley x)"},{"author":"Paulo Silveira","comment":"acho que o Rodrigo foi muito bem no episodio lembrando a gente que o socio tambem ta com a pressao que quem recebeu option tem. e deixou claro que não é pra todo mundo. foi bem transparente.eu conversei com ele antes e esqueci de fazer outras perguntas boas onde ele tambem foi muito bem ao conversar comigo, em especial sobre exits brasileiras"},{"author":"Luis Antonio","comment":"Gosto muito quando o Paulo coloca os convidados para explicar os \"termos\" , a maioria do pessoal que trabalha com investimentos inflam suas conversas com termos para dificultar o entendimento(o Lobo de Wall Street que o diga rs\") exemplo, \"fazer scouting para achar bons deals para hounds\"  kkkk \n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n"},{"author":"Rodrigo Baer","comment":"Luis Antonio, também acho muito legal o Paulo fazer isso pois quando estamos falando é facil usarmos o jargão do mercado ( esse é um mercado que funciona todo em inglês) e esquecer que nem todos conhecem os termos bem. Aposto que o mesmo acontece quando você fala com um leigo sobre tech ou games. Normalmente as pessoas nao estão tentando inflar ou dificultar o entendimento ( mesmo porque se dispõe a fazer um podcast para explicar esse mundo a outros que conhecem menos).... so estão usando o que falam no dia a dia. De qualquer forma, valeu pelo feedback e pelo Gif educado!"},{"author":"Rômulo Innocêncio","comment":"Muito interessante, embora muitos dos assuntos abordados aí ainda são distantes para mim... estou procurando saber mais. Gostei desse CUBO ai. Uma dúvida, alguém sabe qual é o Plugin do #SLACK (\"score\") sobre os links, está nos 24:01... não consigo encontrar. =) Obrigado."},{"author":"Paulo Silveira","comment":"skore!http://skore.io/"},{"author":"Augusto Santos","comment":"Parabéns a toda a equipe do Hipsters! Esses podcasts voltados a negócios são bacanas mas ainda estou no aguardo de um podcast sobre segurança da informação, não um sobre \"história de hackers\" mas algo bem mais técnico como frameworks pra segurança das principais linguagens e seus pontos fortes e fracos, diferentes formas de autenticação como envio de JWT e autenticação de dois passos. Segurança de aplicações REST e mobile, criptografia de dados e senhas, melhor forma de armazenamento de credenciais e coisas do tipo. Casos reais de invasão onde seja apontada a falha explorada e como evitá-la. Simplesmente não há um podcast decente sobre isso em toda a internet brasileira. Meus pedidos de podcasts sobre JS e sua evolução, e inteligência artificial foram atendidos, espero que esse também."},{"author":"Lucas Palma Stabile","comment":"E eu espero algum sobre Testes, ou TDD, alguma experiência dos casters, dicas e talvez como implementar testes em sistemas grandes e totalmente acoplados, com regras de negócios e acesso a banco de dados tudo misturado."},{"author":"Augusto Santos","comment":"Um podcast mais técnico sobre testes seria muito bom mesmo."},{"author":"Paulo Silveira","comment":"o desejo de voces é uma ordem!"},{"author":"João Eduardo Dos Santos","comment":"Bom dia Paulo, muito bom o episódio, com base nele poderia fazer um podcast sobre patente, estou engajado no desenvolvimento em um aplicativo,  o desenvolvimento esta a passos curtos, pois  estudo no Alura e implemento no meu projeto, preciso de ajudar, mas é complicado expor uma ideia sem a segurança jurídica"},{"author":"Fabrício Cabral","comment":"Paulo SilveiraSe for fazer um podcast sobre Testes, não esqueça de chamar o Aniche, hein?"},{"author":"Paulo Silveira","comment":"nao foi esquecido :P"},{"author":"Douglas Z. Piva","comment":"Participei de uma startup, como dev sênior, junto com alguns estagiários, depois que a parte de tecnologia estava com bastante maturidade, os donos da startup simplesmente desapareceram e não me pagaram, então como dev complicado."},{"author":"Paulo Silveira","comment":"Queria ter conversado sobre esses casos terríveis também, não tive tempo. mas imagino que nesse caso não havia investimento correto?"},{"author":"Douglas Z. Piva","comment":"Na Verdade sim tinha investimento, mais meu trabalho era remoto não tive contato com o pessoal diretamente, mais no ultimo mes fico muito claro a jogada de manter só os estagiários , pois só recebia perguntas técnicas deles como nunca tinha feito, fico como aprendizado, bom agora to fora do Brasil, vamos ver como estão as startups por aqui"}]}