{"title":"Tecnologias na StackOverflow – Hipsters #46","releaseDate":"30/05/2017","tags":["agilidade","infra","infraestrutura","Podcast"],"people":["Paulo Silveira","Mauricio Linhares","Roberta Arcoverde"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=923%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D923&t_u=https%3A%2F%2Fhipsters.tech%2Ftecnologias-na-stackoverflow-hipsters-46%2F&t_e=Tecnologias%20na%20StackOverflow%20%E2%80%93%20Hipsters%20%2346&t_d=Tecnologias%20na%20StackOverflow%20-%20Hipsters%20%2346%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Tecnologias%20na%20StackOverflow%20%E2%80%93%20Hipsters%20%2346&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Helder Costa","comment":"Queria saber se ela já procurou e achou alguma dúvida quando tava desenvolvendo, no próprio stackeroverflow hehe"},{"author":"Roberta Arcoverde","comment":"Todo santo dia!"},{"author":"Danilo Vieira","comment":"Eu adoraria ver um Podcast sobre tecnologias na Alura."},{"author":"Rafael Becker","comment":"encontrei o post do Joel Spolsky onde ele cita a questão do desenvolvimento do Microsoft Word :Dhttps://www.joelonsoftware...."},{"author":"Bruno Paschoali","comment":"Boa! Muito bom esse post!"},{"author":"Vinicius Perroni","comment":"O episódio foi muito divertido, e assim como todos aqui também gosto do stackoverflow. MAS não podemos ter como exemplo as más praticas de programação aplicadas no projeto Stackoverflow. Essa forma go horse pode até funcionar para o domínio deles, que seria perguntas e respostas. Já em um domínio mais complexo não podemos abrir mão das melhores práticas tais como TDD, SOLID, DDD entre outras, caso contrario seremos eternos sobrinhos..."},{"author":"Roberta Arcoverde","comment":"A gente usa bastante SOLID :)"},{"author":"Michelly Sabatiny","comment":"Amei...bem esclarecer e simples ao mesmo tempo ouvir a Roberta !!"},{"author":"Nyo","comment":"que episodio foda !!!!!!"},{"author":"Alex Silva","comment":"Parabéns e muito obrigado por esse podcast. Me senti feliz ouvindo-o, porque esse é mais próximo da minha realidade do que os anteriores."},{"author":"Patric Pires","comment":"Gosto muito do stackoverflow mas sempre sou corrigido kkk, me perco as vezes mas ele me ajuda bastante."},{"author":"Salatiel Aizza","comment":"Excelente ep galera HipsterTech.Sou iniciante e foi muito esclarecedora a entrevista com a Roberta. Uma conversa muito fluida com todos os participantes. Adorei."},{"author":"Arthur","comment":"Pra quem quer baixar o BD do stackoverflow para brincar aqui está o link: https://archive.org/details...São mais de 45Gb :)"},{"author":"Mayck Xavier","comment":"Sensacional!A conversa foi muito boa.Roberta fala muito bem e sem medo. Deu pra imaginar as risadas do pessoal quando Roberta fala dos \"absurdos\" do Stack."},{"author":"Lucas Oliveira","comment":"Ótima conversa :)"},{"author":"Matheus Cunha","comment":"Sou assinante do podcast, desde os primórdios. Portanto, tenho muita tranquilidade em dizer que este episódio foi um dos melhores já produzidos pelo time. Era perceptível a sinergia entre os participantes. O que fez com que a conversa fluísse com naturalidade.Um destaque especial foi a convidada que conhecia muito tanto do desenvolvimento, quanto da operação,  bem como do negócio da empresa. É mais do que DevOps, considero um Man[ager]DevOps, será que existe um termo pra esse perfil!? A convidada estava muito à vontade para contar detalhes das soluções da empresa. O que tem sido uma postura rara até mesmo em grandes Podcasts gringos onde muitas vezes os convidados estão tão presos por cláusulas contratuais e segredos que é melhor nem aceitarem o convite para a conversa.Parabéns pelo show!"},{"author":"Paulo Silveira","comment":"muito legal ler isso Matheus. a conversa fluiu muito bem, acho que estava todo mundo bem alinhado e a roberta é realmente estelar."},{"author":"Roberta Arcoverde","comment":"Fico feliz que tenha gostado e que tenha sido útil e divertido! O mérito, entretanto, é dos anfitriões, que me deixaram muito à vontade, conduziram a conversa com maestria e conheciam já bastante da plataforma :) Paulo, estamos aí pra participar do Hipsters novamente sempre que quiser, sou fã!"},{"author":"Giorgio","comment":"Muito Show. Esperando um hipster.tech sobre a linguagem go(GOLang)"},{"author":"Bruno Paschoali","comment":"Se você estiver em SP, não sei se está sabendo, mas vai rolar um Meetup gratuito sobre Go sábado agora: https://www.meetup.com/pt-B..."},{"author":"Maurício Linhares","comment":"Vai ter em breve :D"},{"author":"Diego Augusto","comment":"Bacana demais esse podcast, participo do StackOverflow em Português já faz alguns anos a quantidade de conhecimento que adquiri com a galera é absurda, sem contar que da pra fazer vários colegas."},{"author":"Flaverton Rodrigues Rosa","comment":"Já que tem vários links, vai mais um sobre a stack deles com diagramas, por Nick Craver:https://nickcraver.com/blog..."},{"author":"Renato Aranda","comment":"Links das ferramentas comentadas no podcast:https://bosun.orghttps://github.com/opserver"},{"author":"Lucas Palma Stabile","comment":"Também tem o Dapper, que comentaram:https://github.com/StackExc..."},{"author":"Danilo Santos","comment":"Faltou colocar os links para as ferramentas opensource mencionadas pela Roberta. Uma delas foi a OpenServer (salvo engano).Fico no aguardo."},{"author":"Diogo Machado","comment":"Muito bom, gostei da sinceridade da Roberta e super curti a história por trás dos bastidores do site, quebrando vários tabus e modinhas, o site está ai, e é sucesso absoluto, e com muito qualidade.Já escrevi no meu blog sobre Stackoverflow vs Facebook para contribuir:https://www.diogomachado.co..."},{"author":"Vagner Santos de Araújo","comment":"Será que rola de ter os episódios no soundcloud?"},{"author":"Paulo Silveira","comment":"a gente estudou bastante, mas a galera da podosfera sempre indica problemas em usar soundcloud e youtube. tanto de dividir a audiencia quanto de ambos os meios terem recursos que nao se encaixam... foi dificil, mas acabamos decidindo ficar com um só lugar"},{"author":"Angelo V. Merlo","comment":"Muito bom, eu penso mais ou menos desse jeito, pra alguma aplicação pequena é muito chato e acho que é perder tempo ficar fazendo teste, ficar usando muita coisa pra fazer o básico. Sou programador PHP e confesso que senti uma vontade de aprender C# pra web depois desse podcast.Uma coisa que eu tenho curiosidade é: Em projetos como o próprio stack. de grande porte, os dados de usuários são criptografados (email, nome, etc)? Porque eu tenho uma leve suspeita que muitos não se preocupam com isso.Abraços"},{"author":"Kelvin Dules","comment":"É bom lembrar que o que foi comentado bem explicitamente pela Roberta Arcoverde  é que no caso do Stack *não há como* ser testado programaticamente por conta das queries em controllers e que *por sorte* a comunidade é muito ativa e se preocupa com a saúde da plataforma tanto quanto os desenvolvedores. Jamais devemos deixar de lado os testes quando possíveis!"},{"author":"Felippe","comment":"Excelente episódio! Roberta falou, com muita simpatia, que a simplicidade pode atender plenamente! Vou mandar este podcast para uns hipsters que conheço que adoram modinhas..."},{"author":"Bruno Paschoali","comment":"Pra quem ficou curioso sobre o histórico de versionamento deles:\n\n\nVisualizar\n\n\n Ocultar\n\n\n\n\n"},{"author":"Tulio Santos","comment":"Ótimo podcast, conheci esse sotaque de longe, é bom ter uma conterrânea neste nível, continuem assim vcs são meus companheiros no engarrafamento de Recife, informação em qualquer lugar. Abraço."},{"author":"Eduardo Paixão","comment":"A voz dessa mulher é muita boa."},{"author":"Bruno Paschoali","comment":"Pqp, podcast show de bola esse, hein?! Muito bacana. Um ponto muito interessante é mostrar que é muito importante entender as suas necessidades para definir o que será utilizado e não sair utilizando tudo que tá na moda, simplesmente por estar na moda. Ser inteligente e usar o mínimo possível para funcionar muito bem, economizando, logo gerando mais renda, sensacional.Sobre Dapper, eu utilizei no meu emprego anterior e realmente é uma mão na roda! Muito mais leve que esses ORMs robustos e muito mais prático que utilizar os Sql Data Access da vida. No meu emprego atual, utilizamos o modo nativo mesmo e eu, particularmente, acho horrível. Já sugeri Dapper várias vezes, mas a galera aqui é meio cabeça fechada. Eles preferem retornar aqueles objetos gigantescos pra utilizar uma propriedade, ou criar diversas views/procs pra cada entidade, para responder para vários retornos diferentes :(Obrigado pelo podcast![]'s."},{"author":"Leandro Laia","comment":"Trabalhei um pouco com Dapper numa manutenção pastel e não curti muito. Não sei se os caras implementaram errado."},{"author":"Bruno Paschoali","comment":"Você lembra o que, especificamente, você não curtiu? A implementação e utilização é tão simples, mas sei lá, vai de cada um..."},{"author":"Desv","comment":"Pois é, por ser uma ideia simples, Dapper é performático como se estivéssemos trabalhando puramente com ADO.NET e ao mesmo tempo produtivo de usar, feito por quem lida com cenários reais em produção. Os \"geniosos\" Hibernate e Entity Framework são complexos e pesados, muitas vezes por recursos desnecessários para atender o resultado do usuário. Mas enfim, vai de cada um mesmo."},{"author":"Bruno Paschoali","comment":"Pois é! Em muitos casos você quer fazer uma tarefa simples e esses ORMs como EF e Hibernate retornam muito mais do que você precisa."},{"author":"Tarcísio Z. Ferraz","comment":"Recomendo também a talk da Roberta com mais detalhes técnicos: https://www.infoq.com/br/pr..."},{"author":"Roberta Arcoverde","comment":"O post onde o Joel fala sobre reescrever software - e sobre como isso pode ser uma péssima ideia - é esse aqui: https://www.joelonsoftware.... De fato ele não menciona o Office especificamente, acho que essa menção deve ter sido feita em alguma palestra ou podcast dele. :) No mais, grata demais pelo convite pra participar desse podcast, me diverti bastante!"},{"author":"Paulo Silveira","comment":"foi muito bom roberta! e o feedback está sendo excelente.eu nao lembro onde ouvi que era o office, pode ter sido fabricacao da minha mente :)"},{"author":"Bruno Paschoali","comment":"Se foi fabricação, foi uma quase legítima! O MS Office é um bom exemplo de software em que os devs devem ter chegado a esse ponto. Basta olhar para as mudanças do MS Office 2003 para o 2007 rs..."},{"author":"Pablo Margreff","comment":"Fiquei fã da Roberta tbm, um dos melhores (se não o melhor ep). Quebraram alguns mitos de arquiteturais, mostrando os custos implicitos da abstração, além do bom humor durante toda a conversa, o que não deixou ela pesada. Plus: ótimos artigos de referência."},{"author":"Plinio Melo","comment":"O melhor são as tretas!Também fiquei fã da Roberta.Hipster.Tech cada dia melhor"},{"author":"Edy Silva","comment":"Não tem o link sobre a reescrita do Office"},{"author":"Leandro Laia","comment":"Fiquei fã da Roberta. Muito boa a entrevista.Faço pair programming com StackOverflow.Minha cabeça explodiu quando ela falou de ver o html da resposta do expert-exchange. Na época que eu batia a cabeça com Vb e Access, via que a ajuda podia estar nas respostas que eu não tinha acesso e lamentava. Tempos de iniciante."},{"author":"João Lucas dos Santos","comment":"Eu sou desenvolvedor full stack... full stackoverflow!Att,"},{"author":"Marcos","comment":"Go Horse Extreme Super Sayajin 4"},{"author":"Matheus Hernandes","comment":"Onde está o link sobre a tentativa de reescrever o Office?"},{"author":"Bruno Paschoali","comment":"Não sei se você chegou a ler depois, mas no comentário da Roberta acima ela diz que não encontrou em texto  essa referência que o Paulo fez e que, provavelmente, foi dita em alguma palestra ou podcast."},{"author":"Douglas Z. Piva","comment":"muito legal, ouvir ponto de vista diferente,excelente o pragmatismo, utilizar somente os elementos estritamente necessário para atingir a solução mais performática e simples"},{"author":"Kelvin Dules","comment":"Um dos meus eps favoritos! Bom trabalho pessoal :)edit.: Acabei de perceber que só comentei nos meus favoritos, então devo parecer um bot que chega aqui falando a mesma coisa sempre huhaueha"}]}