{"title":"Faculdades: Ciência da Computação e Sistemas de Informação – Hipsters #47","releaseDate":"06/06/2017","tags":["carreira","Podcast","programação"],"people":["Paulo Silveira","Mauricio Linhares","Carlos Eduardo Ferreira","Flavio Coutinho"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=930%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D930&t_u=https%3A%2F%2Fhipsters.tech%2Ffaculdades-ciencia-da-computacao-e-sistemas-de-informacao-hipsters-47%2F&t_e=Faculdades%3A%20Ci%C3%AAncia%20da%20Computa%C3%A7%C3%A3o%20e%20Sistemas%20de%20Informa%C3%A7%C3%A3o%20%E2%80%93%20Hipsters%20%2347&t_d=Faculdades%3A%20Ci%C3%AAncia%20da%20Computa%C3%A7%C3%A3o%20e%20Sistemas%20de%20Informa%C3%A7%C3%A3o%20-%20Hipsters%20%2347%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Faculdades%3A%20Ci%C3%AAncia%20da%20Computa%C3%A7%C3%A3o%20e%20Sistemas%20de%20Informa%C3%A7%C3%A3o%20%E2%80%93%20Hipsters%20%2347&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Edson Carli","comment":"Gostei do episódio, só uma coisa que achei incongruente, quando o convidado diz que não acha necessário confrontar alunos com humanas pra que eles façam coisas de humanas interligadas com Ti pois se houver interesse depois o aluno estuda por conta fazendo optativa, achei infeliz, até porque ele mesmo no 0:51 do vídeo ele comenta como é importante estar aberto para aprender coisas, até idiomas pois o aluno pode precisar depois, na profissão, pois com 30, 50 anos de trabalho pela frente ele nunca vai saber o que vai encontrar. Da mesma forma que o aluno ao ver estatística, não tem como saber que ele pode encaixar este estudo num problema lá na frente, o aluno ao ver disciplinas de humanas não tem como saber se ele não vai se interessar pelo tema antes de vê-lo, ou até se não pode encaixar em sua pesquisa como o exemplo dado no próprio episódio onde se uniu tecnologia  e moda/costura. Pra mim é como química, se você nunca ver na adolescência experimentos você não gosta pois parece um assunto chato, mas se você ver alguns vão gostar e se tornar pesquisadores na área."},{"author":"brenoma","comment":"Primeira linguagem foi ruby pra logica, depois c com estrutura, depois java com orientada"},{"author":"Fernando Liell","comment":"Fiz Ciências da Computação e achei o curso FODA, pena que na época havia e ainda falta oportunidades que não sejam apenas DEV."},{"author":"Tássio Lucas","comment":"Fale sobre Análise de Desenvolvimento de Sistemas!"},{"author":"Lucas Brogni","comment":"Seria  legal falar sobre técnólogos heheh :D"},{"author":"jallisson jallis oliveira band","comment":"faltou falar do povo de Analise e Desenvolvimento de Sistemas."},{"author":"Arkhanjo Adriell","comment":"So eu que tenho aquela sensação que Banco de Dados parece um Alien dentro da grade das faculdades?"},{"author":"Gabriel Tomio Nardes","comment":"Tenho a mesma sensação kkk"},{"author":"Paulo Silveira","comment":"bem pontuado!"},{"author":"Jéssica Zuchi","comment":"Soldado ferido por Estrutura de Dados aqui também hahaha"},{"author":"Robinho Gomes Junior","comment":"Poderia ter falado dos cursos de análise de sistemas, só tem galera boa hardcore. Eu aprendi estrutura com java -_- já tomando porrada.Vejo um monte de gente que faz ciência e sistemas e corre para infra."},{"author":"Alex Ferreira","comment":"Estrutura de dados com java é bem mais de boa. =P"},{"author":"Julio Cesar","comment":"mas estrutura de dados com java, se voce tiver uma certa afinidade nao eh tao dificil '-'Ha classes prontas que ajuda nessa parte \\o/Sofrer mesmo eh usar C kkkkk"},{"author":"Luis Zanella","comment":"Fiz com Java e fiz na \"unha\", professor não deixava usar as classes prontas não.. kkkk"},{"author":"Felipe Carli","comment":"É uma delicia sofrer com ponteiro no C... kkkkkkkkkkk"},{"author":"bergpb","comment":"Estudo computação em uma faculdade no ceará, e aprendi estrutura de dados com C, não foi como eu achava que fosse, mas serviu de base pra muita coisa que aprendi no decorrer desse tempo.Ainda irei passar pelas cadeiras de construção e análise de algoritmo (essa eu tô com medo), e ainda outras como compiladores, grafos, etc.Achei muito interessante a ideia de poder cursar uns semestres obrigatórios na disciplina e outros eletivos voltados para a área, pena que não temos essa metodologia aqui.Curti muito sobre as ideias repassadas sobre o exterior, e me senti aliviado ao saber que estou no curso certo, e irei continuar."},{"author":"Romulo Martins Da Silva","comment":"Que episodio bacana, fiquei surpreso, pensei que ia ser chato. hehe"},{"author":"Gabriel francelino","comment":"Faz um sobre ensino a distância, entrevista o Gustavo Guanabara"},{"author":"Emanuel Carvalho","comment":"Aquele mendigo digital"},{"author":"Pedro Pereira","comment":"Aff !!!  Faço os cursos do Guanabara e são os melhores q tem. Quem é vc pra julgar ele. Olha pro espelho garotinho."},{"author":"Gabriel francelino","comment":"Jura que vc não tem a capacidade de desenvolver um trabalho melhor e precisa criticar pra esconder a sua falta de capacidade?Está no caminho certo! Da vergonha e falta de humildade... Globo e vc tudo a ver \"plim plim...\""},{"author":"Fabio Victor","comment":"Ótimo episódio, lembrou muito meus professores contando sua histórias no primeiro dia de aula kkkk"},{"author":"Tiago Cabral","comment":"Melhor podcast, de longe!"},{"author":"ΠCHOK","comment":"Quais as diferenças entre o BCC no ICMC e no IME?"},{"author":"Bruno Orlandi","comment":"Recomendo você pesquisar nos sites dos institutos ICMC e IME, ambos terão disponível a grade curricular e você ler os tópicos que são ensinados. É interessante comparar também as disciplinas optativas de cada curso, e também caso for de interesse, quais áreas de pesquisa existem em cada instituto. No ICMC eu sei que tem, por exemplo, pesquisa em robótica, carros autônomos, processamento de imagens clínicas, drones, computação na educação, internet das coisas etc...Ambos os cursos estão na lista dos melhores cursos de computação do Brasil pela Guia do Estudante."},{"author":"heitorvrb","comment":"Seus malucos! Foram até 20 minutos de programa sem explicar o que é a \"POLI\"! Pra mim \"Poli\" é Policlínica. Fiquei imaginando o pessoal aprendendo a programar dentro do hospital.Ótimo episódio! Parabéns"},{"author":"Elton Souza","comment":"Excelente podcast, esse esquema de disciplinas eletivas deveria ter em todas as faculdades!!! Estou no terceiro ano de SI na FIAP, já passei pela matéria de estrutura de dados no segundo ano e não houve nem menção de Algorítimos recursivos e Árvores tive que estudar por fora isso, e olha que no conteúdo programático consta que aprendemos esse conteúdo."},{"author":"Cleiton Dantas","comment":"Ótimo episódio! Principalmente porque estou no primeiro ano de SI na EACH-USP, foi uma baita surpresa hahaha. Ainda não conheço o Coutinho, mas fico no aguardo ;)"},{"author":"Bruno Orlandi","comment":"Infelizmente não citaram sobre os cursos de computação do Instituto de Ciências Matemáticas e de Computação da USP de São Carlos. Me formei lá e as vezes as pessoas tem impressão que só existe computação na USP em São Paulo, no IME e na Poli, o que não é verdade. Tem ótimos cursos de computação no interior do estado, em uma cidade mais tranquila, na USP mesmo! Lá tem os cursos Ciências de Computação, com 100 vagas no vestibular, Engenharia de Computação e Sistemas de Informação, ao todo são 190 vagas do vestibular. Me formei em Computação lá e posso garantir que são excelentes cursos também."},{"author":"Jackson Souza","comment":"Bruno, acontece que o Carlos Eduardo Ferreira é professor do IME USP e ele citou apenas BCC no IME para atrair interessados a estudar lá e não no ICMC."},{"author":"Bruno Orlandi","comment":"Entendo q os professores são do IME e sabem dizer melhor sobre o instituto deles, mas podia citar q computação na USP não existe apenas no IME. Acredito que não tenha sido intencional não citarem o ICMC. Porque não faz sentido ele querer \"fazer propaganda\" apenas do IME e não do ICMC, a USP é única e não há concorrência. A carreira que o candidato seleciona na Fuvest para cursar BCC no IME e no ICMC é a mesma!"},{"author":"Carlos Ferreira","comment":"Sem dúvida foi uma falha minha. O curso de Computação do ICMC é um dos melhores do Brasil, com certeza. O programa de pós-graduação é excelente, e conta com pesquisadores de excelente qualidade. Como disse o Bruno, a carreira na Fuvest é a mesma, junto ainda com o SI da EACH, permitindo que o aluno coloque as duas opções. Ele estará muito bem se pegar qualquer uma delas."},{"author":"Bruno Orlandi","comment":"Legal Carlos, sim é a mesma carreira com SI da EACH também.Obrigado pela resposta.Abraços!"},{"author":"davidrobert","comment":"Excelente episódio!"},{"author":"Luciano Manoel","comment":"Me formei em SI na EACH em 2015,  não tive aula com o Coutinho, infelizmente, pois alguns colegas que  tiveram aula com ele falaram bem. Como ele disse, na disciplina de Métodos Quantitativos Aplicados à Administração de Empresas foi ensinado \"R\". Sobre a faculdade fazer diferença na vida como profissional eu acho que faz toda a diferença. Desenvolvo sistemas desde 2004 e só tinha curso técnico do antigo CEFET-SP, e posso dizer que na minha experiência existe um antes e depois da faculdade, a faculdade abriu minha mente e só a experiência de ter passado os anos lá dentro me fez entender e conseguir resolver certos problemas, é uma experiência que não \"compra\" tão fácil."},{"author":"Cleiton Dantas","comment":"Sou calouro de SI na EACH haha e fiz curso técnico junto com o médio. A visão com que saí do curso com certeza era suficiente para eu começar a trabalhar, mas só nesse primeiro semestre já estou sentindo a diferença do que é um bacharelado, um aprofundamento bem mais interessante do que simplesmente aprender a fazer."},{"author":"Maurício Linhares","comment":"Lembrando que eu sou graduado em Sistemas pra Internet, sou tecnólogo :D"},{"author":"Flavio Castro","comment":"Melhor curso, estou fazendo, depois de sair de Engenharia da Computação e estou gostando muito, a meta agora é fazer uma especialização em Arquitetura e Engenharia de Software e MBA em gestão de projetos em Tecnologia."},{"author":"Kelvin Dules","comment":"Não sabia que tecnólogo era do seu tempo... HEHE"},{"author":"everton","comment":"Sem dúvida o melhor episódio da série, tive que entrar no site pra comentar isso, dava pra fazer mais entrevistas com nossos doutores pelo Brasil a fora. Parabéns "},{"author":"Me","comment":"Gostaria de adicionar a conversa o curso que faço, Sistemas e Mídias Digitais na Federal do Ceará - http://smd.virtual.ufc.br/ . Sua proposta é juntar a galera do \"design\" com a galera da programação e formar uma galera que saiba um pouco de cada um. Tem galera de audiovisual, design (interação, gráfico, interface, motion, instrucional), modeladores e animadores 3D, programadores, de front, back, mobile, ilustrador... De tudo um pouco."},{"author":"Paulo Silveira","comment":"oi pessoal! Realmente queria ter abordado os cursos de tecnólogo, que eu em particular acho os mais balanceados de todos para o nosso mercado atual, mas acabou ficando muito grande e tenho tentado ficar sempre \"só\"  com 4 participantes. mas teremos sim futuramente um dedicado :)"},{"author":"Igor Paiva","comment":"Eu fiquei triste porque esperando falar dos cursos superior de tecnologia e o tema nem foi abordado. Eu sou formado em Tecnólogo em Sistemas para Internet é nível superior apesar de muita gente achar que não é, porem é um curso mais curto na minha época eram 5 semestres hoje já são 6."},{"author":"Matheus Almeida","comment":"Vou repetir a pergunta do colega abaixo: Esses cursos são aceitos em países que exigem formação superior para a liberação do visto para trabalho?"},{"author":"igorsantos07","comment":"Fez falta mesmo! Achei 9 episódio excelente mas um bocado enviesado em favor dos cursos \"teóricos\". Fiz SI numa \"faculdade de mercado\" e ao mesmo tempo que foi interessante saber sobre o funcionamento dos outros cursos, me senti meio excluído/discriminado :(Há também outras opções de pós além das clássicas. Senti falta dessas coisas. "},{"author":"Kelvin Dules","comment":"Não achei que fosse ter tanta gente que cursa ou cursou ADS aqui... Que massa!"},{"author":"Renan Duarte","comment":"Aaaaa bacana, tbm senti falta de ter falado do curso de ADS, que eu creio ser um curso beem especifico pra desenvolvimento, no meu eu vi disciplinas desde eng. de software a gerenciamento de projetos (inclusive portugês rsrsrs pode acreditar) é um curso muuuito bom, devia ter seu espaço, fico na espera ;)"},{"author":"Lucas Palma Stabile","comment":"Opa, no aguardo do podcast da minha formação então!Depois de me formar e ingressar no mercado, senti mesmo que o curso prepara mais para sair e trabalhar na área mesmo. Uma das diferenças que vi do meu curso (ADS) em relação aos citados no podcast são as matérias de matemática, cálculo e compiladores, não tive essas matérias, apenas tive sobre estatística. O professor chegou até a ilustrar como a matemática é importante para algoritmos, com um exemplo de como seria implementar uma função para rotacionar uma imagem 2D, baseada em matriz."},{"author":"Fernando Boaglio","comment":"Adorei o comentário das estrelinhas kkk ,eu lembro nas madrugadas que passei que o pessoal da faculdade tentava fazer o trabalho em C e era comum escutar: \" coloca uma estrelinha... vê se funciona agora... tenta tirar então \"  kkk.  Muita coisa que estudei e nunca usei , de acordo com um dos coordenadores do curso, seria muito útil se eu tivesse feito mestrado em Teoria da Computação."},{"author":"Augusto Santos","comment":"Foi um bom podcast, parabéns a todos os envolvidos. Porém, como já foi dito em alguns comentários abaixo, faltou falar de cursos Tecnólogos. Uma dúvida que com toda certeza deve estar na cabeça de muita gente é se esses cursos são aceitos em países que exigem formação superior para a liberação do visto para trabalho. Pra mim essa informação não poderia ter faltado nesse podcast."},{"author":"Inaldo Brandão","comment":"Muito bom como sempre, vi no comentário de um colega, mas acho que vale frisar mais uma vez a falta de comentários sobre cursos Tecnólogos como Análise e Desenvolvimento de Sistemas. Fiz esse curso, já trabalhei em algumas empresas, pelo menos aqui no Ceará é muito comum grandes profissionais formados no curso de ADS. Claro, como é um curso mais curto, é muito mais focado na prática do desenvolvimento de sistemas, principalmente POO com Java, mas valeu o PodCast, abraço !"},{"author":"Caio Filipe de Moraes Rodrigue","comment":"Excelente podcast como sempre! Bom, vou aproveitar pra falar um pouco sobre o assunto também, eu ainda estou cursando a faculdade (Ciência da Computação), estou no 7º período na PUC-GO.Achei muito interessante a forma que a grade curricular é feita na USP, dando liberdade para você estudar mais a área que você possui mais interesse. Infelizmente aqui na PUC temos apenas 2 matérias optativas ao longo dos 5 anos de curso, e essas optativas nem sempre são interessantes.Sobre as matérias \"off-topic\", eu gostei muito de ter tido elas nos primeiros períodos, pois hoje eu sou programador, porém eu não quero ser programador durante toda a minha carreira, então eu sei que tenho portas em outras áreas matemáticas e computacionais, sabendo que eu gosto também dessa área. As vezes o problema dessas matérias acontece por não serem ministradas ou gerenciadas pelo mesmo departamento do seu curso, se tivéssemos mais professores da computação ministrando ou gerenciando essas outras disciplinas, acredito que teríamos mais \"aprovações\" dos alunos de forma geral.Estrutura de dados é o divisor do curso na minha opinião, é ali que você sai dos status de calouro haha. Ao entender como muita coisa funciona, você acaba tendo mais vontade de entender como as outras coisas funcionam. Um exemplo muito bom disso é o pipeline (que não tem nada a ver com ED), pois por causa dele, algoritmos praticamente iguais - que para um calouro deveriam executar com um tempo bem parecido - tem tempos bem diferentes. E então, quando você entende ele, você sempre se lembra de como o seu código pode ser influenciado pelo pipeline.Enfim, para quem ainda está em dúvida sobre o curso, tente não ser pego de surpresa como eu fui haha, entenda que o curso não é sobre computadores e sim sobre computação, o computador é apenas uma ferramenta que utilizamos e por consequência temos que entender minuciosamente essa ferramenta. Você vai aprender muito mais de como a ferramenta computador funciona do que propriamente utiliza-la. Um professor, lá no primeiro período nos fez a seguinte pergunta: \"Por que vocês escolheram o curso de Ciência da Computação?\", muita gente respondeu \"Porque eu gosto muito de computador\" e então ele fez a seguinte analogia: \"Muita gente gosta muito de comer, porém poucas gostam de cozinhar\" Ribeiro, Alexandre.TL;DROFF: Alguém do Hipster vai palestrar na Campus de BSB?"},{"author":"Gabs Ferreira","comment":"Bem, eu não fiz faculdade e posso dizer que apesar de hoje eu estar bem, em alguns momentos fez falta sim. Principalmente na hora de fazer entrevista em algumas empresas, que tinham como pré-requisito ser formado ou estar estudando."},{"author":"Helton Souza Silveira","comment":"O melhor episódio de todos! Tinha que ter outro sobre pós-graduação auxiliar a como escolher uma, vejo que a galera já sai da graduação pensando em pós, mas não tem algo em mente do que realmente quer fazer, já se matrícula na primeira que aparece correndo risco de ter seu tempo e investimento empregados de forma inadequada."},{"author":"Welton Vaz de Souza","comment":"Excelente episódio, escutei duas vezes e gostei muito!"},{"author":"Kelvin Dules","comment":"Bom episódio! Infelizmente não rolou falar sobre cursos da modalidade Tecnólogo (Análise e Desenvolvimento de Sistemas) e/ou EAD, seria bastante interessante ter uma opinião de vocês sobre esse tipo de formação e quão relevantes são elas. Não sei se Linhares vai ler, mas também seria legal saber como o EAD é visto lá fora :)"},{"author":"Jorge William Cardoso Furtado","comment":"Episódio Interessantíssimo!!!! Linhares Jornalista?!?!?!?! Que \"doidera\".... Mano \"Balboa\" de onde vem o gosto pela culinária????"}]}