{"title":"Elixir, a linguagem hipster – Hipsters #48","releaseDate":"13/06/2017","tags":["Podcast","programação"],"people":["Paulo Silveira","Mauricio Linhares","José Valim","Lucas Mazza"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=939%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D939&t_u=https%3A%2F%2Fhipsters.tech%2Felixir-a-linguagem-hipster-hipsters-48%2F&t_e=Elixir%2C%20a%20linguagem%20hipster%20%E2%80%93%20Hipsters%20%2348&t_d=Elixir%2C%20a%20linguagem%20hipster%20-%20Hipsters%20%2348%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Elixir%2C%20a%20linguagem%20hipster%20%E2%80%93%20Hipsters%20%2348&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Mila Gonçalves","comment":"para você que ainda está esperando um episodio ruby on rails kkkk gostei do podcast!!!"},{"author":"Jaumzera","comment":"Preciso acrescentar que o Paulo sempre faz ponderações legais; trazendo o \"subject context\" para a tangência dos \"serumanos\" normais."},{"author":"Jaumzera","comment":"Muito bom.To começando a entender o que o Linus quer dizer com \"idiot object model\"."},{"author":"Vinicius Perroni","comment":"A pergunta que não quer calar...Quando teremos um curso de Elixir no Alura?"},{"author":"Marcio de Faria","comment":"Seria bom lembrar que o Dave Thomas é um grande evangelizador do Elixir, assim como foi do Ruby e também em certa medida do Erlang."},{"author":"Marcio de Faria","comment":"Uma outra coisa que diferencia o modelo de concorrência do Erlang é o tipo de Scheduler de Processos, que é Preemptivo, baseado em um esquema de reduções (instruções que são executadas por processo), que permite latencia previsível, além do garbage collector por processo, evitando o famoso Stop the World Garbage Collector.https://tkowal.wordpress.co..."},{"author":"Marcio de Faria","comment":"Citado pelo Valim, o case da Bleacher Report.http://www.techworld.com/ap...PS: Elixir é fantástico, eu sempre tentava programar Ruby com idiomas funcionais, sonhava com Elixir :-)"},{"author":"Mila Gonçalves","comment":"\\o/"},{"author":"Paulo Sales","comment":"Orgulho para todos nós Valim e todos da hipsters.tech, sem palavras!Só uma questão, e quanto ao mercado de trabalho, como está a demanda para Elixir?"},{"author":"Gabriel Ariza","comment":"Só quero dizer que hipsters.tech não é só mais um podcast, hoje é tão essencial quanto o stackoverflow.com. Muito bom galera assuntos atuais e bem técnicos. Vlw"},{"author":"Mila Gonçalves","comment":"nossa primeira vez que eu ouço e achei bem legal :)"},{"author":"Renato Fh","comment":"Que termo é este Rock Science que o Linhares tanto mencionou neste episódio?"},{"author":"Maurício Linhares","comment":"É, \"rocket science\" é quando uma coisa é muito fora da realidade, no geral a maior parte das coisas que a gente usa no dia a dia não é \"rocket science\" :D"},{"author":"Lucas Palma Stabile","comment":"Acho que é relacionado a dificuldade em alguma atividade, quase como a expressão \"Bicho de 7 cabeças\". Como no episódio comentaram sobre concorrência, estados dos agentes e outras particularidades de programação funcional, esses termos podem parecer mesmo \"Rocket Science\", principalmente para pessoas como eu que programam em .Net, em que várias coisas já estão prontas pela biblioteca e não tenho que me preocupar em com isso. Acho que o termo deve ter surgido lá na 2ª Guerra e guerra fria, onde estavam numa corrida espacial e armamentista, e a tecnologia de foguetes era importantíssima."},{"author":"rodgarcialima","comment":"Parabéns pelo podcast. Fantástico."},{"author":"Rafael dos Anjos","comment":"Caraca estou esperando este episódio a muito tempo, ouvindo já...."},{"author":"Fernando Boaglio","comment":"Muito bom saber as origens do Elixir, agora vocês precisam chamar o Professor Roberto Ierusalimschy para falar a sua história da linguagem de script Lua..."},{"author":"Samuel Silva","comment":"Verdade! A linguagem Lua foi criados por professores do UFRJ e hoje é usada bastante, principalmente para desenvolvimento de jogos"},{"author":"Roberto Ierusalimschy","comment":"Correção: Professores da PUC-Rio!"},{"author":"Marcio de Faria","comment":"Saúdo o professor Roberto pelo excelente trabalho em Lua. Aproveito para lembrar que existe implementação de Lua para a VM do Erlang:https://github.com/rvirding..."},{"author":"Alex Bispo","comment":"Muito bom! Gostaria de sugerir um episódio sobre Scala, quero muito ouvir a opinião de vocês sobre esta linguagem."},{"author":"Maurício Linhares","comment":"teve um grok sobre scala uns anos atrás http://www.grokpodcast.com/..."},{"author":"Igor Vieira","comment":"A primeira vez que ouvi sobre Elixir foi em uma entrevista do José Valim no Grok,  assim como Erlang, saudades Grok rsrs"},{"author":"Lucas Tsunami","comment":"Muito bom ^^Sempre quis entender o porquê de usar uma linguagem funcional ou imutável na prática e tal, e esclareceu bastante as dúvidas ^^Trabalho com Vbscript (ASP Clássico em pleno 2017) e é triste o \"On Error Resume Next\" viu aeaheuhauea"},{"author":"Marcos","comment":"Somos dois cara kkk. O pior de tudo é que eu já tive que dar manutenção em um sistema que tinha \"On Error Resume Next\" em um include, para piorar, ele era chamado em todas as páginas."},{"author":"Lucas Tsunami","comment":"Até vi uma implementação de try catch invocando scripts em C com o setjmp e longjmp mas não tive coragem de usar algo assim :O goto é mato rs"},{"author":"Luiz Costa","comment":"Parabéns por mais um podcast muito bom! Sempre acompanho e recomendo ao amigos!"},{"author":"Tiago Davi","comment":"Parabéns pelo podcast. Acho que explica muita coisa e o principal problema que Elixir pode resolver."},{"author":"Bruce Alexsander","comment":"Ótimo conteúdo como sempre, estão de parabéns. E algo que eu gostaria de ouvir vc's falando é sobre o Entity Framework, quem sabe ae nas proximas eim :D kkk"},{"author":"Lucas Palma Stabile","comment":"ORM's no geral seria uma boa!"},{"author":"David Allan","comment":"Muito Bom!Tem tambem duas entrvistas com Jose Valim no The Changelog: https://changelog.com/podca..."},{"author":"Igor Vieira","comment":"Muito bom o episódio, espero que mais pra frente possamos ter mesmo o episódio sobre Ruby, e se possível contar com o pessoal que fez o movimento de Ruby crescer no país, principalmente o Rodrigo Franco (Caffo) e o Fabio Akita."},{"author":"Tarcísio Z. Ferraz","comment":"Tem um sobre ruby com o akita no dev na estrada:http://devnaestrada.com.br/...E também a entrevista do akita:http://devnaestrada.com.br/..."},{"author":"Igor Vieira","comment":"Ahh eu ouvi ambos, mas eu nunca vi uma entrevista com o Caffo e o Akita juntos, o Caffo é quem trouxe de fato, porém o Akita evangelizou pelo Brasil, então acho que uma entrevista com os dois seria da hora! =]"},{"author":"Fanime Fartoon","comment":"Finalmente :)Conferindo :vEdit: faltou treta :(mas bacana, seria legal um de Lua tbm :v"},{"author":"Augusto Santos","comment":"Teve uma bem leve no comecinho quando foi apontado um \"problema\" do Ruby haha.Uma de Lua realmente seria ótimo"}]}