{"title":"MVP: Produto Mínimo Viável – Hipsters #49","releaseDate":"20/06/2017","tags":["Podcast","startup"],"people":["Paulo Silveira","Pedro Axelrud","Gabriela Rojas","Marcell Almeida"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=948%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D948&t_u=https%3A%2F%2Fhipsters.tech%2Fmvp-produto-minimo-viavel-hipsters-49%2F&t_e=MVP%3A%20Produto%20M%C3%ADnimo%20Vi%C3%A1vel%20%E2%80%93%20Hipsters%20%2349&t_d=MVP%3A%20Produto%20M%C3%ADnimo%20Vi%C3%A1vel%20-%20Hipsters%20%2349%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=MVP%3A%20Produto%20M%C3%ADnimo%20Vi%C3%A1vel%20%E2%80%93%20Hipsters%20%2349&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Rafael Felipe","comment":"Excelente podcast. Faz uns dois anos que tenho um aplicativo android publicado, uma agenda para estudantes universitários, minha ideia era que com o tempo ele pudesse se tornar algo parecido com o Evernote, porém voltado para universitários. Na época eu não tinha muito conhecimento em MVP, até porque o app foi feito como meu portfólio de entrada no mercado de TI. Cometi o pior erro, entubei no app todas as funcionalidades possíveis que até então eu tinha na cabeça, hoje o app tem quase 4.000 downloads e crescendo, agora não consigo dar a manutenção necessária devido a quantidade de coisas que coloquei nele. Vou refaze-lo usando Kotlin e agora vou aplicar o MVP da maneira correta.Gostei da citação: \"O mínimo para atingir o objetivo\""},{"author":"Everton Alves","comment":"Excelente podcast, de grande utilidade!"},{"author":"Mateus Alcova","comment":"Muito bom o episódio! Me graduei recentemente e como projeto de TCC, acabei fazendo um site de doação de livros ( http://livrosemapego.com.br/ ) junto com um amigo. Cortamos muitas funcionalidades do site e focamos em entregar a ideia principal, faz nem 2 semanas que está no ar e já conseguimos pegar muitos feedbacks da galera e através disso, já melhoramos muitas coisas. Mesmo não sabendo muito sobre o termo MVP, acabamos entregando isso e atualmente está dando certo rsrs"},{"author":"Leandro Curioso","comment":"Desenvolvi um app chamado Nerd Spell conhecido como \"Tinder dos Nerds\" no momento ele está off pois estamos importando os dados para a nova versão que sai essa semana. Já tivemos um MVP e agora vamos subir a nova versão que melhoramos pelo conhecimento adquirido bem como feedback dos usuários.Excelente programa as vezes nós que estamos nessa de start-ups precisamos ouvir essas coisas para se manter no foco."},{"author":"Rafael","comment":"Fiz um app Android que é uma \"calculadora falante em 4 linguas\" (inglês, francês, alemão e italiano).Contexto: atualmente está com apenas 4/30 instalacoes (4 ativas e 30 no total).Foi lançado há 8 meses e teve zero de investimento em propaganda.Será que a idéia já nasceu morta ou falta investimento em propaganda?Quem quiser conferir:https://play.google.com/sto..."},{"author":"Paulo Silveira","comment":"Dificil dizer Rafael. Mas eu acredito muito na necessidade de market fit. Há a necessidade para tal produto? O mercado aceitaria tal produto? Não é facil responder. Dizem que  é mais facil ter sucesso com um produto ruim de alto market fit do que o contrário."},{"author":"Rafael","comment":"Quer fazer o usuário sair do seu site rapidinho? Coloque tela de login logo de cara.... experimentei alguns dos MVPs aqui e vários não mostram logo do que se trata, ao invés disso pedem um cadastro/login. #fikaDika"},{"author":"Mateus Queiroz Correia","comment":"http://cartola.footballcomp...Quero melhorar como clubes de futebol formam, contratam e desenvolvem seus atletas. No futebol as vitórias escondem erros e pontos de melhoria. Derrotas jogam fora todos acertos.Pior é o atleta que comete uma falha crucial e pode ser queimado em um clube e, depois, se tiver sorte e competência pode brilhar em outro time - talvez nem dando o retorno para o clube que o revelou...Como a ideia é grande, envolve Inteligência Artificial e muito mais coisa, por enquanto, o Hobby é brincar no cartola do Brasileirão. :)"},{"author":"Zeu Cxb","comment":"http://scanbu.comTenho trabalhado no Scanbü a um tempo e o meu maior problema era alcançar os usuários que hoje usam grupos de compra e venda no facebook por isso a ideia inicial foi fazer um buscador, para assim conseguir o cadastro desse publico. A ideia agora é continuar no mvp, melhorando aos poucos o produto, ensinando ao usuário como usar a plataforma.P.S: Não dava para concorrer com OLX e Mercado Livre"},{"author":"Rafael Acioly","comment":"Muito legal, me abriu bastante a cabeça, eu estava super preocupado com design do meu App, que teria que ser perfeito e etc mas agora entendi o que meu potencial cliente realmente quer e como posso fazer para disponibiliza-lo mais rapidamente."},{"author":"Rafael Rocha","comment":"http://psipsi.com.br"},{"author":"Rafael","comment":"Gostei da idéia!"},{"author":"Rafael Rocha","comment":"Obrigado. :)"},{"author":"Paulo Nasciemento","comment":"Estou começando a considerar a ideia do Paulo Silveira de que borda redonda no MVP é só pra dar dor de cabeça no desenvolvimento. HahahaParabéns pelo podcast, estão fazendo um ótimo trabalho."},{"author":"Silvio Pereira","comment":"Eu acho muito válido o conceito do \"minimum lovable product\", principalmente num momento em que todos estão tentando lançar o produto da década, é complicado lançar algo que não atinja os padrões mínimos, que aumentam a cada dia. O importante é saber balancear. Ao meu ver, é melhor lançar menos funcionalidades mas já com cara de produto final do que um produto muito completo todo quadrado!"},{"author":"Emanuel Carvalho","comment":"O maior exemplo de MVP quem me vem a cabeça agora é os cursos do Alura. A impressão que tenho é que todos eles são produzidos às pressas, com vídeos mal editados e conteúdo básico."},{"author":"Rodrigo Macedo","comment":"Discordo. Pra mim, sem dúvidas, Alura é o melhor portal de educação online para TI no Brasil, e ainda lançam novos cursos toda semana. Eu assinei esse ano e estou muito contente."},{"author":"Paulo Silveira","comment":"oi Emanuel. Como um dos responsáveis pelos cursos fico querendo saber mais. Nao achei seu cadastro no sistema pelo nome Emanuel Raul, queria te mandar um email também. Voce me manda com mais comentários? paulo.silveira@alura.com.br. E se não estiver aproveitando podemos estonrar seu pagamento."},{"author":"Gabriel Vieira de Jesus","comment":"Paulo os cursos da Alura são de boa qualidade"},{"author":"Rafael Rocha","comment":"Quem sabe faz ao vivo"},{"author":"Lucas Palma Stabile","comment":"Muito boa a parte em que vocês discutem ainda mais sobre a simplificação ou não nos programas em que desenvolvemos. Trabalhei apenas em empresas que ofereciam suas soluções na web para outras empresas, como por exemplo uma aplicação web para a empresas controlarem e gerenciarem o acesso das pessoas em suas empresas. Não sei se é algo intrínseco de programas B2B ou foi algo da minha experiência apenas e posso estar generalizando, mas ao desenvolver e dar manutenção nesse tipo de projeto eu acabei criando um mindset de simplificação. Como a empresa vive de assinar contratos com os clientes, as requisições de features aparecem de monte, e se um grande cliente exigir uma feature, mesmo que a primeira vista não agregue muito valor ao negócio pelo tempo da atividade, a empresa sempre escolhia por implementá-la, mesmo que fosse algo que apenas um cliente precisava. Houve várias vezes que uma feature era dada como prioritária e eu não sentia que ela não agregava muito valor, ou que deixava a manutenção e entendimento do código bem piores. Essa diferença de desenvolver B2B e B2C existe ou é só uma impressão minha, dada minha pouca experiência na outra área?"},{"author":"Ulisses Pereira da Silva","comment":"Paulo, excelente! Acabei de sair de uma reunião com os meus sócios, e o assunto foi exatamente este. Estamos com uma startup e tenho certeza que este podcast vai ajudar em nossas decisões! Forte abraço"},{"author":"Paulo Silveira","comment":"lembra que sempre tem os dois lados. difícil dizer o que é mínimo!"},{"author":"Ulisses Pereira da Silva","comment":"Sim, é verdade. Dependendo do tipo de produto, pode ser mais fácil ou mais difícil de saber.  Este é o desafio! :)"},{"author":"Inaldo Brandão","comment":"Fantástico, a pouco tempo iniciei um projeto com um amigo, e tivemos justamente essas discussões, o que implementar para o MVP. De primeira pensamos algumas coisas, acabou que no andar da carruajem, enxugamos ainda mais o MVP de features para adiantar o lançamento, e acreditamos que estamos entregando um valor compatível com o nosso objetivo. Muito massa, parabéns galera !"},{"author":"Priscila Stuani","comment":"Muito bom,Já trabalhei com formatação de franquias e novos negócios e nossa... Se usássemos o MVP teriamos economizado muitos recursos já que o cliente contratava um projeto fechado e nós tínhamos que entregar algo do zero, sem saber como o mercado e as pessoas reagiriam e era bem complicado... Via muito dinheiro sendo jogado fora. Uma pena não ter conhecido o MVP antes :("},{"author":"Vitor Leonel","comment":"Estou testando a ideia de um pequeno portal para desenvolvedores front-end onde a ideia é centralizar os conteúdos, como: novidades, dúvidas, vagas de emprego, etc..Coloquei online ontem. Segue:www.treinarfrontend.com"},{"author":"Junior Santos","comment":"Acabei de desistir da minha to-do list :9"},{"author":"Paulo Silveira","comment":"hahahah. quem nunca?"},{"author":"Bruno Oliveira de Alcântara","comment":"Ótimo episódio. Acompanhando todos desde o início."},{"author":"Tiago MAChado ","comment":"Por favor, façam um episódio sobre CI (continuous integration) um dos temas mais importantes hoje em dia no mundo da programação"},{"author":"Pablo Margreff","comment":"alugaqui.herokuapp.com"}]}