{"title":"Startups, fitness e o dilema do inovador – Hipsters #50","releaseDate":"27/06/2017","tags":["Podcast","startup"],"people":["Paulo Silveira","Mauricio Linhares","Rodrigo Dantas","Jimmy Peixoto"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=963%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D963&t_u=https%3A%2F%2Fhipsters.tech%2Fstartups-fitness-e-o-dilema-do-inovador-hipsters-50%2F&t_e=Startups%2C%20fitness%20e%20o%20dilema%20do%20inovador%20%E2%80%93%20Hipsters%20%2350&t_d=Startups%2C%20fitness%20e%20o%20dilema%20do%20inovador%20-%20Hipsters%20%2350%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=Startups%2C%20fitness%20e%20o%20dilema%20do%20inovador%20%E2%80%93%20Hipsters%20%2350&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Gabriel francelino","comment":"Vcs não mataram as academias de bairro, vcs criaram tendencia e como discutido hoje na academia do bairro eu não preciso mais dar cheques para ter um plano, alem disso graças a vcs temos outros horários para treinar em academias de bairro também graças a vcs."},{"author":"Renato Dinhani","comment":"Vi que alguns comentaram aqui que não teve muito de tecnologia, mas eu gostei bastante porque tenho interesse nessa parte de empreendedorismo e de como as empresas funcionam. É cada vez mais claro pra mim que empresas de outras áreas que adotam a tecnologia na linha de frente de seus negócios estão tendo uma grande vantagem sobre a concorrência.Esse episódio também me inspirou a escrever um pouco sobre como a tecnologia e os exercícios andam lado-a-lado na minha vida.Se alguém tiver interesse em ler, segue o link:https://medium.com/@dinhani..."},{"author":"Matheus Bizutti","comment":"Muito bom falar sobre negócios e ver uma visão diferenciada com foco no cliente.Vejo isso na Alura, 1 mês antes de encerrar meu acesso anual, já entraram em contato para renovar e foram super atenciosos."},{"author":"Rafael Bezerra","comment":"Legal falar sobre o negócio, mas gosto do canal por abordar sobre tecnologia. O papo foi bem legal, mas achei um pouco de \"puxação de saco\" para os convidados."},{"author":"Rodrigo","comment":"\"O podcast de propaganda e outras modinhas\""},{"author":"Paulo Silveira","comment":"só um disclaimer: fiz o episodio porque gosto do caso. alias, gosto nao, acho incrível. sobre a academia ser boa ou nao, isso nem sei dizer, pois não sou cliente. todo episodio que for patrocinado nós deixamos claro que foi a empresa que trouxe. só tivemos um até hoje, que foi o paypal."},{"author":"Bruno Paschoali","comment":"Também prefiro quando aborda mais de tecnologia, mas a Alura é muito engajada com empreendedorismo e startups, sem contar que tem trilha de business nos cursos. Enfim, acho que tá valendo."},{"author":"Rafael Bezerra","comment":"Ta valendo sim, todo conteúdo é bem vindo ^^, mas pode ser um pouco cansativo escutar falar somente da empresa por 1h, e principalmente como tudo funciona perfeitamente lá. Senti falta de escutar sobre as dificuldades que tiveram, como foi o início, como eles lidam com algumas reclamações dos usuários, isso também ensina bastante."},{"author":"Bruno Paschoali","comment":"É, concordo. O Jimmy meio que deixou que o problema de espaço não existe muito, o que é total mentira. As SmartFits são abarrotadas. Na real, se alguém quiser treinar musculação e só tem horários de picos pra treinar, tipo entre 17h-20h, eu nem aconselho. É impossível, seu treino não rende nem a pau, é muita gente pra revezar. Se for pra fazer aeróbico talvez dê. Ou então que tenha outro horário disponível..."},{"author":"Rafael Bezerra","comment":"Isso mesmo, eu não frequento a academia, mas esses problemas são conhecidos. Também não gostei do exemplo do morador de rua."},{"author":"Bruno Almeida","comment":"Bem legal o podcast. Realmente a SmartFit consegue proporcionar uma infraestrutura de alta qualidade de forma acessível. Apesar do app trazer treinos e dietas pré estabelecidas para servir como guia para o aluno, essas duas coisas DEVEM ser individualizada e não genérica da forma que é. Pois banaliza o trabalho dos profissionais de  Ed. Física e Nutrição."},{"author":"Bruno Paschoali","comment":"Concordo que individualizar é sempre melhor, mas no modelo deles, com o preço que cobram e número de instrutores, não sei se seria bem possível isso. Acho que aí é mais a cara da Bioritmo."},{"author":"Bruno Almeida","comment":"O problema é usar de tecnologia para vender esse \"falso\" beneficio de uma coisa que tem que ser individualizada pois cada um é diferente."},{"author":"Bruno Paschoali","comment":"Mas você acha que a propaganda deles passa essa de ter tratamento individualizado? Sei lá, desde que conheci a SmartFit, nunca tive essa impressão. Muito pelo contrário, quando assinei plano deles, já assinei sabendo que lá poderia ser tudo, menos individualizado.Por outro lado, mesmo sabendo disso, não é o cenário que prefiro. Se eu pudesse escolher, preferia uma atenção mais firme por parte dos instrutores. Lá é assim, se você não for atrás e pedir, a impressão é que, mesmo que você esteja fazendo movimentos errados, o instrutor nem vai dizer nada. Sem contar que as academias são bem lotadas, com exceção de horários que quase ninguém está disponível pra treinar rs."},{"author":"Bruno Almeida","comment":"Concordo com você, eu treino na SmartFit. O que me refiro é ao app que oferece essas funções de \"personal trainning\" e \"nutricionista\"  de forma generalizada. Seguindo quase que o mesmo conceito das revistas de fitness que \"vendem treinos e dietas\"."},{"author":"Lucas Palma Stabile","comment":"O Lançamento da SmartFit realmente poderia tirar os clientes que já existiam na outra academia? Pelo que entendi deste podcast, a Bioritmo tem uma base para clientes com maior poder aquisitivo e a ideia da SmartFit é popularizar o acesso a academia para mais pessoas."},{"author":"Paulo Silveira","comment":"É uma boa pergunta Lucas. Mesmo que a intersecção fosse minúscula, o que o livro do Innovators Dillema diz é que grandes empresas tem medo dessa passo, pois não estão dispostas a ceder 1cm do proprio mercado, nem \"pra elas mesmas\"."},{"author":"Bruno Paschoali","comment":"Poderia tirar alguns sim, mas são públicos diferentes. O cara que saio da Bioritmo pra ir pra SmartFit é um cara que não se importa de treinar sem um acompanhamento direto de personal, que está disposta a enfrentar academia mais cheia e/ou que quer pagar menos."},{"author":"Juliano Soares","comment":"O Paulo tá doente? Se sim, melhoras!"},{"author":"Paulo Silveira","comment":"estava! tentei fingir que nao, mas nao deu. obrigado Juliano"},{"author":"Deyvis Ferreira","comment":"Parabéns muito show!!Quando vai ter um podcast com conteúdo para QA's, Testes e etc???"},{"author":"Paulo Silveira","comment":"hum. noticias em breve :)"},{"author":"Lucas Almeida","comment":"Também senti falta de temas ligados a tecnologia... Já fui cliente da Smart Fit e não tem um controle de quantidade de pessoas, sempre muito cheio e os instrutores não conseguem atender a todos..."},{"author":"Edy Silva","comment":"Todos os podcasts são bons, eu pessoalmente prefiro os que falam sobre tecnologia. Quando vai sair um sobre linguagem Go ?"},{"author":"Paulo Silveira","comment":"a turma do Go está pressionando bastante :P. é um tema mais avancado, mas vamos ter um dia sim."},{"author":"Túlio Spuri","comment":"Golang +1"},{"author":"Ednaldo Dilorenzo","comment":"Só não achei legal o episódio de hoje por que não focou muito em tecnologia e sim e negócio. Acho que o propósito do podcast seria apenas tecnologia.Sobre a smartfit, sou frequentador de academia e achei legal a parte de pagar apenas pelo uso. Porém, o que conheço da smartfit não compensa para mim malhar nela, pois os instrutores são poucos e não são bons, o que praticamente obriga quem quer realmente malhar ter um personal trainer ficando mais caro que uma academia à moda antiga.Já para pessoas que sabem como malhar, não precisando de um instrutor, ou que já iriam ter um personal acompanhando de qualquer maneira, eu acho que vale muito a pena pelo baixo custo e alta qualidade dos equipamentos."},{"author":"Robson Oliveira","comment":"O Rodrigo Dantas citou um livro no episódio, alguém se lembra quela é?"},{"author":"Lucas Almeida","comment":"Innovators Dilemma"},{"author":"Robson Oliveira","comment":"Obrigado, falhei ai kkk ta no título do episódio."},{"author":"Vitor","comment":"Em relação a fechar negócios na Academia, um antigo colega de trabalho era responsável por novos negócios em nossa empresa. Ele era 100% sedentário e começou a frequentar a academia pelo networking, visto que vários executivos estavam lá \"livres\", sem precisar marcar reuniões para conversar. Vários negócios foram fechados e continuam."},{"author":"Luis Sérgio","comment":"Hoje eu não sou frequentador de academia, mas essa de pagar academia pra tomar banho eu já fiz. Ano passado eu trabalhava na cidade onde moro (São José dos Campos -SP) e pagava 50 reais por mês do lado do trabalho pra poder ir de bike.Mesmo com a mensalidade, investimento inicial e manutenção da bike, foi possível ter o retorno financeiro por economizar a passagem de ônibus.Então se forem criar o SmartShower, criem junto um espaço pra guardar a bike durante o dia."},{"author":"Maurício Linhares","comment":"SmartShower e SmartBed nos aeroportos por favor."},{"author":"Marlon Barcarol","comment":"Maurício Linhares Dentro de alguns aeroportos tem uma companhia chamada Yotel que tem umas \"capsulas\" para as pessoas dormirem e tomarem banho"}]}