{"title":"A vez do Ruby on Rails – Hipsters #52","releaseDate":"11/07/2017","tags":["Podcast","programação","web"],"people":["Paulo Silveira","Sergio Lopes","Rafael França","Lucas Mazza","George Guimarães"],"disqusUrl":"https://disqus.com/embed/comments/?base=default&f=hipsterspontotech&t_i=984%20http%3A%2F%2Fhipsters.tech%2F%3Fp%3D984&t_u=https%3A%2F%2Fhipsters.tech%2Fa-vez-do-ruby-on-rails-hipsters-52%2F&t_e=A%20vez%20do%20Ruby%20on%20Rails%20%E2%80%93%20Hipsters%20%2352&t_d=A%20vez%20do%20Ruby%20on%20Rails%20-%20Hipsters%20%2352%20-%20Hipsters%20Ponto%20TechHipsters%20Ponto%20Tech&t_t=A%20vez%20do%20Ruby%20on%20Rails%20%E2%80%93%20Hipsters%20%2352&s_o=default#version=600a9bd88a8393b10140eb70dcc30fd1","comments":[{"author":"Davi Mattos","comment":"#Kotlin no Hipsters"},{"author":"Luiz Eduardo Amorim","comment":"Ruby é sem sombra de dúvidas minha linguagem foco pra 2k17. Sempre quis aprender mas nunca me dediquei a desenvolver com ela mas acho que agora vai."},{"author":"Henrique Fernandes","comment":"Sigestão de podcast: Python"},{"author":"Wagner Abreu","comment":"Sugestão de podcast: Java, Scala e Kotlin."},{"author":"Arthur Bernardi Jordão","comment":"Kotlin por favor o/"},{"author":"Fabio Souza","comment":"#MaisSergioNoHipsters"},{"author":"Giorgio Torres","comment":"BTW, parabéns pelo excelente blog e pelo conteúdo que abordam aqui!"},{"author":"Giorgio Torres","comment":"Pessoal, o link do Rails doctrine tá duplicado com o link Artigos sobre Ruby do Martin Fowler."},{"author":"Paulo Silveira","comment":"consertado :)"},{"author":"Rafael Pontello","comment":"Exelente podcast!!! Me fez abrir bastante os olhos sobre railsAgora fico no aguardo para o podcast sobre Python e seu universo. :D"},{"author":"Felipe Volpatto","comment":"Só 36 minutos? :-(Ótimo episódio!"},{"author":"xfalcox","comment":"Muito bom o episódio!"},{"author":"João Antônio","comment":"#maisSergioNoHipsters vc manda muito bem. Parabéns pelo podcast, acompanho sempre."},{"author":"Jean C.","comment":"#MaisFlavioAlmeidaNoHipster pronto falei :PE parabéns pelo podcast! Vocês sempre mandando bem."},{"author":"Sérgio Lopes","comment":"#maisCausosDaVovoDoFlavioNoHipsters"},{"author":"Jean C.","comment":"hahahah exatamente :)"},{"author":"Eduardo Henrique","comment":"Esperando um podcast sobre Golang!"},{"author":"Edy Silva","comment":"Muito bom, parabéns! Estou completamente viciado nesse podcast.Linhares sou seu fã cara! Mestre das tretas rsrs#EsperandoAVezDoPython <3"},{"author":"Fernando Boaglio","comment":"#maisSergio #maisLinhares #maisTretas"},{"author":"Vítor Cardoso","comment":"Parabéns pela contribuição que vocês vem dando na podosfera.Apesar de ser analista de redes a alguns anos, estou acrescentando uma faculdade de análise e desenvolvimento no meu currículo e o conteudo abordado nos podcasts tem gerado mais curiosidade em conhecer o mundo do desenvolvimento.Sucesso rapaziada."},{"author":"Daniel Filho","comment":"#maisSergioNoHipsters #euAcredito #tamoJunto #mazzaFalaMaisSuaVozÉLinda #LorinhaMeAme"},{"author":"DuShin","comment":"Paulo faz um trabalho muito bom num problema que todos os podcasts técnicos tem: ele coloca o nível do podcast \"pra baixo\" e não deixa o tema \"viajante\" e acessível pra 20 pessoas. Muito legal o episódio."},{"author":"Paulo Silveira","comment":"Poxa, ler isso inflou meu ego! Que bom que isso fica perceptível. É um vício do modelo das aulas da Caelum/Alura: sempre desconfiar dos termos e conhecimento. Não custa nada dar um passo atrás e contextualizar siglas, fatos e técnicas que podem ser desconhecidas pelos ouvintes. Ah! Tem vezes que eu faço isso porque eu não sei mesmo do que estão falando :).Tentamos deixar a parte mais avançada do episódio sempre pro final, caso contrário não engajamos os ouvintes."},{"author":"A coisa","comment":"\"A galera não vai usar Rails para fazer API\".Não é bem assim, amiguinho. :p"},{"author":"Cesar Lemos","comment":"Façam um podcast só de treta please"},{"author":"Sérgio Lopes","comment":"Podia fazer um só falando mal de tudo né hahaha.Episódio Evil Week no Halloween 😈"},{"author":"Cesar Lemos","comment":"#maisSergioNoHipsters"},{"author":"A coisa","comment":"O Rails é subestimado. Muito subestimado! Até hoje, vários frameworks de outras linguagens ainda correm atrás do que o Rails oferece a tempos. Se for para escolher desenvolver algo para web, em linguagens \"tradicionais\" como Java, PHP, C#, Python, etc., não tenho dúvida que minha escolha hoje é Ruby com o Rails. Disparado o mais produtivo dessas linguagens! Agora, obviamente se precisar de algo muito mais performático e escalável, iria de Node, Elixir ou Go. Porém a questão é, quantas aplicações hoje, precisam da escalabilidade que Twitter, Facebook, entre poucas outras precisam? É tudo questão de necessidade."},{"author":"Vandemberg Silva Lima","comment":"O Maurício Linhares se esquivou do podcast para não gerar tretas?! hahahaha. Brincadeira. ENFIM! Hipsters nunca decepciona!!! <3"},{"author":"Maurício Linhares","comment":"HAHAHAHA, até queria, mas tava viajando :("},{"author":"Giovanni Tempobono","comment":"Excelente podcast! estava esperando ansiosamente pela vez do Ruby on Rails, e ninguém mais qualificado para falar do que o pessoal da Plataformatec. Obrigado pelo conteúdo, pena que o podcast ficou curto! esperando ansiosamente os próximos podcasts. :)"},{"author":"Ítalo Araújo Siqueira","comment":"Paulo, só uma info a mais, o DHH ganhou a maior prova de longa duração no mundo, as 24 horas de Le mans, correu pela equipe oficial da Aston Martin, o que é um grande feito."},{"author":"Paulo Silveira","comment":"bem lembrado. no site dele tem muitas fotos"},{"author":"Paulo Kenobi","comment":"Por favor, façam um Podcast sobre as novas linguagens que estão surgindo, falando das dificuldades e vantagens e visão do futuro de cada uma, a que mais tenho interesse é a Golang, do Google."},{"author":"Ednaldo Dilorenzo","comment":"A impressão que ficou do podcast, pra mim que não conheço Ruby, é que ele é muito bom para aplicações simples, mas não tão bom para sistemas muito grandes e complexos. Achei também que o Rafael não ficou muito seguro com relação aos problemas de escalabilidade. Mas sempre gosto dos podcasts, principalmente quando são assuntos que não conheço."},{"author":"AkitaOnRails","comment":"Problemas de escalabilidade não são tão ruins quanto parece. Já trabalhei num cliente com mais de 90 microservices Rails. Ela fatura quase 1 bilhão de dólares por ano. E usava Heroku pra tudo.Os casos que se vê em blogs com sérios problemas com casos muito específicos que a maioria nunca vai enfrentar.A verdade é que os 80% dos web apps do mundo mantém servidores idle a maior parte do tempo. Raramente alguém vai ter os problemas do Facebook ou Twitter."},{"author":"Ednaldo Dilorenzo","comment":"Me corrijam se eu estiver errado, mas até onde sei o twitter refatorou  para scala, além de outros."},{"author":"Marcelino","comment":"Todas tecnologias ja passaram por isso, tiveram apps reescritas em outra linguagem ou que foram quebrada em serviços escritos em varias outras linguagem.Nesse caso \"twitter x scala x ror\",  para se ter um resposta teria que se descobrir, depois do tal refactory quantos apps foram criados em Scala e quantos foram criados em RoR e quantos ainda estão rodando até hoje ou funcionaram bem, ai teremos um sensação  mesmo que ilusória de quem ganhou a treta e quem teve razão."},{"author":"AkitaOnRails","comment":"Sobre a controvérsia do Twitter. Isso é assunto resolvido de 2009. http://www.akitaonrails.com..."},{"author":"Paulo Kenobi","comment":"Cheguei a mesma conclusão, Ednaldo. Só fiquei confuso porque eles citaram algumas empresas grandes que usam RoR, provavelmente devem viver contornando problemas de escalabilidade. Acho que nenhum dos sites que eles citaram é tão acessado e usado como o Twitter, logo devem ter menos problemas também."},{"author":"Marcelino","comment":"Cara escalabilidade não é algo trivial em lugar nenhum, independente da tecnologia sempre terás que \"viver contornando os problemas\" para escalar. E na boa, Twitter, Facebook da vida, estão fora do padrão de apps, são exceções, unicórnios da vida, não devem nem ser considerados como parâmetro, sem contar hoje seria ate difícil dizer qual seria a linguagem mais usada neles.\n\n\nReproduzir\n\n\n Ocultar\n\n\n\n\n da pra conhecer muito do que já foi feito, do que é feito, e do que pode ser feito com Rails."},{"author":"Márcio Sancho","comment":"Show de bola o cast! Galera muito boa. Nem sei porque estão reclamando. #maissergionohipster"},{"author":"Odinei Ramone","comment":"Eu vou concordar com o Roberto Laureen mas de uma forma mais branda. O cast foi realmente bem simples, senti uma falta de empolgação dos participantes. Acompanho o hipsters faz algum tempo e, se formos comparar, os casts de Elixir, JS e PHP (esse principalmente) foram muito melhores e mais empolgantesNa verdade eu sinto uma falta de entusiasmo na comunidade ruby em geral"},{"author":"Paulo Silveira","comment":"eu cometi um erro nesse podcast: como houve problemas no microfone (que foram editados, claro), gravar 55 minutos gerou apenas 35 minutos de conteudo, bem menos do que a quantidade que costumamos gravar. se eu tivesse me atentado a isso, o episodio teria ficado com o tamanho normal e certamente mais rico. mea culpa"},{"author":"Fabrício Cabral","comment":"Paulo SilveiraPois é, acho que este foi um dos podcasts mais curtos que já rolaram, infelizmente! Mas problemas técnicos acontecem, né? #vidaquesegue"},{"author":"Odinei Ramone","comment":"Paulo, primeiramente, obrigado pela resposta ^^Eu notei isso também mas eu preferi não dizer porque eu prefiro podcasts longos e as vezes só não rolou disso acontecer com esseMas a simplicidade não vem da duração do cast e muito menos dos envolvidos. Como disse alí em cima, sinto falta do entusiasmo da comunidade Ruby :'("},{"author":"Nyo","comment":"Muito bom, como sempre,acompanho desde sempre.Sugestões :Programação de games -  UnityProgramação de games -  UnrealPython - Em que usar, o que e ?"},{"author":"Rogers Silva de Cristo","comment":"Já que o Paulo sugeriu pedir temas:- Como funcionam as certificações no mundo TI?- Episódios de história da computação, e.g., história das linguagens, de hardware, software.- Rust, modinha ou veio para ficar? Principais características e aplicações da linguagem.|edit| Já ia esquecendo: Por favor, façam mais episódios que abordem assuntos além do desenvolvimento web :)"},{"author":"Roberto Laureen","comment":"Extremamente baixa a qualidade da conversa..os convidados mostraram que não tem experiência suficiente para falar do assunto...Recomendo refazer esse topico..seriamente.."},{"author":"Daniel Filho","comment":"pra ser sincero eu ainda tou procurando sarcasmo nesse comentário, mas tá difícil achar. não é possível que foi sério."},{"author":"Paulo Kenobi","comment":"Hater detected."},{"author":"Paulo Silveira","comment":"O próprio committer e programdor do Rails não tem experiência em Rails? Boa piada Roberto!! :)"},{"author":"Cesar Lemos","comment":"Olha as treta"}]}